[{
  "_id": {
    "$oid": "65b102fd18861c526b587c0b"
  },
  "asin": "B0779Q3FZZ",
  "title": "niupipo Pickleball Paddle USAPA Approved Pro Graphite Pickleball PaddlePaddles Set Polypropylene Honeycomb Core Cushion 472In Grip Portable BagPaddle Cover Lightweight Pickleball Racket",
  "link": "https://m.media-amazon.com/images/I/61DzTEEM7FL._AC_SX466_.jpg",
  "detail": "Premium Grip and Perfect Handle Size - The USAPA pro pickleball racquet is comfortable to handle and works well while playing; Pickleball racquet is perforated, sweat-absorbent, and cushioned, providing a better paddle grip for longtime play without fatigue; Wide-body pickleball racquets shape with 4.5-inch grip length and 4.25-inch grip circumference; Paddle dimensions: 15.5 inches (L) x 7.9 inches (W) x 0.5 inches (H), lightweight pickleball racquet 8 ounces"
},
{
  "_id": {
    "$oid": "65b247efd7793d69ff738e15"
  },
  "asin": "B07BJY4YS6",
  "title": "niupipo Pickleball Paddles USA Pickleball Approved Pickleball Paddles Set of 2 Carbon Fiber Face Polypropylene Honeycomb Core Pickleball Rackets with 1 Pickleball Bag2 Covers",
  "link": "https://m.media-amazon.com/images/I/619fDV5nKtL._AC_SX569_.jpg",
  "detail": "The Perfect Combination of the Graphite Honeycomb Core and Graphite Carbon Fiber Surface; While the graphite honeycomb core increases the strength, it also greatly reduces the weight, so the weight of the carbon fiber pickleball paddle is only 7.83-8.0 oz; The durable graphite carbon fiber surface provides great energy to spin the ball, and it can easily withstand the impact of the ball; Light and strong, carbon fiber pickleball paddles achieve both"
},
{
  "_id": {
    "$oid": "65b247efd7793d69ff738e1a"
  },
  "asin": "B07CSRB6SH",
  "title": "EMEET Bluetooth Speakerphone M2 Gray Conference Speaker Idea for Home Office 360 Voice Pickup 4 AI Echo amp Noise Canceling Microphones Skype USB Speakerphone AUX inOut for up to 8 People",
  "link": "https://m.media-amazon.com/images/I/71k9of06JCL._AC_SX425_.jpg",
  "detail": "Multiple Connections & High Compatibility- No driver need, just plug and play. EMEET M2 Bluetooth speakerphone saves your time to debug devices. Beside, M2 speakerphone easily connected to your mobile phone, tablet, PC just use the Bluetooth/ USB or AUX in/out wire. Not just in hardware, in terms of software compatibility, it has been tested and optimized for mainstream softphones like Zoom, Skype and etc. Operating systems like Windows (Win7,8,8.1, 10,11), macOS (10.10 and above), Android,"
},
{
  "_id": {
    "$oid": "65b247f0d7793d69ff738e1f"
  },
  "asin": "B07FMS9XQF",
  "title": "EMEET Bluetooth Speakerphone M2 Black Conference Speaker for 58 People Business Conference 360 Voice Pickup 4 AI Microphone SelfAdaptive Conference Call Speaker Skype USB Speakerphone",
  "link": "https://m.media-amazon.com/images/I/7152FUMnOvL._AC_SX679_.jpg",
  "detail": "Simple But Powerful- No driver needed, plug and play. The EMEET M2 Bluetooth conference speakerphone saves your time to debug devices. eMeet skype speakerphone can be easily connected to your Bluetooth supported mobile phone, tablet, PC with USB or AUX wire. The dynamic equalizer inside could automatically switch between voice and music modes and delivers the best sound quality and EQ depending on what the user is listening to."
},
{
  "_id": {
    "$oid": "65b247f0d7793d69ff738e24"
  },
  "asin": "B07G33V3K9",
  "title": "2 in 1 Cooler amp Heater  Desk Electric Small Cooling and Heating Fan Combo W Tip Over amp Overheat Protection Desktop for Indoor Use Home Room Office Bedroom Room Personal",
  "link": "https://m.media-amazon.com/images/I/61qJWKlapVL._AC_SY450_.jpg",
  "detail": "Air Circulating & Heating Dual Modes for All Year Around - Is your fan only can use in summer Here is the desk heater and fan combo for office! Equipped with high & low circulating modes in this office heater and fan combo, cool air from the air conditioner can be sent to whole room, giving you a whole-room cooling comfort in summer. And the Rapid heating system w/ 750W & 1500W modes helps you to enjoy the warmth in winter. Own small fan heaters for indoor use to accompany you all year around."
},
{
  "_id": {
    "$oid": "65b247f0d7793d69ff738e29"
  },
  "asin": "B07G84P94Q",
  "title": "VIVREAL Handheld Massager  6 Speeds amp 6 Modes 6 Interchangeable Nodes Cordless Massager Muscle Massager for Back Foot Neck Shoulder and Leg Body Pain Relief Home amp Office Grey",
  "link": "https://m.media-amazon.com/images/I/51bC9nPiGfL._AC_SX679_.jpg",
  "detail": "【Powerful Motor & Safety】- Ergonomic motor with extremely powerful up to 3200 pulses per minute, could effectively relieve pains, deeply penetrate your tissues and muscles, mimicking the vigorous kneading. Using pure copper motor, the percussion therapeutic massager has a longer service life and overheat protection. After using 15 minutes, it will automatically stop for preventing from overheat or overuse such as when falling asleep."
},
{
  "_id": {
    "$oid": "65b247f0d7793d69ff738e2e"
  },
  "asin": "B07GVDXW5D",
  "title": "niupipo Pickleball Paddle USAPA Approved Pro Graphite Pickleball PaddlePaddles Set Polypropylene Honeycomb Core Cushion 472In Grip Portable BagPaddle Cover Lightweight Pickleball Racket",
  "link": "https://m.media-amazon.com/images/I/71f4huzyfoL._AC_SX466_.jpg",
  "detail": "Comes with 1 Bag and 4 Balls; Every Niupipo USAPA Pro pickleball set is designed to be an awesome pickleball paddle for either a beginner or a professional player; The pickleball set contains 1 Bag and 4 pickleballs"
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e33"
  },
  "asin": "B07PP55QF9",
  "title": "Tymate Tire Pressure Monitoring System M123  Solar Charge 5 Alarm Modes Auto Sleep Mode Tire Position Exchange 4 TPMS Sensors 087 PSI",
  "link": "https://m.media-amazon.com/images/I/41J0ijP+oXL._AC_SX355_.jpg",
  "detail": "??Auto Backlight & Sleep & Awake Mode?? Tymate Tire Pressure Monitoring System M12-3 Blue's auto-adjustable backlight can clearly display the data in low light or strong light environment. Real-time monitoring and real-time display of data is the best helper for driving. It will enter the sleep energy-saving mode after the vehicle stops running for 10 minutes, and will automatically wake up when the car is turned on. Prolong product life while saving energy."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e38"
  },
  "asin": "B07RV2YPQ3",
  "title": "Tymate TPMS Tire Pressure Monitoring System  Large Colorful Screen TPMS 4 Alert Modes with 4 Advanced External TPMS Sensors Realtime Detection Tire PressureampTemperature 087 PSI",
  "link": "https://m.media-amazon.com/images/I/6161z5xe-PL._AC_SX569_.jpg",
  "detail": "??Please Notice?? We do not recommend you to use this models on the RV trailers or other large vehicles, becasue of the potential interference."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e3e"
  },
  "asin": "B07V1SQ966",
  "title": "Lepow Portable Monitor 156 Inch Full HD 1080P USB TypeC Computer Display IPS Eye Care Screen with HDMI Type C Speakers for Laptop PC PS4 Xbox Phone Included Smart Cover amp Screen Protector Black",
  "link": "https://m.media-amazon.com/images/I/81spIK64wwL._AC_SX355_.jpg",
  "detail": "[FHD 1080P IPS Screen] Lepow USB C 1920*1080 portable monitor delivers a truly immersive viewing experience that lets you enjoy High-Definition entertainment and gaming. The 15.6 inch Full HD IPS screen use eye protection that keeps your eyes from getting tired during prolonged use."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e43"
  },
  "asin": "B07VFRTPKC",
  "title": "Space Heater for Office  Portable Electric Ceramic Quiet Tower Heater Fan with Thermostat Fast Heating 120Oscillating Efficient for Personal Home Bedroom Large Room Bathroom Under Desk Indoor Use",
  "link": "https://m.media-amazon.com/images/I/81Y538ja33L._AC_SX425_.jpg",
  "detail": "??【Accompany You Without Any Disturb】?? Is your old heater noisy when running Worried about the terrible noise from the heater will bother others 1. Using low-noise tech, silence heater for bedroom is designed to keep the room nice and warm on those cold nights without any disturbance. 2. Different from radiant heat, this efficient electric space heater does not have any strong light when heat up the room, promising you a comfortable warm night. Enjoy your every warm moment with it."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e48"
  },
  "asin": "B07VV8JND3",
  "title": "RM RICOMAX Metal Detectors for Adults  Professional Gold Detector for Treasure Hunt IP68 Waterproof 10 Search Coil Higher Accuracy with Stong Modes Adjustable LCD Display with Headphones",
  "link": "https://m.media-amazon.com/images/I/71pfeXI-1fL._AC_SX466_.jpg",
  "detail": "??IP68 Waterproof & Big Search Coil - The underwater metal detector is an IP68 waterproof unit with a 10\" big search coil, and the shaft that the coil is connected to is made of aluminum. The Advanced DSP Chip makes it more accurate than others and you can detect up to 10\" depth, which means you could take it to a river or the beach to explore the hidden treasure underwater."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e4d"
  },
  "asin": "B07VZW1L9N",
  "title": "RM RICOMAX Metal Detector for Kids  74 Inch Waterproof Kid Metal Detectors Gold Detector Lightweight Search Coil 2435 Adjustable Metal Detector for Junior amp Youth with High Accuracy  Yellow",
  "link": "https://m.media-amazon.com/images/I/610sfkvxLAS._AC_SX466_.jpg",
  "detail": "?FREE OF ASSEMBLE & EASY TO USE? - The telescoping design means you don’t need to assemble any complicated parts. Just unfold the detector and fold it back up again when you’re done, making it especially good for children and beginners."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e53"
  },
  "asin": "B07VZWL1XN",
  "title": "Metal Detector for Kids  Kid Metal Detector Junior 74 Inch Waterproof Search Coil Junior Metal Detector LCD 24 Inch to 35 Inch Adjustable Stem Buzzer Vibration Sound 2 Pouds Lightweight Easy to Use",
  "link": "https://m.media-amazon.com/images/I/61C9BeOMGCL._AC_SX425_.jpg",
  "detail": "???? Clear Detection by Buzzer & LCD ???? - If there is any metal object, the an arrow and signal symbol will appear on the screen, meanwhile it sounds. The closer they are, the louder it sounds and the signal will be stronger."
},
{
  "_id": {
    "$oid": "65b247f1d7793d69ff738e59"
  },
  "asin": "B07W4H57ZN",
  "title": "Room Heater Indoor Use  1500W Quiet FastHeating Small Indoor Heater Space Heater for Large Room Heating wThermostat 3 Modes Tip Over amp Overheat Protection Portable Indoor Heater Fan for Indoor",
  "link": "https://m.media-amazon.com/images/I/710aTX3koNL._AC_SX425_.jpg",
  "detail": "???? 【Portable Design】 With the size 7.1 x 6.3 x 9.1 in & 3. 1Ib, this small heater for indoor use is portable for daily use, such as for bedroom, kitchen, bathroom, office, home, under desk, and so on. Fully Assembled with an easy-to-carry handle, you can place or move it from the floor to the table or anywhere you want easily. You are totally risk-free with our small space heater and fan combo. Just rest at ease and get one!"
},
{
  "_id": {
    "$oid": "65b247f2d7793d69ff738e5e"
  },
  "asin": "B07WMTLDH7",
  "title": "hohem 3Axis Gimbal Stabilizer for iPhone 13 12 11 PRO X XR XS Smartphone with 3D Inception Sport Mode Object Face Tracking Motion TimeLapse Quick Balance Handheld Gimbal for Vlog Youtuber Live Video",
  "link": "https://m.media-amazon.com/images/I/71IbwIiGzqL._AC_SX466_.jpg",
  "detail": "【Compatible for most smartphones】 Payload up to 280g, with 58-89mm phone clip width, fit for most smartphone under 6'' Screen. Ideal for iPhone 13 12 11 xs max xs xr x 8plus 8 7plus 7, Samsung Galaxy s10e s10 plus s10 s9 plus s8 s8 plus s7 s7 edge s6 s6 edge note9 note8, Huawei P30 pro p30 p20 pro p10 p10 plus p9 mate10 mate9 mate8"
},
{
  "_id": {
    "$oid": "65b247f2d7793d69ff738e64"
  },
  "asin": "B07ZFX8YKN",
  "title": "Airdog V5 Car Air Purifier  Patented TPA Technology Quiet Portable Air Purifier for Car Washable Filter Remove 999 of Dust Smoke Odors and Harmful Particles Ideal for Car Office Bedroom",
  "link": "https://m.media-amazon.com/images/I/61Orph9XbTL._AC_SX679_.jpg",
  "detail": "[Patented TPA Technology: Active Filtration] Airborne contaminants are an issue you would like to get rid of Say goodbye to allergies, congestion, and sneezing caused by contaminants with the Airdog portable air purifier for car, featuring TPA technology that captures 99.9% of particles as low as 0.0146 microns to PM 2.5 (VOCs, odors, exhaust) and large particles (smoke, pollen, dust, pet hair). TPA filters don't just collect but terminate harmful particles."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e69"
  },
  "asin": "B07ZH9GKTY",
  "title": "DOG CARE Automatic Bark collar  Comfortable dog bark collar Easy to use with beep vibration amp shock modes Very effective and humane dog shock collar with 5 adjustable sensitivity levels No remote",
  "link": "https://m.media-amazon.com/images/I/61mq-keyYoL._AC_SX569_.jpg",
  "detail": "2 selected humane training modes - Our bark collar for dogs provides 2 extremely efficient and effective training modes for your stubborn dog. You can try to choose different options to test which one is more effective to correct your dog’s uncontrollable barking behaviors. We make sure that both training modes of this shock collar for barking are safe and useful to help stop your dog’s barking under any occasions"
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e6e"
  },
  "asin": "B0829YLB1V",
  "title": "EMEET Bluetooth Speakerphone Daisy ChainUse Alone up to 16 attendees M220 Professional Wireless Speakerphone 360Voice Pickup 8 AI Noise Cancellation Mics Skype Speakerphone for Conference Calls",
  "link": "https://m.media-amazon.com/images/I/71a9rTEG0+L._AC_SX679_.jpg",
  "detail": "Led Indicator Design & Portable Size w/Case With beam-forming technology, M220 accurately identifies the position of the people who are talking and indicate voices at different angles through LED lights. More, the ring light will clearly tell you the volume, power and connection status of M220. Considering the evection of businessmen, M220 Bluetooth conference speakerphone comes with a protective case to easily carry it around! JUST bring M220 speakerphone to office/ home or when traveling!"
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e73"
  },
  "asin": "B0839DZLV9",
  "title": "Mesh WiFi System  Mesh Router up to 6000 sq Ft and 90 Devices Whole Home Coverage 1200Mbps WiFi Mesh Network WiFi RouterExtender Replacement Gigabit Ports Easy Setup Parental Control 3 Pack",
  "link": "https://m.media-amazon.com/images/I/61hsvH7OQ7S._AC_SX522_.jpg",
  "detail": "【True Seamless and Dual-band Mesh Technology】 Equipped with rockspace mesh technology, your home WiFi will jump to the next level of the wireless network. Enjoy the seamless and consistent connection in any corner of your house, prevent buffering, disconnection, and data packet loss during important online transmission and conferences. The combined speed of the dual-band is up to 1.2Gbps, please enable the smart assistant for a 2.4ghz signal"
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e78"
  },
  "asin": "B083SMK22Y",
  "title": "DOG CARE Dog Training Collar Rechargeable Training Collar with 3 Training Modes and Waterproof Vibration Collar Large Remote Range 2 Receivers Dog Training Collar with Remote",
  "link": "https://m.media-amazon.com/images/I/511H9f7FaWL._AC_SX569_.jpg",
  "detail": "Multiple Training Modes Dog Remote Shock Collar - Dogcare Dog Training Collar provides extremely efficient and safe training modes (beep, vibration and shock.)You could use this dog collar for training, playing or teaching your dog some basic obedience commands. What's more, you could solve uncontrollable dog's behavior problems with this dog collar training set"
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e7d"
  },
  "asin": "B0863GM4YR",
  "title": "Lepow Portable Monitor Z1Gamut Laptop Display 156 FHD Improved Color Gamut IPS 1080P UltraSlim TypeC amp HDMI Travel Monitor Dual Speakers Ideal for Laptops PCs Phones Switch PS43 Xbox",
  "link": "https://m.media-amazon.com/images/I/81SkakoZ4kL._AC_SY450_.jpg",
  "detail": "【Multiple Inputs and Wide Compatibility】With two Type-C ports, as well as Mini HDMI and 3.5mm audio inputs, the 15.6 inches Lepow portable monitor for laptop provides multiple connection options for laptops, PCs, Smartphone, PS3/4, XBOX ONE or Switch, etc."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e82"
  },
  "asin": "B086V16NHR",
  "title": "RV Tire Pressure Monitoring System RV TPMS 6 Sensors 7 Alert Modes 14 Days Battery Life 80ft Sensing Distance Large Screen for RV Trailer Coach Motor Home Fifth Wheel 0188psi 4 185",
  "link": "https://m.media-amazon.com/images/I/71vbwtnL5RL._AC_SX569_.jpg",
  "detail": "??14 Days Battery Time - Energy-saving large-size LCD, observe up to 22-24 tires, and the content includes temperature (°F / °C), pressure (PSI / BAR) at the same time. 4 hours fully charged, keep to 12-14 days."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e87"
  },
  "asin": "B086V1ZH4W",
  "title": "RV Tire Pressure Monitoring System RV TPMS 8 Sensors 7 Alert Modes 14 Days Battery Life 80ft Sensing Distance Large Screen for RV Trailer Coach Motor Home Fifth Wheel 0188psi 4 185",
  "link": "https://m.media-amazon.com/images/I/61mBTdp0PxL._AC_SY355_.jpg",
  "detail": "??Max up to 80 ft Sensing Distance - Equipped with a repeater (EXCEPT FOR 4-SENSOR MODEL), sensor signal transmission distance max up to 80 ft. tire pressure monitoring range is 0-188psi, the tire temperature monitoring range is -4~185 ℉."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e8c"
  },
  "asin": "B086V3YJ1X",
  "title": "RV Tire Pressure Monitoring System RV TPMS 12sensor 7 Alert Modes 14 Days Battery Life 80ft Sensing Distance Large Screen for RV Trailer Coach Motor Home Fifth Wheel 0188psi 4 185",
  "link": "https://m.media-amazon.com/images/I/716wLDv4dcL._AC_SY355_.jpg",
  "detail": "??14 Days Battery Time - Energy-saving large-size LCD, observe up to 22-24 tires, and the content includes temperature (°F / °C), pressure (PSI / BAR) at the same time. 4 hours fully charged, keep to 12-14 days."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e91"
  },
  "asin": "B087FRNS6P",
  "title": "Conference Speaker and Microphone  EMEET Luna 360 Voice Pickup wNoise ReductionMuteIndicator USB Bluetooth Speakerphone wDongle for 8 People Daisy Chain for 16 Compatible with Leading Software",
  "link": "https://m.media-amazon.com/images/I/61tes71a5dL._AC_SY450_.jpg",
  "detail": "[VoiceIA Noise Reduction Technology] The EMEET Luna conference speaker and microphone feature the exclusive upgraded VoiceIA tech, eliminating background noise such as air conditioning noise, keyboard clicks, and general background noise. This advanced noise-cancellation technology makes the computer speaker with microphone a must-have device in your home office. Experience a different kind of effective remote meeting!"
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e96"
  },
  "asin": "B087G5MFN1",
  "title": "Daisy Chain Cable 35 mm Male to Male Stereo Audio Aux Cable use for LunaM3M220M2M2 MAXLuna Lite Speakerphonemand EMEET Meeting Capsule extensible Expanding Meeting Space up to 1216 People",
  "link": "https://m.media-amazon.com/images/I/51lbyedPEoL._AC_SX569_.jpg",
  "detail": "Stretchable length - This cascade cable is extensible. It is about 134-inch-long."
},
{
  "_id": {
    "$oid": "65b247f3d7793d69ff738e97"
  },
  "asin": "B087JCJK4N",
  "title": "Gimbal Stabilizer for Smartphone 3Axis Phone stabilizer with Tripod Foldable Phone Gimbal for Android and iPhone 14 PRO MAX Stabilizer for Video Recording with 600 Auto Rotation  hohem iSteady X",
  "link": "https://m.media-amazon.com/images/I/61xnu07OgZL._AC_SY355_.jpg",
  "detail": "【Extremely Easy Operation】Based on the vision that everyone can be a director of his life. iSteady X foldable stabilizer adapts the one-handed & simple design by putting most essential functions within the palm of your hand. All you need to do is click once to achieve the switch of the phone from landscape to portrait mode,switch over shooting and recording and click twice to switch over the front and rear camera. It’s so convenient that you can focus on your filming without any interruption."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738e9d"
  },
  "asin": "B087JCK6XM",
  "title": "Lepow Portable Monitor 2022 156 FHD 1080P Computer Display with IPS Eye Care Screen Dual FullFunction TypeC Builtin Speakers amp Smart Cover External Monitor for Laptop Phone Switch Xbox PS4",
  "link": "https://m.media-amazon.com/images/I/71gzc9cQVSL._AC_SX466_.jpg",
  "detail": "[Plug and Play] This portable computer monitor is equipped with two full-function Type C ports, the upper one supports HDMI connection/Type-C connection/power supply, and the lower one supports Type-C connection/power supply. It easily accesses your laptops, PCs, phones, Xbox, PS4, etc. It is recommended to connect an external power supply of 5V/2A or above first for more stable HDMI connection/Type-C connection."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ea2"
  },
  "asin": "B087JPXWJF",
  "title": "Gimbal Stabilizer for Smartphone 3Axis Phone stabilizer with Tripod Foldable Phone Gimbal for Android and iPhone 14 PRO MAX Stabilizer for Video Recording with 600 Auto Rotation  hohem iSteady X",
  "link": "https://m.media-amazon.com/images/I/71UqOA1Cn0L._AC_SY450_.jpg",
  "detail": "【Wide Compatibility & 8 Hours Long Lasting】Thanks to the perfect compatibility, this gimbal stabilizer for Smartphone is compatible with iPhone 14 pro pro max 13 pro pro max\\xs max\\xs\\xr plus8 plus Samsung Galaxy S22 + s10es10 plusNote10, Huawei P50pro P40P40+P30mate 30. Moreover, the 2000 mAh Li-battery enables the phone gimbal stabilizer run-up to 8H to meet your all-day needs."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ea7"
  },
  "asin": "B087ZK3799",
  "title": "TRUSTECH Accessories for Portable Air Conditioner Remote Control",
  "link": "https://m.media-amazon.com/images/I/61PGy7Xo9LL._AC_SY355_.jpg",
  "detail": "Accessories"
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ea9"
  },
  "asin": "B0886DL4DT",
  "title": "Pack of 2 10000 mg dapheno Oil Natural Extract for Relief Grown and Made in The USA Natural Purely Organic Vegan Friendly Great Gift",
  "link": "https://m.media-amazon.com/images/I/71IRuLMxXRL._AC_SX522_PIbundle-2,TopRight,0,0_SH20_.jpg",
  "detail": "Supercritical CO2 Extraction for Excellent Absorption - Extraction by supercritical carbon dioxide extraction at optimal extraction temperature and pressure to present the highest purity, making it rich in natural Organic ingredients."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738eae"
  },
  "asin": "B088BY9PJG",
  "title": "EMEET 3 in 1 Webcam  1080P Webcam with Microphone and Speakers Noise Reduction Auto Low Light Correction WCover C980 Pro USB Camera Webcam 90 for Video Conferencing StreamingGamingClass",
  "link": "https://m.media-amazon.com/images/I/71ve2WhTWKL._AC_SY450_.jpg",
  "detail": "[90° Wide Angle of View & Low-light Correction] - The 90-degree field of view EMEET streaming camera with microphone has is wide enough to capture teams and whiteboards with ease. Ideal for online team business meetings, family group meetings. Superior automatic low-light correction reduces graininess and brings out details in darker environments, adjusting according to the conditions to provide a consistently high definition."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738eb3"
  },
  "asin": "B08B1821YS",
  "title": "SOKEA Large Lighted Makeup Mirror  Portable Vanity Mirror with 88 LED Lights and Magnification Lighted Vanity Mirror with 10X Magnifying Mirror 3 Colors Lighting Modes Stepless Dimming Women Gift",
  "link": "https://m.media-amazon.com/images/I/71vWs+glxuL._AC_SY450_.jpg",
  "detail": "Imported"
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ebb"
  },
  "asin": "B08BCKNZY5",
  "title": "Electric Space Heaters for Indoor Use Large Room Infrared Heater wRemote Auto Shut Off 50010001500W Radiant Heater Super Quiet 3s Instant Warm Vertical Indoor space heaters Patio Heater",
  "link": "https://m.media-amazon.com/images/I/31XzPjoPC9L._AC_SX466_.jpg",
  "detail": "【3 Second Heat & 3 Heat Settings】Space heaters for indoor use can provide instant and efficient warmth within 3 seconds. Heating up in seconds brings instant and focused heat. The heater for bedroom has 3-level heat settings: 500/1000/1500W modes. Just choose an ideal level according to your needs. Trustech patio heater is beneficial to your health in boosting metabolisms, such as alleviating the symptoms of Rheumatology, Arthritis, and fatigue."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ec0"
  },
  "asin": "B08BFMZDXN",
  "title": "Trustech Space Heater  Portable Electric Heater with Remote Ocillating Ceramic Heater with Thermostat 12h Timer 3 Mode Safe TipOver amp Overheat Efficient Fan Heater for Indoor Use for Bedroom Office",
  "link": "https://m.media-amazon.com/images/I/81wtVcuG0HL._AC_SX569_.jpg",
  "detail": "?【Comfort Quiet Warming & 12H Timer】Trustech personal space heater with remote focus on Ultral-Quiet heating technology which can offer you a warm and undisturbed environment. Features in 12H timer, this electric room heater will automatically shut off at the specific time you set in advance. Fast-heating ceramic tower heater for garage, living room, and home office indoor use."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ec5"
  },
  "asin": "B08CXQJDRY",
  "title": "Electric Space Heater for Large Room  36 Ceramic Tower Space Heater for Room Heating wThermostat Fast Heating 3D Realistic Flame Oscillating Remote Control Ideal for HomeLivingroom",
  "link": "https://m.media-amazon.com/images/I/61yIqQPumnL._AC_SX466_.jpg",
  "detail": "【Ease to Control】 The portbal space heater combined with remote control, digital touch panel & built-in handle, you can control the portable space heater remotely, carry it from room to room."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ecb"
  },
  "asin": "B08DTR118S",
  "title": "2 in 1 Cooler amp Heater  Desk Electric Small Cooling and Heating Fan Combo W Tip Over amp Overheat Protection Desktop for Indoor Use Home Room Office Bedroom Room Personal",
  "link": "https://m.media-amazon.com/images/I/61qJWKlapVL._AC_SY450_.jpg",
  "detail": "Small Size & Low Noise - Is your old fan is too large to handle Trustech small-size electric 2 in 1 fan and heater for office will be a great choice for office, home use. Specially designed with a built-in carrying handle and rectangular shape, More convenient for you to move and place this desktop fan. Adopting upgrades technology, this electric heater fan for the home is quiet when working, reading, or sleeping. It keeps you pleasantly cool and comfortable without noise in torrid summer."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ed0"
  },
  "asin": "B08DTTV7BC",
  "title": "RV Tire Pressure Monitoring System RV TPMS 4 Sensors 7 Alert Modes 14 Days Battery Life Long Sensing Distance Large Screen for RV Trailer Coach Repeater not Provided 0188psi 4 185",
  "link": "https://m.media-amazon.com/images/I/713SuZnZVoL._AC_SX466_.jpg",
  "detail": "??Professional Customer Service - Our contact information(email and phone) are in the Q&A part in this product page, which is pinned. And please watch the instruction video on our product page, which is on the first of the related videos on this page. PLEASE NOTE: The sensor battery can be replaced, and the model is CR2032."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738ed5"
  },
  "asin": "B08FDM5RZ5",
  "title": "Pet Camera  Indoor Security Camera Ucam by Tenvis amp IoTeX Home Security Camera with Motion DetectionNight Vision2Way Audio Blockchain Authorization 100 Data Privacy Amazon Cloud amp SD Storage",
  "link": "https://m.media-amazon.com/images/I/71pCcoztPOL._AC_SX522_.jpg",
  "detail": "[FHD 1080P & Night Vision] TENVIS UCAM with FULL HD glass lens deliver Razor Sharp and Crystal Clear vision. Night vision lets you see up to 36-ft in absolute darkness using infrared (IR) LEDs."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738eda"
  },
  "asin": "B08FRK1BJ9",
  "title": "GUTA Tire Pressure Monitoring System for RV  8 Sensor TPMS for Trailer 7 Alarm Modes Large Screen Endurance Battery Life Long Sensing Distance Wireless Sensor Pairing 2022 Update Version",
  "link": "https://m.media-amazon.com/images/I/61z4TPAX79L._AC_SX466_.jpg",
  "detail": "??[Multiple Charging Methods - Solar Power & USB Charging] GUTA tire pressure monitoring system supports USB cable charging & solar charging. It can be fast-charged without occupying the car cigarette lighter socket and manual charging, to ensure the tire pressure monitoring system could work continuously. Press \"set\" and \"+\" at the same time for at least 1 second to power on, and press \"set\" and \"-\" at the same time for at least 1 second to power off."
},
{
  "_id": {
    "$oid": "65b247f4d7793d69ff738edf"
  },
  "asin": "B08FXD2TZV",
  "title": "DOG CARE Dog Training Collar with Remote  Rechargeable Training Collar with Beep Vibration and Shock Training Modes Dog Collar for Large Medium Small Dogs Rainproof ECollar for Dogs",
  "link": "https://m.media-amazon.com/images/I/71HAgpUxLJL._AC_SY450_.jpg",
  "detail": "Intuitive design, portable and easy to use; Unlike those heavy DOG CARE dog training collars, this training collar for dogs is more portable, only half the size of a palm; This dog training shock collar is also designed for easy operation, with an intuitive design that fits beautifully in the palm of your hand; Fingertip-placed controls and thumb dial allow you to adjust the static level quickly; No matter you are a first-time pet parent or seasoned trainer, you will enjoy this intuitive design"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738ee4"
  },
  "asin": "B08LCW2TZD",
  "title": "niupipo Pickleball Paddles Pickleball Paddles Set of 2 Family Paddles Fiberglass Surface Polypropylene Honeycomb Core Cushion Grip Lightweight Pickleball Portable Carry Bag White",
  "link": "https://m.media-amazon.com/images/I/71WDQF47ruL._AC_SY355_.jpg",
  "detail": "Durable internal honeycomb core and fiberglass surface: The honeycomb core is a stable structure, which not only improves the strength of the pickleball paddles but also greatly reduces the weight of the pickleball set; The fiberglass surface can improve the elasticity of the pickleball set, and reduce the noise when hitting the pickleball at the same time; The combination of the honeycomb core and fiberglass surface greatly improves the control performance and the power of hitting"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738ee9"
  },
  "asin": "B08LCWT6D3",
  "title": "niupipo Pickleball Paddles Pickleball Set with Balls and 1 Carry Bag 7ply Basswood Wood Pickleball Paddles Pickleball Rackets with Ergonomic Cushion Grip Wooden Pickleball Paddle for Beginner",
  "link": "https://m.media-amazon.com/images/I/71NCLNEDxPL._AC_SY450_.jpg",
  "detail": "Ideal for Beginners; Needs some fun and also moderate exercise A Pickleball game is definitely what you are looking for. Pick the wooden pickle ball raquette set and have fun with your friends and families; Durable pickleball paddles, plenty of pickleball, and a convenient carry bag provide everything you need for your group. Niupipo 4 pickleball paddles set is also the ideal choice for schools, community centers, athletic clubs, and YMCAs"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738eee"
  },
  "asin": "B08P5V6GB9",
  "title": "Black Bathroom Faucet  WaterSong Bathroom Sink Faucet Waterfall Spout Faucet for Bathroom Sink Matte Black Single Hole Bathroom Faucet 360 Swivel Spout RV Modern Bathroom Faucet 100 LeadFree",
  "link": "https://m.media-amazon.com/images/I/71MR7haytML._AC_SY450_.jpg",
  "detail": "360° Rotatable Head & Single Handle - Users are allowed to swivel the head of the bathroom faucet to flush the corners and upperparts with this 360° rotatable head. Single handle design help users adjust to your preferred flow of water and the temperature easily."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738ef3"
  },
  "asin": "B08Q892M5J",
  "title": "Walkie Talkies for Adults  COTRE Two Way Radios Long Range USB Rechargeable Walkie Talkies w 2662 Channels NOAA amp Weather Alerts VOX Scan LED Lamp for Outdoor Activities Yellow",
  "link": "https://m.media-amazon.com/images/I/71yiqDeSt2L._AC_SX679_.jpg",
  "detail": "【Easy to Use】- User-friendly designs such as LED flashlight, earphone jack, USB charging port, IPX4 waterproof keypad and Easy Voice and Sound Activation Transmission (VOX) with 3 sensitivity levels for hands-free operation make COTRE walkie talkies an necessary tool for all sorts of outdoor recreations."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738ef8"
  },
  "asin": "B08QFPDTZP",
  "title": "Walkie Talkies for Adults  COTRE Rechargeable Walkie Talkies with 2662 Channels Up to 32 Miles Long Range Walkie Talkies NOAA amp Weather Alerts VOX amp Scan LED Lamplight Yellow4 Pack",
  "link": "https://m.media-amazon.com/images/I/71GZSLt6fVL._AC_SX466_.jpg",
  "detail": "【Easy to Use】- User-friendly designs such as LED flashlight, earphone jack, USB charging port, IPX4 waterproof keypad and Easy Voice and Sound Activation Transmission (VOX) with 3 sensitivity levels for hands-free operation make COTRE walkie talkies an necessary tool for all sorts of outdoor recreations."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738efd"
  },
  "asin": "B08R5PQXLF",
  "title": "SnapFresh Leaf Blower  20V Leaf Blower Cordless with Battery amp Charger Electric Leaf Blower for Lawn Care Battery Powered Leaf Blower Lightweight for LeafSnowDust Blowing Green",
  "link": "https://m.media-amazon.com/images/I/61ZaO5L2-5L._AC_SY355_.jpg",
  "detail": "Rechargeable Battery and Maintenance] The cordless leaf blower is powered by a20V/2.0Ah battery and is equipped with a charger. A full charge only takes 1 hours which supports 20-25 mins of efficient work."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f02"
  },
  "asin": "B08S3DG8PW",
  "title": "Walkie Talkie  COTRE Two Way Radio with 815 Hours of Battery Life Long Distance Walkie Talkies430470MHz High Communication Quality and Confidentiality with 1936 Channel Choices Fall Resistant",
  "link": "https://m.media-amazon.com/images/I/71tTCRJcykS._AC_SX522_.jpg",
  "detail": "Long-distance Communication —— Long distance walkie talkies can choose high/low power in each channel to meet the needs of different distance communication. It can provide high-quality communications up to 3.72 miles in urban areas. Due to environmental constraints, places with more obstacles will be shorter."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f0a"
  },
  "asin": "B08SSHS4TJ",
  "title": "EMEET Bluetooth Speakerphone M2 Max Professional Conference Speaker and 4 Directional Mics for up to 15 People Business Conference Calls High Volume Noise Reduction Daisy Chain Dongle Home Office",
  "link": "https://m.media-amazon.com/images/I/71xo6luLTDL._AC_SY450_.jpg",
  "detail": "2 Bluetooth Devices at Once & Personalization: This Bluetooth speakerphone could support users to connect 2 Bluetooth phones at once or 1 Bluetooth PC/mobile phone and 1 USB/dongle with M2 Max. Without being tired of switching, you could save you time and allow all attendees to enjoy immersive meetings. Meanwhile, eMeetLink offers users better personalization in renaming BT, setting standby time so that it wouldn’t turn off, update product firmware&software, turning on/off the DOA light, etc."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f0f"
  },
  "asin": "B08T21MBFT",
  "title": "Airdog X3 Air Purifier for Home Large Room up to 942ft2 Ionic Air Purifier with Washable Filter for Allergies Pets Smoke Dust Pollen Odors Remove 999 to 146nm Quiet Air Cleaner for Bedroom",
  "link": "https://m.media-amazon.com/images/I/51a+lUPGYPL._AC_SY450_.jpg",
  "detail": "[Patented TPA Technology: Active Filtration] With a subversive high-pressure ion air filter, our X3 air purifier terminates all harmful particles, rather than just collecting, by destroying their function. What's more, the TPA filter of the Airdog air purifier can filter 99.9% of particles down to 0.0146μm, while HEPA filters only handle particles above 0.3μm. Compared with the normal HEPA filter, our Airdog air purifier achieves real air purification and provides fresh air to the most."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f14"
  },
  "asin": "B08THCCV9P",
  "title": "EMEET Bluetooth Speakerphone Luna Lite Conference Speaker wEnhanced Noise Reduction Algorithm Daisy Chain USB Speakerphone for Home Office 360 Voice Pickup for 8 People wo Dongle",
  "link": "https://m.media-amazon.com/images/I/7198oxKqgRL._AC_SX522_.jpg",
  "detail": "[360°Microphones & Ultra-Clear Speaker] The EMEET Luna Lite conference ? speaker has multiple built-in AI microphones to pick up voice anywhere in your workspace. The Luna Lite Bluetooth speakerphone provides high-quality audio performance and makes your remote meetings more like having a face-to-face conversation. With the auto-vocal-increase function, the Luna Lite Bluetooth ? speaker can identify the sound distance and adjust the volume automatically, providing a smooth and clear call experience."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f19"
  },
  "asin": "B08TM3TRGL",
  "title": "Ice Maker Machine for Countertop SelfCleaning Function 26Lbs24H Portable Ice Maker 9 Ice Ready in 6 Mins Compact Ice Maker with Ice Scoop amp Basket for Home UsePartyCamping Black",
  "link": "https://m.media-amazon.com/images/I/71A-MJP2wwL._AC_SX522_.jpg",
  "detail": "Self-cleaning Function：Ice maker countertop with self-cleaning function, just press on/off button for 5s to start self-cleaning mode, which allows you not to spend time cleaning it basically. It would be better to add a small amount of lemonade and soda for cleaning."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f1e"
  },
  "asin": "B08TRF2H6N",
  "title": "Mini Drone with Camera  Drones for Kids Beginners RC Quadcopter with App FPV Video Voice Control Altitude Hold Headless Mode Trajectory Flight Foldable Kids Drone Boys Gifts Girls ToysBlue",
  "link": "https://m.media-amazon.com/images/I/71ASACudpfL._AC_SX425_.jpg",
  "detail": "HD Pictures & Live Videos & FPV Drone - The drone with camera can take photos and videos. Just connect your phone with drone to watch a live video. Enjoy the first-person view fun. The view will be shown directly on your phone, providing you with fantastic FPV experiences. The mini drones for kids will bring you more pleasure when staying at home to play with your kids. If you are looking fo rteen boy gifts, our drones for kids might be a nice teen boys/girls gift idea."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f23"
  },
  "asin": "B08TRFWJL1",
  "title": "Drone with Camera  FPV Drones for Kids RC Quadcopter Tiny Drone with App FPV Video Voice Control Altitude Hold Headless Mode Trajectory Flight Foldable Kids Drone Girls Gifts Boy Toys  Orange",
  "link": "https://m.media-amazon.com/images/I/712B85yVYDL._AC_SY450_.jpg",
  "detail": "HD Pictures & Live Videos & FPV Drone - ATTOP fpv drone with camera can take photos and video. Just connect your phone with ATTOP mini drone to watch a live video. Enjoy the first person's view of fun. The view will be shown directly on your phone, providing you with fantastic FPV experiences. ATTOP drones for kids will bring you more pleasure when staying at home playing with your child. If you are looking for a gifts for boys/girls 8-12, this camera drone is a teen girls/boys gift idea."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f28"
  },
  "asin": "B08V88FTSB",
  "title": "Large Lighted Makeup Mirror Makeup Mirror with 88 LED Lights and Magnification Lighted Vanity Mirror with Mini 10X Magnifying Mirror 3 Colors Lighting ModesTouch Dimmable Gift for Makeup Lovers",
  "link": "https://m.media-amazon.com/images/I/616bj2CM+KL._AC_SX569_.jpg",
  "detail": "88 Super-Bright LED Beads; SOKEA lighted makeup mirror dedicate to brings you a professional makeup experience; Built-in 88 LED light beads to bring the fashion show backstage to your vanity desk, supporting you to apply the best make up for work, for dates, for parties; SOKEA makeup mirror with lights and magnification simulating natural sunlight provides the most accurate reflection of your face; Farewell to the dim light and the dull face, let us light up your beauty"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f2e"
  },
  "asin": "B08VGQPQ3X",
  "title": "niupipo Pickleball Paddle USA Approved Pro Pickleball Paddle with FiberglassGraphite Face Polypropylene Honeycomb Core Cushion Comfort Grip MidWeight Pickleball Paddle for Outdoor amp Indoor Play",
  "link": "https://m.media-amazon.com/images/I/71IfFYGL5JS._AC_SX522_.jpg",
  "detail": "Pickleball Paddle Comes With a Protective Cover - All of our pickleball paddles will come with a zippered cover; The cover will help maintain the coloring and core when not in use; Every USA Pro pickleball paddle is designed to be an awesome pickleball paddle for advanced players; All models of our pickleball paddles have passed the strict USA test; Choosing niupipo is not only to choose the optimal pickle ball raquette but you are also entitled to enjoy our premium services"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f33"
  },
  "asin": "B08WWSQ4GN",
  "title": "DOKER Steam Mop Electric Steamer Mop w 3 Auto Modes 2 Washable Pads 12 Oz Removable Water Tank 164 ft Cable Lightweight Steamer for Hardwood floors Carpet Tile Laminate Cleaning Green",
  "link": "https://m.media-amazon.com/images/I/6191cqtfQoS._AC_SY450_.jpg",
  "detail": "[3 Steam Modes for All kinds of Floors] The electric mops for hardwood and tile have 3 modes of steam to meet your cleaning needs. Low (for delicate floors), medium (for regular cleaning), and high (for durable floors or sticky messes). You don’t need to hold the handle at all times, the steam will automatically be released after pre-heating for 20s. It is safe to use the DOKER mop steamer on all kinds of sealed floors such as hardwood, tile, marble, carpet, laminate, vinyl, linoleum, etc."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f38"
  },
  "asin": "B08WXBJTCM",
  "title": "DOKER Steam Mop Cleaner  Handheld Detachable Floor Steamer for Hardwood Floor Cleaning w 11 Accessories 2 Mop Pads Multifunctional for Home Use Tile Carpet Kitchen Window Wall Laminate",
  "link": "https://m.media-amazon.com/images/I/61cTNNl6mhL._AC_SY606_.jpg",
  "detail": "【90° Flexible Handle & 300° Swivel Head】With steam mop for hardwood floors, you no longer have to bend down to mop hard-to-reach areas because of the adjustable handle that up and down 90°. With a flexible mop head, the steam cleaner for tile easily reaches hard-to-reach areas like bed, sofa, carpet with a slight push. Its 300° ?Doker steam mop head flexibly rotates to clean all the corners and various floors with grout just like a breeze. Own it to enjoy the doker floor steamer for home use."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f3d"
  },
  "asin": "B08X16HMZ8",
  "title": "Air Filter  Airdog X3 Generating Electrode  Ionization Wire Frame for Airdog X3 Air Purifier  Replacement Filter",
  "link": "https://m.media-amazon.com/images/I/51LBouCd4JL._AC_SY355_.jpg",
  "detail": "This Ionization Wire Frame comes with the purchase of the X3 Air Purifier."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f41"
  },
  "asin": "B08X17VMZC",
  "title": "Air Filter  Airdog X3 Composite Catalyst Filter for the Airdog X3 Air Purifier  Replacement Filter",
  "link": "https://m.media-amazon.com/images/I/51Sl9U2UmgL._AC_SX342_.jpg",
  "detail": "This Composite Catalyst Filter are part of the X3 Air Purifier's multi-stage filtration method."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f46"
  },
  "asin": "B08X1G77GY",
  "title": "Air Filter  Airdog X3 Air Purifier PreFilter",
  "link": "https://m.media-amazon.com/images/I/815YtfmP20L._AC_SX679_.jpg",
  "detail": "Captures larger particles like hair, dander, etc."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f49"
  },
  "asin": "B08ZC9MW1F",
  "title": "Drones with Camera for AdultsKidsBeginners  1080P HD Drones for Adults 120 WideAngle Kids Drone Safe Design amp Easy to Control with RemoteAPPVoice 18 Mins Flight Time Ideal GirlsBoys Gift",
  "link": "https://m.media-amazon.com/images/I/71GocwAKcRL._AC_SY355_.jpg",
  "detail": "[1080P FPV Drone] 1080P HD Wide-Angle: With the 1080P HD drone camera, Attop drones with camera for adults can show you the real world with wonderful FPV (first-person view) experiences and capture the precious moments of life for you without distortion. For this drone for beginners, the 1080P HD camera is more than adequate for taking pictures. It has better picture quality than 720P and is more cost-effective than a 2K/4K camera."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f4e"
  },
  "asin": "B08ZH82NMJ",
  "title": "2022 Sonic Facial Cleansing Brush Upgrading with 5 Vibration Speeds IPX7 Waterproof and Soft Silicone Designed to Deeply Cleanse and Exfoliate for Woman amp Men inFace MS2000 Pro Violet",
  "link": "https://m.media-amazon.com/images/I/71NN5rVtw1L._SY450_.jpg",
  "detail": "5 speed setting modes: The brushes of the inFace sonic facial device divided into three different thicknesses areas. Can be cleaned to the nose and eye sockets and other uneven parts, to achieve 360 ° no dead ends. There are 5 speed setting modes for you to choose. Deep clean pores, remove acne, exfoliation and remove facial oil, reduce blackheads."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f53"
  },
  "asin": "B0915K8HTW",
  "title": "Stud Finder Sensor Wall Scanner VIVREAL 4 in 1 Wall Detector with LCD Display and Sound Warning Beam Stud Finder Center Finding and Auto Calibration for Wood AC Wire Metal Studs Detection",
  "link": "https://m.media-amazon.com/images/I/61BX8DLBeNL._AC_SY355_.jpg",
  "detail": "Auto Calibration; The TH240 wall scanner beam finder can be calibrated automatically for more accurate detection; Please take note that the calibration needs to be done every time before the detection. Just choose the mode and press the scan button, then hold the stud finder on the wall to complete the calibration"
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f58"
  },
  "asin": "B09339NVB3",
  "title": "3Axis Gimbal Stabilizer for Smartphone  Handheld Foldable Phone Gimbal wRemote Control Phone Stabilizer for Video Recording Vlog for iPhone 14 Pro Max1312XXSSamsung S22  hohem iSteady X2",
  "link": "https://m.media-amazon.com/images/I/61gH6STGpYL._AC_SX466_.jpg",
  "detail": "【Remote Control & Gesture Control】Through the customized full-featured remote control, you can adjust the shooting angle, start recording, make landscape/portrait switching, and control many other functions of this video stabilizer. The effective remote control distance of this phone stabilizer can reach 33 feet. In addition, you can also perform gesture control to start a shoot. In this way, iSteady X2 can easily be used to take group photos or record dance videos."
},
{
  "_id": {
    "$oid": "65b247f5d7793d69ff738f5d"
  },
  "asin": "B0933BGKHG",
  "title": "hohem iSteady X2 Gimbal Stabilizer for Smartphone 3Axis Phone Gimbal with Remote Control Foldable and Portable Stabilizer for iPhone amp Android Phone Stabilizer for Video Recording YouTube TikTok",
  "link": "https://m.media-amazon.com/images/I/71sYJl33stL._AC_SY741_.jpg",
  "detail": "[Anti-shake 3-Axis Stabilization] The hohem 3-axis gimbal stabilizer iSteady X2 is an exceptional device that provides unmatched balance and stability. Its 3-axis stabilization ensures crisp, clear footage with no distortion or wobbling. The 3-axis gimbal stabilizer is suitable for various scenes such as Vlogs, YouTube, live streaming, selfie, hiking, sports, etc., perfectly realizing high-quality video."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f62"
  },
  "asin": "B0936B7HQ4",
  "title": "hohem iSteady V2 Gimbal Stabilizer for Smartphone 3Axis Phone Gimbal wIndependent AI Tracking Sensor amp Fill Light Foldable Gimbal Vlogging Stabilizer for iPhone Android YouTube TikTok Live Video",
  "link": "https://m.media-amazon.com/images/I/71Ru4xZHlYL._AC_SY355_.jpg",
  "detail": "[AI Active Tracking & Gesture Control] With the patented AI technology, the built-in sensor of the iSteady V2 gimbal stabilizer allows AI to actively track without App limitations, allowing face tracking in live broadcasts or online meetings such as Tiktok, Youtube, Facebook, Teams, Instagram, Zoom, etc., ensuring that the subject is always in the frame. This phone gimbal features smart gesture controls that let you start or pause tracking and switch between landscape and portrait orientation."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f67"
  },
  "asin": "B093PX2FXB",
  "title": "Ice Makers Countertop 40Lbs24H 24pcs Ice Cubes in 13 Mins Portable Ice Maker wSelfCleaning Countertop Ice Maker wIce Scoop amp Basket Cube Ice Machine for HomeKitchenOfficeBarParty",
  "link": "https://m.media-amazon.com/images/I/71ow7ZVTtcS._SX425_.jpg",
  "detail": "USER-FRIENDLY - Free standing design stainless steel ice maker machine allows versatile placement. It is idea for you home, office, kitchen, bar or coffee shop. The removable ice basket stores up to 2.2 lbs of ice at a time, ensuring that you have ice ready whenever you need it, and it comes with an ice scoop to facilitate ice removal. It’s easy to clean, use, control, and transport. For best results, keep self cleaning ice makers countertop upright for at least 24 hours before first using it."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f6c"
  },
  "asin": "B0946P72TZ",
  "title": "Black Waterfall Spout Bathroom Faucet WaterSong 2Handle Bathroom Sink Faucet with Pop Up Drain amp Supply Lines RV Lavatory Vessel Faucet 4 Inch Centerset Waterfall Bathroom Faucet for 2 Hole",
  "link": "https://m.media-amazon.com/images/I/61X8qJy-h6L._AC_SX569_.jpg",
  "detail": "360° Rotatable Faucet Head ? & 2 Handles Dual Control- With 360 degree rotating head design, you can swivel the head of the bathroom faucet to control the direction of waterflow, this especially makes it easier for your children to reach for washing hands or brushing teeth. Dual handles for effortless flow and easily temperature control."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f71"
  },
  "asin": "B0946QYGL6",
  "title": "Black Bathroom Faucet 4 Inch 2 Handle  WaterSong Waterfall Bathroom Sink Faucet with Popup Drain amp cUPC LeadFree Water Supply Hose Centerset 360 Swivel Spout Bathroom Faucet RV Farmhouse Modern",
  "link": "https://m.media-amazon.com/images/I/71u+8HRgurL._AC_SY450_.jpg",
  "detail": "100% Lead-free Material - Your health is always our priority. WaterSong bathroom faucet offers a quality bathroom faucet that is certified to cUPC, NSF-61, 100% lead-Free. Overall Height: 6.07'', Spout Reach: 5.7'', Flow rate: 1.2 GPM Max@60psi. [Note: pop-up drain is included without lift rod needed]."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f76"
  },
  "asin": "B094NMNTVC",
  "title": "Webcam Tripod EMEET Professional Webcam Mini Tripod Portable amp Lightweight Adjustable Height from 57122 in Stable Use Universal Compatible for Most WebcamsPhonesGoProsMirrorless Cameras",
  "link": "https://m.media-amazon.com/images/I/51iQ2ikpIvS._AC_SY355_.jpg",
  "detail": "Lightweight and Portable: This EMEET pocket tripod weighs only 76.5 g (2.7 oz), a normal egg is 50 g (1.8 oz), and its minimum size: 1 in (W)*6.2 in (H). ? You even can put this compact tripod stand into your pocket or handbag and carry it to wherever you go."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f7b"
  },
  "asin": "B0957PSMBJ",
  "title": "Keyless Entry Door Lock  Smart Deadbolt Lock with Bluetooth App Electronic Keypad IC Card Spare Keys Security Waterproof Smart Lock Easy Install USB Ideal for Home Use Apartment Office Hotel",
  "link": "https://m.media-amazon.com/images/I/61q3D4rgGDL._AC_SY450_.jpg",
  "detail": "【Bluetooth + APP Keyless Control】The Keyless Entry Door Lock is not internet required, control your Electronic Keypad Deadbolt via Bluetooth to unlock quickly, stably, and safely. With TT Lock APP you can generate timed, permanent, one-time, or custom passwords for guests, friends, and tenants, granting them access to specific dates; You can also check the records about unlocking in real-time via APP. Creating a secure, smart life for you."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f80"
  },
  "asin": "B095JZNV9C",
  "title": "COOLPO USB30 Cable for Video Conference Camera  164ft5m Cable Designed for use Conference Camera with Microphone USB 30 A to Micro B Cable for Conference webcams",
  "link": "https://m.media-amazon.com/images/I/61lP952khUS._SX385_.jpg",
  "detail": "The length of this USB 3.0 for webcams for conferences is 16.4ft / 5m"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f83"
  },
  "asin": "B0967W66PB",
  "title": "DigitalampAnalog Walkie Talkie  Two Way Radio Long Range Business Walkie Talkies for Adults Rechargeable Hands Free 2 Way Radios Up to 30h Standby Time Automatic Backlight LED Screen",
  "link": "https://m.media-amazon.com/images/I/71WgXIgvrxL._AC_SX466_.jpg",
  "detail": "Complete Accessories - Buying a digital walky-talky, you can get a charging base, a charger, a detachable belt clip, and a lithium battery. The exquisite design of the walkie-talkie enables it to have two charging methods. You can charge it through the charging base or directly use the data cable."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f89"
  },
  "asin": "B096ZTDNLW",
  "title": "Shower HeadWaterSong 7 SettingsBuild in Power Wash Handheld Spray with 65ft Stainless Steel HoseAdjustable Mount for Luxury Bath Massage Spa One Button Switch to Ejction Mode Matte Black",
  "link": "https://m.media-amazon.com/images/I/71dKiSBGaWL._AC_SX425_.jpg",
  "detail": "????????????-???? ?????????? ???????? - WaterSong handheld Spray also has a built-in ejection mode. Just press the button, the water will flush out, getting rid of the dirt or stubborn substance. A good helper for cleaning toilets, mop, bathtub, corners. Also ideal for pet shower to rinse out shampoo in seconds."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f8e"
  },
  "asin": "B0983P71CV",
  "title": "Liene 4x6 Photo Printer Paper amp Cartridge Cartridge Refill amp Photo Paper 40 Pack for DHP512DHP513",
  "link": "https://m.media-amazon.com/images/I/71cLbDdZDLL._AC_SX466_.jpg",
  "detail": "High-quality photographic results; With the application of thermal dye-sublimation technology, the dye penetrates the photo paper more deeply and won’t be easily damaged with wear. Besides, the color on the photo looks vivid and vibrant due to the perfect dye penetration. As what you saved on the phone, the original image will persist as long as your digital photos"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f93"
  },
  "asin": "B098F71RKY",
  "title": "Space Heater for Indoor Use Large Room  Air Choice 1500W Room Heater with 3S Quick HeatingSafe Infrared Heater with 3 ModesSuper Quiet Portable Heater Garage Electric Outdoor Heaters for Patio",
  "link": "https://m.media-amazon.com/images/I/31On6E8m31L._AC_SX425_.jpg",
  "detail": "Remote Control & 24H Timing - The PD15R garage heater is equipped with a compact and easy-to-use remote control. You can easily select different heating modes without leaving the warm bed or soft sofa. And equipped with a 24-hour timer, you can set automatic turn-off before going to bed, and enjoy a comfortable and quiet environment all night. It is very suitable for people with insomnia or light sleep."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f98"
  },
  "asin": "B098T5V53D",
  "title": "Space Heater for Office  Electric Ceramic Personal Small Portable Desk Tower Heater Fan W 120 Oscillating Thermostat Fast Heating Overheat amp Tipover Protection Ideal for Room Home Indoor Use",
  "link": "https://m.media-amazon.com/images/I/815giSrUdPL._AC_SY450_.jpg",
  "detail": "【Instant & Cozy Warmth】Always get frozen when returning from snowy outdoor This ceramic space heater for living room is your superior choice in winter. W/ 2021 PTC fast-heating element & 750W/1500W heating modes, portable space heater can bring instant strong warm air and dispel chill instantly. Also, adjustable thermostats can help your room keep achieve a stable temperature rather than overheating. Take this personal heater for winter to escape from the chill and enjoy a toasty winter."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738f9d"
  },
  "asin": "B098TMSQK6",
  "title": "Wall Mount Heater Air Choice Electric Wall Heater with Overheating Auto Cutoff 120V 400W Power 250 Sq Ft Coverage Save Heating Bill and Space Crack Resistant",
  "link": "https://m.media-amazon.com/images/I/512pwb64kqL._AC_SX466_.jpg",
  "detail": "Fast and Quiet Heating; Up to 400W power of the heater panel heating in a quiet and fast way, makes you feel warm quickly; Produces radiant heat from the surface of the wall panel heater and heated air will be raised, creating convection heated air current for the whole room; The entire process is quiet and constant, you won't get in trouble of getting dry because of the circulation of air"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fa2"
  },
  "asin": "B098TNWQTP",
  "title": "TRUSTECH Wall Mount Heater Heater with No Fan 400W Convection Heater Indoor Electric Space Heater with Overheating Safety Protection Easy Installation Heater on Wall",
  "link": "https://m.media-amazon.com/images/I/61QhUynPMGL._AC_SX679_.jpg",
  "detail": "Free Decoration Without Odor; Our wall mount heater is made up of high-quality gypsum materials, no odor, and no VOC emit during the heat transfer process; The pure white color heater panel allows you to do graffiti freely according to your personal preference, and better decorate your room"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fa7"
  },
  "asin": "B098WMYB35",
  "title": "USB Volume Control Knob  EMEET USB Multimedia Controller Knob with OneClick Mute Function and Music Switching Customize Mute Button Mode Multimedia Control Knob Supports Windows and Mac",
  "link": "https://m.media-amazon.com/images/I/51b6QL1k0VL._AC_SX679_.jpg",
  "detail": "【Visibility of Lights & Custom Button Mode】Good visualization. When using the eMeet media controller, you don't need to worry about whether the microphone is muted. The mute icon on the screen and the red light of the product can avoid the embarrassment of forgetting to turn off the microphone. By downloading eMeetLink, the usb volume knob can customize the key mode design, change the way of using the controller, and bring a better user experience."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fac"
  },
  "asin": "B099J9JCYB",
  "title": "Space Heater  Fastheating Ceramic HeaterTower Heater Fan with Thermostat Tipover Overheat Protection 120 Oscillation Ideal for Home Bedroom Office Large Room Bathroom Under Desk Indoor Use",
  "link": "https://m.media-amazon.com/images/I/71N4fbzA5yL._AC_SX569_.jpg",
  "detail": "【3 working modes & 120° Oscillation】 Airchoice portable space heater has 3 working modes, including 1500W high heat and 750W low heat plus a fan mode. The electric heater with 3 modes can satisfy your different needs, the 1500w high heat mode can warm up your room instantly within 3 seconds. With the 120° widespread oscillation, this fast-heating ceramic heater for the home can distributes warm air throughout your room and help you get rid of the cold instantly."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fb1"
  },
  "asin": "B09B7LY3LQ",
  "title": "Lepow Portable Monitor  2023 C2 156 inch FHD 1080P Portable Display with IPS Screen Foldable Kickstand Dual Speakers TypeC HDMI Mini DP Port for Laptop PC Phone Xbox Switch PS5 Iron Gray",
  "link": "https://m.media-amazon.com/images/I/713mRXgD3iL._AC_SY450_.jpg",
  "detail": "【1080P FHD IPS High Definition Screen】Lepow C2 portable monitor adopts an FHD 1920×1080 IPS screen, allowing you to enjoy vivid and saturated colors from 0°-178° viewing angle. Even with a long-time experience, the computer monitor ensures no ghosting, stuttering, or tearing, which effectively protects your eyes."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fb6"
  },
  "asin": "B09B7N2BH1",
  "title": "ADIMO Safe Accessories Great for All Adimo Cabinte Safes",
  "link": "https://m.media-amazon.com/images/I/41qHID2JnkL._AC_SX466_.jpg",
  "detail": "Safe Accessories for ADIMO safes: 4 Expansion screws, 4 Floor mats, 1 Emergencyy battery box"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fbb"
  },
  "asin": "B09C8XRTGF",
  "title": "DOG CARE Dog Training Collar  Rechargeable Shock Collar with Remote Beep Vibration and Shock Modes Rainproof Training Collar Long Remote Range Adjustable Shock Levels for Small Medium Large Dog",
  "link": "https://m.media-amazon.com/images/I/71U3nghZRAL._AC_SY450_.jpg",
  "detail": "No More Accidental Shock; Have you ever felt sorry for the accidental shock to your dog caused by your misoperation, Now with the dog care dog training collar shock, no more accidental shock would happen to your dog, shock collar for large dog; The security keypad lock prevents any misoperation on the remote, dog training collar with remote; Easy to carry the dog care shock collar without worrying about the accidental shock, dog training collar for small medium large dogs"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fc0"
  },
  "asin": "B09CYMXXPQ",
  "title": "Rintuf 34 Electric Fireplace InsertElectric Fireplace Heater with Touch Screen amp RemoteOverheating Protection with TimerCustomed Display5 Flame Speed amp 5 Color amp 5 Brightness7501500W Black",
  "link": "https://m.media-amazon.com/images/I/71veYoHYInL._AC_SX569_.jpg",
  "detail": "????【TOUCH SCREEN CONTROL PANEL】Touch Screen LCD Panel & remote control (Keep the distance to the fireplace within 11.5 feet) help you control the heater more conveniently."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fc7"
  },
  "asin": "B09D7KQGTG",
  "title": "Drone with Camera for Adults ATTOP 1080P Live Video 120 Wide Angle APPControlled Camera Drone for Kids 812 Beginner Friendly with 1 Key FlyLandReturn RemoteVoiceGestureGravity Control FPV Drone w Safe Emergency Stop 360 Flip VR Mode Carrying Case 2 Batteries GirlsBoys Gifts",
  "link": "https://m.media-amazon.com/images/I/71uqf2ayo+L._AC_SY450_.jpg",
  "detail": "[More Fun to Fly] Multiple functions waiting for your exploration. Draw a route on the app to let skyline drone fly along, speak to control the flying direction, or show \"V\" gesture to let the drone for kids 8-12 automatically recognize and take pictures. And can experience a 360° flip during the flight. A built-in G-sensor of ATTOP 1080p fpv drones for adults are compatible with VR glasses, which let the professional drones with camera swing with your phone/iPad and enjoy a breathtaking 3D experience."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fcc"
  },
  "asin": "B09DFFHVWP",
  "title": "Selfie Stick Gimbal Stabilizer 2 Axis Face Tracking amp 360 Rotation Tripod with Wireless Remote 4 in 1 Portable Tripod wExtendable Stick for iPhone 14Android Video Recording hohem iSteady Q",
  "link": "https://m.media-amazon.com/images/I/714TIB26iaL._AC_SY355_.jpg",
  "detail": "[4 in 1 Selfie Stick Stabilizer] This 4 in 1 expandable portable phone selfie stick has 4 different forms, gimbal stabilizer, expandable stick, tripod stands and desk gimbal with 360° follow mode. You can conveniently regulate various shooting scenarios and meet various angle requirements. Thetwo-axis anti-shake design allows you to take more stable videos than your phone even when you are in motion. This portable selfie stick gimbal isalso suitable for taking selfies, recording video, outdoor activities. Please note that when in full charge the battery capacity is 460mAh and the standbytime is 3 hours"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fd2"
  },
  "asin": "B09DFTHJTH",
  "title": "Gimbal Stabilizer for Smartphone 2 Axis Selfie Stick Tripod with Face Tracking 360 Rotation 4 in 1 Portable Phone Tripod wExtendable Stick for iPhone 14Android Video Recording hohem iSteady Q",
  "link": "https://m.media-amazon.com/images/I/71vvIQk6MDL._AC_SY741_.jpg",
  "detail": "[4 in 1 Selfie Stick Stabilizer] This 4 in 1 expandable portable phone selfie stick has 4 different forms, gimbal stabilizer, expandable stick, tripod stands and desk gimbal with 360° follow mode. You can conveniently regulate various shooting scenarios and meet various angle requirements. Thetwo-axis anti-shake design allows you to take more stable videos than your phone even when you are in motion. This portable selfie stick gimbal isalso suitable for taking selfies, recording video, outdoor activities. Please note that when in full charge the battery capacity is 460mAh and the standbytime is 3 hours"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fd8"
  },
  "asin": "B09DGL37RJ",
  "title": "SnapFresh 20V MAX Leaf Blower  420 CFM Cordless Leaf Blower with 40Ah Battery amp Charger Electric Leaf Blowers for Lawn Care Battery Powered Leaf Blower for Snow Blowing",
  "link": "https://m.media-amazon.com/images/I/614g7u-fqTL._AC_SX466_.jpg",
  "detail": "[Ergonomic Design] The updated version of the SnapFresh leaf blower only weighs 4.4pounds making it lightweight yet providing efficient cleaning. It is perfect for all people above the age of 8 years old."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fdd"
  },
  "asin": "B09DYMWWSS",
  "title": "DOG CARE Anti Barking Device  Rechargeable Barking Control Devices Ultrasonic Dog Training 30FT Range Dog Training Tools for Behavior Aids 6 Months Standby LED Indicator Outdoor Indoor",
  "link": "https://m.media-amazon.com/images/I/61AHp4EPuEL._AC_SX679_.jpg",
  "detail": "[Easy to Use, Easy for Dogs to Learn] - DOG CARE dog barking deterrent device is designed for people without dog training skills. One-button simple structure ensures its ease of operation. With the user-friendly vibrating feedback, feel the slightly vibrate when it’s functioning instead curious whether that working. Press the button to emit high-pitched sounds to stop dog's barking or unwanted behaviors. Pooch will learn easily that naughty brings on the noise and correction makes noise go away"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fe2"
  },
  "asin": "B09F9NVHSZ",
  "title": "DOG CARE Dog Shock Collar with Remote  Dog Training Collar with Beep Vibration Shock Modes Rechargeable Collars with Remote for Large Medium Dogs15100lb Long Remote Range",
  "link": "https://m.media-amazon.com/images/I/61Ht+kN3dQL._AC_SX522_.jpg",
  "detail": "1 to 99 Shock Level Adjustable for Different Sized Dogs; 99 training levels of the rechargeable dog shock collar allows you to adjust the stimulation to a level that is the most suitable to communicate to your dog, no matter the size and breed of your dog, you can find the right training level for them"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fe7"
  },
  "asin": "B09H6RGZCL",
  "title": "Lepow Portable Monitor C2S 154 Portable Laptop Monitor 1080P IPS Screen with Dual Speakers Foldable Kickstand HDMI USB TypeC Mini DP External Travel Monitor for Laptop PC Phone Xbox Switch PS4",
  "link": "https://m.media-amazon.com/images/I/81BrO-BixaL._AC_SX466_.jpg",
  "detail": "【Optional Display Modes】Advanced HDR technology makes the highlights brighter and the lowlights darker, which offers the possibility to display higher definition and vivid pictures. The 1080P portable monitor also supports duplicate mode and extended mode as a second screen."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738fec"
  },
  "asin": "B09K74LH7H",
  "title": "3 Axis Gimbal Stabilizer Handheld Tripod Mount for Video Recording Bluetooth Control Compatible with YI Cam Insta 360 Sony RX0 Gopro Hero 111098765 Osmo Cameras hohem iSteady Pro4",
  "link": "https://m.media-amazon.com/images/I/81SX6Tpy4UL._AC_SY450_.jpg",
  "detail": "【3 axis gimbal stabilizer & 5.0 Anti-shake System】The upgraded 3-axis action camera gimbal stabilizer compatible with GoPro ? 11/10/9/8/7/6/5 is equipped with a 5.0 iSteady anti-shake system, providing hyper-smooth footage for shooting Vlog and daily recording. This handheld gimbal for GoPro also features a newly developed 600° Inception mode, that would be able to rotate your phone 360° spontaneously when filming, giving you the master-like video-making experience."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738ff1"
  },
  "asin": "B09KH7HX9F",
  "title": "EMEET 1080P Webcam with Microphone  60FPS Streaming Camera with Light Three Level Light NoiseCancelling Mics C970L Computer Camera with Privacy Mode Autofocus HD Webcam for MeetingGamingClass",
  "link": "https://m.media-amazon.com/images/I/51Yiz3MB8-L._AC_SY450_.jpg",
  "detail": "[3 Level Adjustable Webcam Light] The 1080P webcam with light has a three-level light adjustment function, and the light can be switched by gently touching the top of the web cam. When you use C970L computer camera in video conference, webcast，beauty makeup live and other scenes, you can fill in the light immediately to maintain a clear video state. The light of the camera is softer than that of other built-in cameras, without dazzling feeling, bringing the ultimate experience."
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738ff6"
  },
  "asin": "B09KMVW2VJ",
  "title": "DOG CARE Dog Bark Collar  Barking Shock Collar for Dogs with 5 Adjustable Sensitivity Levels LED Indicator Dog Bark Collar with VibrationampShock Modes Auto 7 Levels Shock Modes No Remote",
  "link": "https://m.media-amazon.com/images/I/71j9plw+9YL._AC_SX679_.jpg",
  "detail": "2 Training Modes - Always troubled by inappropriate barking This barking shock collar for dogs with 5 adjustable sensitivity levels can help your dog develop better behaviors; The DOG CARE bark collar with 7 gradual cycle bark control helps your dog correct uncontrolled barking behavior and this bark collar strengthens the bond between you and your dogs"
},
{
  "_id": {
    "$oid": "65b247f6d7793d69ff738ffb"
  },
  "asin": "B09KN41PZX",
  "title": "VOSOV Dog Nail Grinder  Professional Dog Nail Trimmers with 4 Grinding Ports 40db Low Noise Dog Nail Clipper with Protective Cap Nail Grinder for Puppy Cordless Claw Grooming for Small Medium Dog",
  "link": "https://m.media-amazon.com/images/I/51cq0VatVZL._AC_SX425_.jpg",
  "detail": "Comfortable Lower Noise: VOSOV nail grinder for pets works in ultra-quiet low noise, less than 40db. This pet nail clipper reduces the excessive sound and keeps pets calm when working, which helps grind pet claws fast, easily, and safely."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739000"
  },
  "asin": "B09MJ642ZY",
  "title": "EMEET 1080P Webcam with Microphone  96 Ultra Wide Angle Webcam Auto Focus Webcam with Privacy Computer Camera Cover C965 PC Camera for Online MeetingClassesStreamingZoomSkypeYouTube",
  "link": "https://m.media-amazon.com/images/I/61Z2QkMqlIL._AC_SX679_.jpg",
  "detail": "Autofocus Streaming Webcam with Privacy Cover - With the EMEET C965 USB webcam, the autofocus function can capture every moment you move without worrying about losing focus, giving you a better video experience. The computer camera will be equipped with an independent privacy cover. By blocking the lens, there will be no privacy disclosure when you stop using the camera. At the same time, the lens has been protected, and the service life of the lens is longer."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739005"
  },
  "asin": "B09MS55YY1",
  "title": "RM RICOMAX Metal Detector for Adult Higher Accuracy 10 DD Search Coil Gold Detector with LCD Backlight 4 Modes IP68 Waterproof Professional Metal Detector for Gold Silver Coin Treasure Hunting",
  "link": "https://m.media-amazon.com/images/I/71bhANZDqnL._AC_SY450_.jpg",
  "detail": "[4 Modes-More Fun to Explore] RM RICOMAX Professional Metal Detector has 4 detection modes (All Metal / Disc / Notch / PP) that allow you to efficiently search for the metal you need. This metal detector will be an all-season tool. In spring and summer, you can take it with you to detect gold coins in the fields and on the beach. In winter you can also use it to detect treasures under the snow in yards and parks. There are many more hidden ways to play, so come and explore!"
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73900a"
  },
  "asin": "B09MTB3788",
  "title": "CAT CARE Cat Water Fountain84oz25L Ultra Quiet Pet Water Fountain Automatic Dog Water Bowl Dispenser with UltraFiltration Tech Removes 9999 of Impurities Human Grade Drinking Fountain",
  "link": "https://m.media-amazon.com/images/I/71nTIt7V4WL._AC_SY450_.jpg",
  "detail": "[User Friendly] The waterfall-and-pool design unlocks pets primal instinct and enticesthem to drink more. Assemble the fountain in seconds and you are ready to go. Thewater fountain has 85 oz capacity with minimal maintenance and super easy to clean."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73900f"
  },
  "asin": "B09MYN62TG",
  "title": "Clamp Multimeter Tester  6000 Counts FKM True RMS Voltmeter for AC Current ACDC Voltage Tester with Lighting System Autoranging AMP Frequency Resistance NCV Digital Clamp Meter",
  "link": "https://m.media-amazon.com/images/I/71mgxgO56pL._SX522_.jpg",
  "detail": "[Multi-function] Backlit LCD screen and clamp head lighting with one hand operation trigger, it’s easy to use even if the ambient light is too dark. It also has overload protection, low battery indicator, auto power-off after 15 minutes of inactivity, auto-ranging, data holding, MAX/MIN measurement function, relative measurement, and buzzer alarm, etc."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739015"
  },
  "asin": "B09N364V92",
  "title": "ADIMO Safe Box Fireproof Waterproof 12 Cubic Fireproof Home Safe for Money with Intelligent Alarm System Digital Keypad and Dual Key System Security Safe Box for Money Jewelry Pistol Documents",
  "link": "https://m.media-amazon.com/images/I/81UwpLswVSL._AC_SX425_.jpg",
  "detail": "Easy Organization with 5 Hooks -There are 5 hooks behind the safe door, you can hang the spare keys of the house and the car (do not lock the key of the safe in the safe), jewelry and other valuables on the hook. Hooks can help you organize your items and reduce the time you spend looking for items."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73901a"
  },
  "asin": "B09N77BLJN",
  "title": "DOG CARE Dog Nail Grinder  Upgraded Pet Nail Trimmer with Smart Mode 2Speed Rechargeable Dog Nail Grinder with LED Light UltraQuiet Nail Trimmer3 Ports for Small Medium and Large DogsRed",
  "link": "https://m.media-amazon.com/images/I/51CgxX+FXHL._AC_SY450_.jpg",
  "detail": "Upgraded Auxiliary LED - to ensure your dog's nails are properly trimmed, this smart pet nail grinder is equipped with a LED Light, which helps us see the quickness of the dog's nails clearly and avoid over-grinding your furry baby. You can press the SMART button twice to power on/off the auxiliary LED light."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73901f"
  },
  "asin": "B09P3Q1JFM",
  "title": "EMEET Meeting Capsule 4K Captured 1080P Output 360Video Conference Camera 8 Mics 5 Video Modes AI VoiceFaceFigure Tracked Conference Room Webcam wRemote Control for 10 People Medium Meeting",
  "link": "https://m.media-amazon.com/images/I/71nAJEf5WvL._AC_SX679_.jpg",
  "detail": "[8 AI Mics Array & 360°Voice Pick Up] The video conference camera features EMEET's exclusive VoiceIA tech which enables achieve noise reduction, echo cancellation, human voice strengthening, and full duplex. Meanwhile, voice can be clearly delivered within a sphere of an 18ft radius. All attendees can be clearly heard even from the far ends of tables with the webcam for the conference room. The EMEET Meeting Capsule really provides a smooth and clear auditory carnival for zoom room."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739024"
  },
  "asin": "B09PBJB4D5",
  "title": "AM ARROWMAX Electric Screwdriver Precision Screwdriver w 34 Magnetic Bits 4 Torque Settings Red Dot IF Winning Design Rechargeable Mini Cordless Screwdriver for Phone Laptop Camera Gray",
  "link": "https://m.media-amazon.com/images/I/51Y7pTIETZL._AC_SX466_PIbundle-34,TopRight,0,0_SH20_.jpg",
  "detail": "[Superior Convenience & Comfort] Our electric screwdriver set is designed with your convenience and comfort in mind. With its innovative cubic design, our electric screwdriver set offers comfortable grip and control during rotation unlike traditional cylindrical models. With the built-in OLED screen, you can effortlessly access crucial information while you work. Plus, our electric screwdriver set can illuminate your workspace with the built-in shadowless LED light, ensuring clear visibility."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739029"
  },
  "asin": "B09PBJJNH1",
  "title": "AM ARROWMAX Electric Screwdriver Precision Screwdriver Set w 28 Magnetic Bits Red Dot IF Winning Design Rechargeable Mini Cordless Screwdriver for Phone Laptop Watch RC Space Grey SES MINI",
  "link": "https://m.media-amazon.com/images/I/71a-8QSDvHL._AC_SX425_PIbundle-28,TopRight,0,0_SH20_.jpg",
  "detail": "[Enhanced Convenience & Comfort] Unlike other cylindrical designs, our electric screwdriver set is designed in an ergonomic cube shape, which provides a comfortable grip and enhanced control during the rotation. The status indicator of the electric screwdriver can make you aware of the working status of tightening or loosening. You can use the built-in shadowless LED light to illuminate your work area, ensuring high visibility in dimly lit spaces."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73902e"
  },
  "asin": "B09PDWZ1WT",
  "title": "niupipo Pickleball BallsPickleball Net Outdoor Pickleball Balls USAPA Approved Pickle BallsPortable Pickle Ball nets for Tournament High Elasticity amp Durable 3612100 Pickleball Balls Pack",
  "link": "https://m.media-amazon.com/images/I/61VxYGIftBL._AC_SX466_.jpg",
  "detail": "[Good Balance & High Elasticity] In each of the pickleball ? balls ? are ? 40 precision-drilled holes all across from top to bottom, ? which ? is ? designed ? to ? minimize ? wind ? interference and air resistance, ? giving the ? pickleball ? balls ? outdoor ? a ? perfectly balanced ? flight ? and ? tight, ? reliable ? spin with every hit. ? In ? addition, ? the high ? elasticity of our ? pickleballs ? mainly ? comes ? from ? high-quality ? materials ? and ? precise processing."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739033"
  },
  "asin": "B09PDXQVX9",
  "title": "niupipo Pickleball BallsPickleball Net Outdoor Pickleball Balls USAPA Approved Pickle BallsPortable Pickle Ball nets for Tournament High Elasticity amp Durable 3612100 Pickleball Balls Pack",
  "link": "https://m.media-amazon.com/images/I/5190vRlmFQL._AC_SX466_.jpg",
  "detail": "[Durable with High-Quality Material] These pickleball balls use high-quality materials that offer greater durability and resist splitting, which makes them long-lasting without deformation. These outdoor pickleball balls can withstand repeated hits for a long time while being suitable for any court."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739038"
  },
  "asin": "B09PDY9WL8",
  "title": "niupipo Pickleball BallsPickleball Net Outdoor Pickleball Balls USAPA Approved Pickle BallsPortable Pickle Ball nets for Tournament High Elasticity amp Durable 3612100 Pickleball Balls Pack",
  "link": "https://m.media-amazon.com/images/I/51-bTsCnGyL._AC_SY879_.jpg",
  "detail": "[Good Balance & High Elasticity] In each of the pickleball ? balls ? are ? 40 precision-drilled holes all across from top to bottom, ? which ? is ? designed ? to ? minimize ? wind ? interference and air resistance, ? giving the ? pickleball ? balls ? outdoor ? a ? perfectly balanced ? flight ? and ? tight, ? reliable ? spin with every hit. ? In ? addition, ? the high ? elasticity of our ? pickleballs ? mainly ? comes ? from ? high-quality ? materials ? and ? precise processing."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73903d"
  },
  "asin": "B09PHHNC2Y",
  "title": "niupipo Pickleball Paddle USA Approved Pro Pickleball Paddle with FiberglassGraphite Face Polypropylene Honeycomb Core Cushion Comfort Grip MidWeight Pickleball Paddle for Outdoor amp Indoor Play",
  "link": "https://m.media-amazon.com/images/I/71MFM-xwEuL._AC_SY450_.jpg",
  "detail": "Win more balls; The elongated pickleball paddle has a larger sweet spot due to the vertical surface area of the paddle being longer; When you make contact with an elongated paddle it is going to be closer to the center of the paddle; What's better is it has a longer vertical reach for the player to get to more balls, the weight is about the same maybe even lighter; You can take big groundstrokes like a tennis racquet with the elongated paddle, make the power comes down to the core inside"
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739042"
  },
  "asin": "B09PVK7LX7",
  "title": "Smart WiFi Gateway G2 Hub for Keyless Entry Remote Control amp Manage Bluetooth Deadbolt Door Lock with TTLock App WiFi Bridge Work with Alexa Google Home for Voice Control",
  "link": "https://m.media-amazon.com/images/I/51P1LzI2obL._AC_SX569_.jpg",
  "detail": "【Easy to Setup】This G2 Gateway is easy to set up and control. Just 3 simple steps, it can be paired and connected with the smart door lock within 2 minutes. You can control the smart door lock anywhere via TTlock App. Please note that your smartphone and the gateway must be connected to the same Wi-Fi network when paring the gateway."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739047"
  },
  "asin": "B09PYQQYL6",
  "title": "Keyless Entry Door Lock  Electronic Deadbolt Lock with Keypads Auto Lock 50 User Codes Security Waterproof Smart Lock Easy to Install Ideal for Front Door Home Use Apartment  ELAMOR M19 ORB",
  "link": "https://m.media-amazon.com/images/I/61racf01h5L._AC_SY450_.jpg",
  "detail": "【Auto-Lock Safety】This keypad door lock allows you to set it to lock automatically after 3 to 30 seconds, so you never have to worry about whether you've locked the door or not. The durable, silicone-coated numbers glow when pressed, making it easy to enter your code even in the dark."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff73904c"
  },
  "asin": "B09PYWQ5S9",
  "title": "Keyless Entry Deadbolt Lock  Electronic Door Lock with Keypad Smart Deadbolt Lock with Auto Lock Security Waterproof Smart Lock Easy Install Ideal for Front Door Home Use Apartment  ELAMOR M19",
  "link": "https://m.media-amazon.com/images/I/71Cjvd8B4nL._AC_SX679_.jpg",
  "detail": "【Install Without Identify Door Orientation】Unlike other locks, ELAMOR has an adaptive left and right door design, so you don't need to distinguish between the left and right door orientation to quickly install. Truly realize a fast, simple and easy installation. With 15 minutes and a screwdriver, you can easily install this lock without the need for an expensive locksmith."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739051"
  },
  "asin": "B09QCWMS81",
  "title": "Aromatherapy Diffuser with 12 Essential Oils Set 550ML Aroma Humidifier for Essential Oil Large Room Bedroom Vaporizers Cool Mist Humidifier Gift Set",
  "link": "https://m.media-amazon.com/images/I/71+D3Rm1upL._AC_SX679_.jpg",
  "detail": "【Tabletop or Office Decor】 Diffuser is sure to set the mood and looks great on any table or desktop; use in your home, office, nursery or playroom, chiropractor or doctor’s office, therapeutic massage studios, esthetician offices, beauty salon, yoga studio, bedroom, living room, and family room; makes a great gift for birthdays, housewarmings, holidays, anniversaries, or a gift for mother's day."
},
{
  "_id": {
    "$oid": "65b247f7d7793d69ff739059"
  },
  "asin": "B09S6J3DW4",
  "title": "DOG CARE Rechargeable Bark Collar  Dog Bark Collar with Intelligent Bark Control Vibration Effective Sound Shock Modes Training Collar with 5 Adjustable Levels Dog Shock Collar with LED Indicator",
  "link": "https://m.media-amazon.com/images/I/719BvSSUZlL._AC_SY355_.jpg",
  "detail": "[Intelligent Noise Filtering Design] DOG CARE bark collar can filter out most barking of other dogs. With DOG CARE intelligent barking collar, no more false will be triggered. Designed for all types of dogs, DOG CARE dog bark collar can help you stop inappropriate dog barking more effectively."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73905d"
  },
  "asin": "B09SFV8BGR",
  "title": "niupipo Pickleball Paddle USAPA Approved Pickleball Paddle with Fiberglass Face Protective Cover Ultra Cushion Polypropylene Honeycomb Core 45Inch Grip Lightweight",
  "link": "https://m.media-amazon.com/images/I/71nOl8gSinL._AC_SX466_.jpg",
  "detail": "Durable Internal Honeycomb Core and Reliable Fiberglass Surface - The honeycomb core is a stable structure, which not only improves the strength of the niupipo pickleball paddle but also greatly reduces the weight of the pickleball racquet. The fiberglass surface can improve the elasticity of the pickleball racket, reduce the noise when hitting the ball, and buffer the impact of each shot. The Excellent combination of honeycomb core and fiberglass face greatly improves control and hitting power"
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739062"
  },
  "asin": "B09SH5DK7C",
  "title": "OTIC 12 Portable DVD Player with Bluetooth Function 101 HD Swivel Display Screen 5 Hour Rechargeable Battery Support CDDVDSD CardUSB Car Headrest Case Car Charger",
  "link": "https://m.media-amazon.com/images/I/71H+6+vRNtL._AC_SX466_.jpg",
  "detail": "【1 year warranty】Free replacement for connection problems, damage and missing parts within one year. If you have any questions, please feel free to contact our customer support team. We are happy to answer any questions our customers may have."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739067"
  },
  "asin": "B09ST3WM38",
  "title": "GUTA Trailer Tire Pressure Monitoring System Trailer TPMS with 6 Sensors 6 Alert Modes Signal Booster Power Saving Display Long Sensing Distance for 3 Trailers T1T2T3 for RV Trailer",
  "link": "https://m.media-amazon.com/images/I/71Gf7e9D7oL._SX466_.jpg",
  "detail": "Advanced Technology Alert System - The alert mode of this GUTA TPMS including high & low tire pressure alert, high temperature alert, fast leak alert, missing sensor signal alert, and low sensor battery alert, to cover each of the parameters you need to be aware of while driving. The TPMS sends visual and audio warning alarms immediately when data deviates the preset safety parameters, allowing you to concentrate on long-distance travel or freight while maintaining driver safety."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73906c"
  },
  "asin": "B09STF21SR",
  "title": "Smart Door Lock  Fingerprint Keyless Entry Door Lock with Bluetooth APP Electronic Keypad Spare Keys IC Card Codes IP65 Waterproof Security Smart Deadbolt Easy Install for Home Apartment Office",
  "link": "https://m.media-amazon.com/images/I/61VL5Bp01cL._AC_SY450_.jpg",
  "detail": "Remotely Share Ekey & Auto Lock - This Smart Door Lock is a great choice for Airbnb hosts, rental property management, and self-housing resident. Generate a passcode remotely and share it with your visitors or friends. Auto Lock Mode can be set in TTLock App. When the smart door lock is unlocked via App, Passcode or IC Card, it will re-lock automatically in the reset time. Super ideal for home, apartment, office, and hotel use. Enjoy smart life, start with Smart Door Locks."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739071"
  },
  "asin": "B09STJXT9R",
  "title": "GUTA Trailer Tire Pressure Monitoring System Trailer TPMS with 10 Sensors 6 Alert Modes Signal Booster Power Saving Display Long Sensing Distance for 3 Trailers T1T2T3 for RV for Trailer",
  "link": "https://m.media-amazon.com/images/I/71N2dmAU0VL._SX466_.jpg",
  "detail": "??Advanced Technology Alert System - The alert mode of this GUTA TPMS including high & low tire pressure alert, high temperature alert, fast leak alert, missing sensor signal alert, and low sensor battery alert, to cover each of the parameters you need to be aware of while driving. The TPMS sends visual and audio warning alarms immediately when data deviates the preset safety parameters, allowing you to concentrate on long-distance travel or freight while maintaining driver safety."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739076"
  },
  "asin": "B09STMCNHM",
  "title": "GUTA Trailer Tire Pressure Monitoring System Trailer TPMS with 8 Sensors 6 Alert Modes Signal Booster Power Saving Display Long Sensing Distance for 3 Trailers T1T2T3 for RV Trailer",
  "link": "https://m.media-amazon.com/images/I/712SQF4PhVL._SX466_.jpg",
  "detail": "Power Saving Monotor - GUTA monitor has a built-in rechargeable internal lithium battery that could use 12~14 days after 4 hours fully charge. The monitor goes into power saving mode if no motion or vibration is detected in 15 minutes to save battery. The sensors send status signals to the monitor on 5 minutes intervals continuously as long as the sensors are under pressure.Sensor battery life is up to 4 years, also the battery CR2032 is replaceable."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73907b"
  },
  "asin": "B09TDP4HF3",
  "title": "Portable Air Conditioner  Rintuf 12000 BTU Portable AC Cools Rooms up to 550 Sqft Also as Dehumidifier amp Fan amp Smart Timer with Handy Remote Washable Filter Universal Wheels Window Kit",
  "link": "https://m.media-amazon.com/images/I/51nC7cq3T1L._AC_SX385_.jpg",
  "detail": "???????????????? ???????????????? ???????????????? - At an environment of RH 20%-85%, this portable AC Unit can easily remove up to 59.2 pints of moisture from the air per day for your bedroom, basement, and cloakroom. Working as a dehumidifier, Rintuf is also able to solve various problems in this humid summer, such as moldy furniture, peeling wall, musty smell, and clothes staying wet."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739081"
  },
  "asin": "B09TVYHP3Z",
  "title": "WiFi Smart Lock Keyless Entry Door Lock with Remote Unlock Easy to Install Electronic Deadbolt with Voice Control Works with Alexa Google Asistant Security Door Lock Great for Front Door Home Use",
  "link": "https://m.media-amazon.com/images/I/6157H67DZBL._AC_SX522_.jpg",
  "detail": "【WIFI Remotely Unlock & App Features】Control your ELAMOR electronic lock anytime, anywhere with the build-in Wi-Fi connect bridge(no additional gateway required). You can unlock your door, share Ekeys, check logs and manage users. Quickly and easily share permanent, temporary or scheduled access with friends, family, and never hide a key under the doormat again. WI-FI digital smart lock makes your life smarter and convenient, perfect for home use, apartment, garage, cellar."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739086"
  },
  "asin": "B09TVZZYYP",
  "title": "WiFi Smart Lock Keyless Entry Door Lock with Remote Unlock Easy to Install Electronic Deadbolt with Voice Control Security Door Lock Great for Front Door Home Use",
  "link": "https://m.media-amazon.com/images/I/615TMdFUhKL._AC_SX466_.jpg",
  "detail": "【Voice Control & Auto-lock】 The keyless door lock includes a built-in Wi-Fi bridge that connects directly to Alexa and Google Asisitant without the need for an additional gateway. Connect your lock to your favourite voice assistant or smart home system! The WIFI lock is more secure than ever with a customised 3-30 second auto-lock feature that helps you for peace of mind when your hands are full of groceries, which is great for those busy moments when you're on the phone or with the kids."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73908b"
  },
  "asin": "B09TW1HRPR",
  "title": "WiFi Smart Lock Keyless Entry Door Lock with Touchscreen Keypad Remotely Control Easy to Install WIFI amp Bluetooth Electronic Deadbolt Works with Alexa Security Deadbolt Lock Idea for Front Door",
  "link": "https://m.media-amazon.com/images/I/61g67EPQ3WL._AC_SX569_.jpg",
  "detail": "【Voice Control & Auto-lock】 The keyless door lock includes a built-in Wi-Fi bridge that connects directly to Voice Asisitant without the need for an additional gateway. Connect your lock to your favourite voice assistant or smart home system! The WIFI lock is more secure than ever with a customised 3-30 second auto-lock feature that helps you for peace of mind when your hands are full of groceries, which is great for those busy moments when you're on the phone or with the kids."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739090"
  },
  "asin": "B09TW2FN3X",
  "title": "Stud Finder Wall Scanner  VIVREAL 4 in 1 Stud Finder with LCD Display Beam Finder Center Finding amp Sound Warning Wall Scanner for the Center and Edge of Wood AC Wire Metal Studs Black Silver",
  "link": "https://m.media-amazon.com/images/I/616ic4baKBL._AC_SX679_.jpg",
  "detail": "4 Scanning Modes - VIVREAL stud finder has 4 scanning modes to locate the center and the edge of woods, beam, joist, metals, or deeply embedded objects; The stud mode of wall scanner is used for finding the wood studs up to 0.74inch (19mm) deep; Deep mode can be used for scanning walls for 1.49inch (38mm) deep; AC scan locates live unshielded AC wires up to 2inch (51mm) deep; Metal mode detects metal (Ferrous and Non-Ferrous Metal) up to 2.36inch (60mm) deep."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff739095"
  },
  "asin": "B09VRZ4BH7",
  "title": "EMEET 3 in 1 Webcam  Streaming Webcam with Microphone 2 Speakers amp 4 Builtin Noise Reduction Microphones C980 Pro 1080P HD Webcam for Video ConferencingGaming Plug amp Play wCover  Gray",
  "link": "https://m.media-amazon.com/images/I/61MiUALNu4L._AC_SY450_.jpg",
  "detail": "[Active Noise Cancelling & Auto Echo Cancellation] 4 omnidirectional microphones arrays have effective built-in noise reduction technology, keeping pesky background noise out of your videos. Whether you are in an open office or a noisy cafe, you can easily start your video calls with this pc webcam"
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73909a"
  },
  "asin": "B09VSP8QKT",
  "title": "EMEET 1080P HD Webcam C960 Web Camera with Microphone 90POV PC Camera w2 Noisecanceling Mics ampPrivacy Cover Plug amp Play USB Webcam for Video Callling ZoomSkypeFacetimePCMacLaptop  Grey",
  "link": "https://m.media-amazon.com/images/I/61pRDk9-XeL._AC_SX466_.jpg",
  "detail": "【High Compatibility & Multi Application】EMEET C960 moitor camera is compatible with Windows 7/10/11, MacOS10.10 or later, Linux, Android TV 7.0 or later. The compatibility of the stream camera is super wide for major software like Zoom, Facetime, Google Meet, Skype, YouTube and more. Whether this USB PC Computer Webcam with Microphone is used for online studying/ teaching, home office, conference, meeting or video calling, the web camera is perfectly suitable for you as a tripod-ready universal clip."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff73909f"
  },
  "asin": "B09W2TBQ1F",
  "title": "Bluetooth Speakerphone  EMEET M2 Max 48kHz Professional 4 HD Mics Conference Speaker up to 15 People VOICEIA Noise Reduction amp Enhanced 360 Voice Pickup USB Dongle Daisy Chain For Home Office Gray",
  "link": "https://m.media-amazon.com/images/I/61Ku84puqnL._AC_SY450_.jpg",
  "detail": "48kHz Professional 4 Audio Level Directional Mics - Conference speakerphone for laptop comes with 4 ?10 48kHz HD microphones, which are often used in movies and professional audios, meeting users’ HD voice requests. Volume changes and voice could be recorded more finely, leading to a new level of voice pickup. The conference speaker omnidirectional microphone with humanized DOA light display showing the orientation of sounds. Providing stunning voice transmission to the utmost extent."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390a4"
  },
  "asin": "B09W2VVGNS",
  "title": "ATTOP Drones with Camera for Adults 4k EIS Camera 2Axis Gimbal GPS Drone with Brushless Motor 60Mins Flight Time 5G WiFi Transmission Follow Me Smart Return Home 4K Drone with Carrying Case",
  "link": "https://m.media-amazon.com/images/I/71FdVmA0KsL._AC_SY355_.jpg",
  "detail": "[Foldable & Portable Design] The foldable 4K drone's arms and propeller blades can be folded for easy portability. After use, it can be stored in the included carrying case, making it the perfect travel companion. ATTOP portable drones can be used in parks, parking lots, campgrounds, or beaches to record exciting moments anywhere. Take the drones with cameras for adults on an unforgettable trip. It is also ideal as a idea gift for men or men birthday gift ideas and sympathy gift."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390a9"
  },
  "asin": "B09W8YZRBC",
  "title": "Metal Detector for Kids Kids Metal Detector with Waterproof Coil Backlight LCD Display Adjustable Lightweight Metal Detector Use for Detecting Coins Gold and Outdoor Treasures",
  "link": "https://m.media-amazon.com/images/I/71Y7vKCE2PL._AC_SY450_.jpg",
  "detail": "Accurate Detetion Modes: This metal detector uses the latest technology chip, which can accurately detect extremely small metals. Three detection modes fully meet children's curiosity and daily detection needs, you can easily find the ferrous/medium conductivity/high conductivity metals."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390af"
  },
  "asin": "B09W8Z5TPZ",
  "title": "Kids Metal Detector  Metal Detector for Kids with Waterproof Coil Backlight LCD Display Adjustable Lightweight Metal Detector Use for Detecting Coins Gold and Outdoor Treasures Blue",
  "link": "https://m.media-amazon.com/images/I/61+QHe6XTwL._AC_SX679_.jpg",
  "detail": "[Safe & Lovely Design for Kids] - Our skycruiser metal detector is a perfect gift for your families. Its lovely profile is designed both by professional industrial designer and kids visual designer. Adjust the brightness of the metal detectors for the kids to strong and low light environments. The metal detector is specially designed for travel or outdoor activities and is suitable for children and beginners."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390b4"
  },
  "asin": "B09W8Z74SW",
  "title": "skycruiser Kids Metal Detector 4Inch HighAccuracy Adjustable Waterproof Metal Detectors for Kid Lightweight Search Coil 2531 with 3 Detection Models Metal Detector for Outdoors Sand Field",
  "link": "https://m.media-amazon.com/images/I/71qVCUOGR5L._AC_SX466_.jpg",
  "detail": "[25\"-31\" Adjustable Metal Detector for All Height Kids] The metal detectors for kid has an adjustable stem from 25\" to 31\" forchildren and teens of all heights. So don't worry about your child not being able to continue using it after they grow taller. The detection depth can reach up to 4\". The metal detector can be used in science education, for playing treasure hunting, and to help our children exercise their exploration skills and curiosity."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390ba"
  },
  "asin": "B09WHY8R9R",
  "title": "EMEET Bluetooth Headset with Microphone Professional Wireless PC Headphones ANC Noise Cancelling with 6 VOICEIA Tech Mics 3 Modes and 48 Hours Talktime HS150 Black",
  "link": "https://m.media-amazon.com/images/I/71poiaryL7L._AC_SY450_.jpg",
  "detail": "[Multiple Connection Modes] Both wired and wireless connections are available for over-ear Bluetooth headphones. Direct connections to a headset with a microphone for a computer are possible using dual 5.0 Bluetooth, a dongle, and a USB cable. Additionally, a computer headset functions with or without Bluetooth on laptops, PCs, desktops, tablets, or mobile phones. The wireless headphones work with popular communication platforms like Google Hangouts, Microsoft Teams, Zoom and Skype for Business."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390bf"
  },
  "asin": "B09X1FDYNX",
  "title": "FOPO 15 Inch Triple Portable Monitor FHD 1080P HDR IPS Laptop Monitor Screen Extender Dual Monitor Display for 1517 Laptop amp SwitchXbox Support WindowsMACOnly for M1 Max amp M1 Pro  S17",
  "link": "https://m.media-amazon.com/images/I/71iCzZCDjTL._AC_SY450_.jpg",
  "detail": "Include All Accessories You Needed - If you don't know wether you laptop is compatible with this dual monitor or not, please contact us, we will offer you a solution in 24hrs. We provide all accessories you need. There are 2 Type-C cables(Video & Power), 2 HDMI cables(Video only), 2 USB-C to USB-A cables(Power Only), 1 power adapter, 2 screen protectors, and a carry bag included. [NOTE: the dual screen support M1 Pro & Max, but it doesn't compatible with Apple's M1 & M2 & Surface & Chromebook]."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390c4"
  },
  "asin": "B09X5H7T9S",
  "title": "COOLPO Video Conference Camera 4K Webcam Smart GestureControl Focus AI Autoframing w 110 FoV Noise Reduction amp Echo Cancellation 6 Microphones for Video Conferencing Streaming wCover",
  "link": "https://m.media-amazon.com/images/I/51bgPZzsKiL._AC_SX425_.jpg",
  "detail": "4K HD Camera + Gesture-activated Focus - The COOLPO video conference camera captures the meeting room in 4k resolution and delivers crisp video with a 110° ultra-wide view. In addition, this webcam with a microphone supports gesture-activated focus. Just raise your hand, the conference room camera will detect it and zoom in until the video is focused on you, and the image of this video conferencing camera will also follow you as you move. NOTE: To activate the focus, please raise your hand for about 2 seconds until the webcam zooms in. To reset the webcam to the default 110°, the person in the image center should raise hand again until zooming out."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390ca"
  },
  "asin": "B09XB2SPVH",
  "title": "Metal Detector for Adults Professional  IP68 Waterproof Metal Detector High Accuracy All amp Disc Notch amp Pinpoint Modes 10 Waterproof Search Coil Adjustable Light 2022 New Version",
  "link": "https://m.media-amazon.com/images/I/71lz59K8JsL._AC_SX679_.jpg",
  "detail": "??ADJUSTABLE & HUMANITY DESIGN – The 41.3” to 47.6” RM RICOMAX metal detector fits metal detector enthusiasts of all ages, and it only weighs 2.31 lbs which saves more effort and makes you more comfortable and less stressful. Let's start your treasure hunting with this lovely RM RICOMAX metal detector."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390d1"
  },
  "asin": "B09XQQW1H1",
  "title": "Mini Drone with Camera Drones for Kids Beginners RC Quadcopter with App FPV Video Voice Control Altitude Hold Headless Mode Trajectory Flight Foldable Kids Drone Boys Gifts Girls ToysYellow",
  "link": "https://m.media-amazon.com/images/I/71E9OoypmRL._AC_SY450_.jpg",
  "detail": "【HD Pictures & Live Videos & FPV Drone】 - ATTOP FPV drone with camera can take photos and videos. Just connect your phone with an FPV drone to watch a live video. Enjoy the first-person view fun. The view will be shown directly on your phone, providing you with fantastic FPV experiences. ATTOP mini drones with camera for kids will bring more pleasure when staying at home to play with your child. If you are looking for some teen boys gift ideas for kids, ATTOP drones for kids is an 8-12 year old boy/girl gift idea."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390d6"
  },
  "asin": "B09XQSPVTS",
  "title": "Drones with Camera for Adults  1080P FPV Drone with Carrying Case Foldable RC Drone W2 Batteries Altitude Hold Headless Mode ATTOP Camera Drones for AdultsBeginners GirlsBoys Gifts",
  "link": "https://m.media-amazon.com/images/I/71svU-MgG+L._AC_SX466_.jpg",
  "detail": "[Ideal Gift with A Carrying Case] ATTOP 1080p FPV Drone with camera, suitable for adults and beginners, foldable design, and comes with a carrying case, making the professional drones with camera easy to take out, enjoy charming features, and play with the family while out and about. Considerate bag design is the best gift for friends, an ideal gift for teenagers and boys."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390db"
  },
  "asin": "B09Y1VLF3J",
  "title": "DEPGI Portable Gaming Monitor for Xbox S not Included 1080P Full HD 125 Display with IPS Screen Dual HDMI 2 Audio Jack Speaker Support HDR Freesync 3 Game Modes for Travel Outdoor Indoor Use",
  "link": "https://m.media-amazon.com/images/I/71tPapAX0IL._AC_SX425_.jpg",
  "detail": "??[Designed for Xbox Series S]: Dual HDMI ports and game console body wrapping designed makes this portable gaming monitor totally intergrated with Xbox S, also convenient to connect Nintendo Switch , Laptop, Phone , PC as a independent or second monitor. It's ideal for playing games or extending your screen."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390e0"
  },
  "asin": "B09ZV7JNCS",
  "title": "28 Cubic Ft Fireproof Safe Box with Fingerprint Design ADIMO Cabinet Safe with AutoOpen Door Weighted Cabinet Safe with Sensitive Alarms Dual Key System for Documents Money Gold and Guns",
  "link": "https://m.media-amazon.com/images/I/7167nl5qVUL._AC_SY450_.jpg",
  "detail": "【Extra Strong with 5 Thick Bolts】Alloy steel makes ADIMO Fingerprint safe box thicker and therefore safer from any potential drilling and damaging. There are 5 thick bolts at the side of the door, making the door stronger for thefts. These make ADIMO Safe Box a perfect choice for your valuable items such as cash, gold, jewelry or important document."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390e6"
  },
  "asin": "B0B17ZYD41",
  "title": "Keyless Entry Door Lock Smart Deadbolt Lock with Bluetooth App Electronic Keypad IC Card Spare Keys Security Waterproof Smart Lock Easy Install USB Ideal for Home Use Office HotelSliver",
  "link": "https://m.media-amazon.com/images/I/6105PZXpJ2L._AC_SX679_.jpg",
  "detail": "【Multiple Ways To Unlock】 4-in-1 Electronic Smart Door Lock: APP+SmartKey+Passcode+IC Card. 4 Ways to Lock and Unlock Satisfy daily unlocking habits and choose as you like. Get rid of the trouble caused by forgetting the key. Keyless Entry Door Lock is an excellent smart home device for home, apartment, office, hotel."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390eb"
  },
  "asin": "B0B1VFMPZL",
  "title": "Flexible Tripod  Phone Tripod Portable amp Sturdy Adjustable Tripod wWireless Remote Cell Phone Tripod Easy to Adjust 360 Ball Head Mini Tripod can Load 66lbs Stands for Phone Camera Recorder",
  "link": "https://m.media-amazon.com/images/I/61OYG3uoZmL._AC_SY450_.jpg",
  "detail": "[Handy Wireless Remote Control] This flexible tripod with a convenient Bluetooth remote control makes it easy to start long-distance shooting or recording (Up to 32.8ft). Besides, you can also use this phone tripod for selfie and group photo."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390f0"
  },
  "asin": "B0B1VFYP91",
  "title": "Camera Tripod  Tripod Stand with 360 Ball Head Monopod DSLR Tripod Sturdy amp Stable for Work Aluminum Tripod Load up to 1763lbs and Lightweight for Travel 62 Travel Tripod Compatible with DSLR",
  "link": "https://m.media-amazon.com/images/I/712e9kbNGjL._AC_SY741_.jpg",
  "detail": "[Stable & Anti-Shake Aluminum Alloy] Camera tripod is made of aluminum alloy, and it is anti-shake and stable during use. Even in windy conditions , the aluminum tripod is still as stable as ever, you can travel and work with this DSLR Tripod."
},
{
  "_id": {
    "$oid": "65b247f8d7793d69ff7390f5"
  },
  "asin": "B0B1VG9BJQ",
  "title": "Camera Tripod  62Carbon Fiber Tripod Stable amp AntiShake Lightweight Travel Tripod Easy to Carry Tripod Stand Monopod with 360 Ball Head DSLR Tripod max Load 1763lbs for Canon Nikon Camera",
  "link": "https://m.media-amazon.com/images/I/7165TVoNn3L._AC_SY355_.jpg",
  "detail": "[Multiple Use Sceneries & Wide Compatibility] The monopod can be detached from the tripod when you need more mobility. The gimbal comes with 1/4\" screw, which is compatible with most of brands such as Canon Sony GoPro cameras and camcorders. And this professional tripod comes with 3/8\" mounting screw, you can replace the original gimbal with your own gimbal."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff7390fa"
  },
  "asin": "B0B2JQ3N5V",
  "title": "Keyless Entry Door Lock Electronic Keypad Deadbolt with Handle Auto Lock Front Door Handle Sets Easy to Install 50 User Codes Security Waterproof Smart Locks for Front Door HomeHotel Use",
  "link": "https://m.media-amazon.com/images/I/71t67JcXcAL._AC_SY741_.jpg",
  "detail": "[50 User Codes] The keyless entry door lock with a handle can be assigned up to 50 different codes, you can assign it to your family and trusted friends or give service personnel the password to enter your place once while you are away. This is a very useful function for Airbnb or HomeAway short-term rental owners, commercial residents, and hotels. The keyless deadbolt is equipped with an alarm alert function that automatically locks within 90 seconds after trying test > 5 times."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff7390ff"
  },
  "asin": "B0B2R87MXB",
  "title": "Bathroom Faucet WaterSong Waterfall Bathroom Sink Faucet 360 Rotatable Head Single Hole amp Single Handle Bathroom Faucet with Sprayer Faucets for RV Bathroom Sinks 100 LeadFree Matt Black",
  "link": "https://m.media-amazon.com/images/I/61hpkN1anUL._AC_SX569_.jpg",
  "detail": "[360°Rotatable Head] The 360° rotatable bathroom sink faucet allows you to swivel the head to change the direction of the water flow, flushing the corners without worrying about any dead ends. The WaterSong bathroom sink faucet is equipped with a single handle to help you adjust the water flow output and temperature smoothly and easily. When families have to brush their teeth together in the morning in a hurry, this 360° rotatable bathroom sink faucet would help a lot."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739104"
  },
  "asin": "B0B2R8SYZZ",
  "title": "CAT CARE Cat Water Fountain84oz25L Ultra Quiet Pet Water Fountain Automatic Dog Water Bowl Dispenser with UltraFiltration Tech Removes 9999 of Impurities Human Grade Drinking Fountain Blue",
  "link": "https://m.media-amazon.com/images/I/61kmH7TM0BL._AC_SX569_.jpg",
  "detail": "[Human Grade Purification] The CAT CARE water fountain is perfect for cats and smalldogs to keep your pet hydrated, active, healthy and safe. The water is fully clean withhuman-grade purification technology so you don't have to worry for dirty water in yourpets bowl."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739109"
  },
  "asin": "B0B2RMJSM2",
  "title": "RM RICOMAX Metal Detectors Pinpointer Lightweight amp Portable Waterproof Handheld Pinpointer with Belt Holster Treasure Hunting Tool Accessories Buzzer Vibration Metal Detectors for Gold Sliver",
  "link": "https://m.media-amazon.com/images/I/61ei7X2rulL._AC_SY450_.jpg",
  "detail": "[Waterproof & Easy to Operate] The metal detector's sealed waterproof design allows you to use it to detect metal up to 118.1 inches (9.8ft.) underwater. In any weather, heavy rain, even in lakes, rivers, and oceans, you can submerge the waterproof precision metal detector to find hidden treasures underwater. The simple one-touch operation makes your outdoor trips easier."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73910e"
  },
  "asin": "B0B2WG2DTZ",
  "title": "Electric Fireplace Heater Infrared Space Heater with 3s Fast Heating 1500W 750W 2 Modes 3D Flame Effect Overheat TipOver Protection Brightness Adjustable Safe Free Standing Stove Without Noise",
  "link": "https://m.media-amazon.com/images/I/61q745x8T1L._AC_SY355_.jpg",
  "detail": "[Anti Tip-Over & Overheating Protection] The ETL-certified electric fireplace heater complies with international safety standards. Also, the built-in auto-shut-off device greatly increases the safety of the electric heater. If for any reason it overheats or falls down, it will automatically shut off to prevent any kind of accident. No more worry about your children or pets being around."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739113"
  },
  "asin": "B0B2WT5CX2",
  "title": "Electric Space Heater 1500W Infrared Heater with 3 Heat Modes Remote Control amp Timer Room Heater with Overheat amp TipOver Shut Off Protection Wood Cabinet Heater for Large Room Low Noise Brown",
  "link": "https://m.media-amazon.com/images/I/61Zm0uDMo+L._AC_SY355_.jpg",
  "detail": "Multi-places and Smart Modes: The indoor space heater carries 3 heat modes; The high heat of an electric space heater will distribute 1500 watts of sun-like warmth; The low mode will deliver 750 watts of warm airflow; Eco mode of the infrared space heater will save you up to 300 watts of energy; The infrared heater is ideal for multiple living spaces, offices, and bedrooms; Moreover, the electric room heaters can quickly heat up your room in seconds, you don’t have to wait in the cold room anymore"
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739118"
  },
  "asin": "B0B38JFG9T",
  "title": "Space Heater Space Heaters for Indoor Use 1500W Electric Heater with 3 Modes 3S Quick Heat Thermostat with Overheat Protection Space Heaters for Indoor Use Large Room Heater for Garage Bedroom",
  "link": "https://m.media-amazon.com/images/I/719Z467oGrL._AC_SX679_.jpg",
  "detail": "[Apply to Diverse Use] Are you looking for an heater with multiple uses This portable greenhouse heater could offer your loved ones warm air! With the space heater, you can enjoy your hot coffee outdoors while watching the stunning sunset on your patio in Winter at Christmas. Besides, the electric heater could warm up your garage instantly in Winter or cool it down while you get up early for work in Winter Summer. With the sun-like room heaters for indoor use, you can enjoy life ALL seasons!"
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73911d"
  },
  "asin": "B0B3J1GN33",
  "title": "1500W Space Heater 3S Fast Patio Heater for Outdoor Use heater with 4 Adjustable Modes 90Oscillation Large Space Heater for Indoor Use with Overheat amp Tipover Protection Infrared Heater garage",
  "link": "https://m.media-amazon.com/images/I/619Vycu8q8L._AC_SY450_.jpg",
  "detail": "3s Instant Heat & 4 Adjustable Modes; Equipped with a carbon fiber heating tube and under the rated power of 1500W, the space heaters for indoor use can heat up in 3 seconds a relatively small space like a bedroom; The large space heater comes with 4 adjustable heat setting modes to your different needs: 750W, 750W+Oscillation, 1500W, 750W+Oscillation; You can simply spin the switch to get the mode you want."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739122"
  },
  "asin": "B0B3MH1QG9",
  "title": "Electric Space Heater for Office  Portable Ceramic Space Heater wRemote 120Oscillating thermostat 3 Modes 12H Timer Quiet Room Heater for Bedroom Garage Office Home Indoor use",
  "link": "https://m.media-amazon.com/images/I/81QhNZEUshL._AC_SX466_.jpg",
  "detail": "?【Portable & Multi-scene use】 The portable body of only 9.1 x 6.7 x 17.1 inches, which makes this ceramic electric heater suitable for any use-case environment. The height of this heater is equivalent to two bottles of Coke and its weight of 5.74 pounds makes it extremely portable. This instant warm space heater can be moved and used to bedrooms, living rooms, offices, bathrooms, and small garages with ease."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739127"
  },
  "asin": "B0B3QGL9XX",
  "title": "Electric Screwdriver AM ARROWMAX Cordless Precision Screwdriver Set with 34 Magnetic Precision Bits Smart Motion Control Rechargeable Tool Kit for Electronics Laptops Glasses Watch SES PRO Black",
  "link": "https://m.media-amazon.com/images/I/71EMbI31ySL._AC_SY355_PIbundle-34,TopRight,0,0_SH20_.jpg",
  "detail": "Body Sensory Dual-mode - SES PRO electric screwdriver can control the forward and reverse direction by body sensing. The Body Sensory Dual-mode meets your requirements for tightening or loosening auger bits in difficult situations. The pen-shaped body is circular arc surface designed and easy to grasp. The power screwdriver allow arthritic hands to grasp without fatigue."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73912d"
  },
  "asin": "B0B3R3T5MF",
  "title": "AM ARROWMAX Electric Screwdriver Precision Screwdriver w 34 Magnetic Bits 4 Torque Settings Red Dot IF Winning Design Rechargeable Mini Cordless Screwdriver for Phone Laptop Camera Black",
  "link": "https://m.media-amazon.com/images/I/714LLLQ7quL._AC_SX466_PIbundle-34,TopRight,0,0_SH20_.jpg",
  "detail": "[Comprehensive Set of 34 Magnetic Bits] Our precision screwdriver set offers a diverse selection of 34 precision bits, empowering you to tackle daily tasks with confidence. Effortlessly switch between bits using the magnetic bit holder, eliminating the frustration of dropped bits and streamlining your workflow. Plus, this precision screwdriver set features a magnetic bit storage box with an easy-to-open, pop-up design, allowing your workspace to remain neat and organized."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739132"
  },
  "asin": "B0B3R8BWD8",
  "title": "Electric Screwdriver AM ARROWMAX Cordless Precision Screwdriver Set with 28 Magnetic Precision Bits Rechargeable Portable Repair Tool Kit for Electronics Laptops Glasses Clocks SES MINI Black",
  "link": "https://m.media-amazon.com/images/I/717KDRVGX3L._AC_SX425_PIbundle-28,TopRight,0,0_SH20_.jpg",
  "detail": "[Enhanced Convenience & Comfort] Our electric screwdriver set stands apart from other round-design screwdrivers with its unique ergonomic cube shape, specifically crafted to offer a comfortable grip and improved control as you rotate. With the status indicator, you can easily keep track of whether you're tightening or loosening. Plus, the built-in shadowless LED light comes to your aid, illuminating your workspace and ensuring excellent visibility even in dimly lit areas."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739137"
  },
  "asin": "B0B586WC5T",
  "title": "Gaming Monitor  Jlink 27 165Hz 1ms 1440P QHD 2560x1440 106 sRGB Computer Monitor AntiGlare FreeSync Gsync HDR 2K VA Screen with HDMI DP USB Tilt Swivel Height Pivot Adjustment VESA Mountable",
  "link": "https://m.media-amazon.com/images/I/717bIw4rILL._AC_SY450_.jpg",
  "detail": "[Gamer-Oriented Design] This gaming monitor is designed with adjustable tilt angle so that gamers can choose their most proper screen position and battle comfortably. 3-sided virtual frameless design highly enhances vision field. Catering to gamers’ needs, this monitor also supports VESA mount."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73913c"
  },
  "asin": "B0B58C2SDB",
  "title": "Computer Monitor  Jlink FHD 32 Inch Monitor 1920x1080P 60Hz 104 sRGB LCD Display with HDMI VGA 35mm Audio HDR Low Blue Light AntiGlare Larger VA Screen with Freesync Tiltable amp VESA Mountable",
  "link": "https://m.media-amazon.com/images/I/717ExzCcBzL._AC_SY450_.jpg",
  "detail": "[Immersive Viewing Experience] The 32-inch computer monitor with a wide viewing angle delivers a 1920x1080P full HD immersive visual experience. Its 104% sRGB color gamut, 16.7M dispersion range, and 4000:1 ultra-high contrast ratio make the picture more colorful, bright, and realistic. At the same time, with its VA panel, and HDR technology, the clarity of the LCD computer display is crystal-clear."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739141"
  },
  "asin": "B0B58CHD7N",
  "title": "Jlink Computer Monitor FHD 24 Inch Monitor 1920x1080P 75Hz 5msGTG 99 sRGB LCD Computer Display with HDMI VGA 35mm Audio HDR Low Blue Light AntiGlare VA Screen with Freesync Tilt Adjustable",
  "link": "https://m.media-amazon.com/images/I/71Tu-vrniNL._AC_SX425_.jpg",
  "detail": "[Diverse Connectivity] You can connect the computer monitor to dozens of devices through the HDMI and VGA ports hidden behind the monitor. By connecting a game console and connecting your headset to the 3.5mm Audio Jack, you can experience the immersive fun of the game. As an extended screen for your laptop, or as a second monitor for your computer, your work efficiency will also be greatly improved."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739146"
  },
  "asin": "B0B58F715P",
  "title": "Gaming Monitor Jlink 24 Inch FHD 1080P 165Hz Computer Monitor 106 RGB 1ms Computer Display with HDMI DP 35mm Audio HDR Low Blue Light AntiGlare IPS Screen with Freesync amp Gsync Adjustable Tilt",
  "link": "https://m.media-amazon.com/images/I/719FicvokKL._AC_SY450_.jpg",
  "detail": "[Flexible Connectivity] Jlink full HD computer monitor has multiple ports, including HDMI x2, DisplayPort x2, and 3.5mm audio port x1. You can connect the display to your laptop as an extended screen, or connect two monitors to merge into one large screen, your work will be more efficient. In addition, connecting the headphone to the 3.5mm audio port, you will experience the immersive fun of the game."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73914b"
  },
  "asin": "B0B58XDJVR",
  "title": "Jlink Gaming Monitor 27 Inch 1080P 165Hz Computer Monitor 1msMPRT FlickerFree Low Blue Light HDR Frameless PC Monitor with HDMI DisplayPort Freesync amp Gsync Compatible Tiltable amp VESA Mountable",
  "link": "https://m.media-amazon.com/images/I/81coZpL+aRL._AC_SX466_.jpg",
  "detail": "[Greater Clarity] 1920x1080 FHD resolution makes dynamic effects look sharper for smooth and responsive gameplay. 106% sRGB color gamut delivers rich, vivid pictures. The gaming display integrates advanced technologies, including shadow enhancement and 1:1 details reproduction, also decreases potentially irritating blue light waves for anti-glare eye care."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739150"
  },
  "asin": "B0B5LCT9Z8",
  "title": "Oil Heater 700W OilFilled Radiator Heater with Thermostat Overheat Protection2 Heat Settings Durable Oil Heaters for indoor use Quiet Electric Space Heater for Bedroom Office Home",
  "link": "https://m.media-amazon.com/images/I/61o1zMAEFSL._AC_SX425_.jpg",
  "detail": "[Fast and Widespread Heating] TRUSTECH oil heater has high and low heating modes to quickly heat the air around you in seconds. The high power of 700W allows the heating area of this oil heater to reach 500 sq. ft, which is very suitable for personal use, allowing you to enjoy a warm and comfortable life in the cold winter. This oil heater will be your long-term partner for work, study, and sleep. You can enjoy the warm environment to the maximum."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739155"
  },
  "asin": "B0B5ZKV7LP",
  "title": "Heater and Fan Combo for Desk 2 in 1 Heater Fan wFast Heating amp Fan Modes 45 Adjustable Angle Overheated amp TipOver Protection Portable Heater and Cooler fan for Office Bedroom Indoor Use",
  "link": "https://m.media-amazon.com/images/I/614zFBQbjgL._AC_SX569_.jpg",
  "detail": "[3 Modes for All Year Round] Designed w/ 2 heating modes and a fan mode, the 2 in 1 heater fan for indoor use can come in handy in all seasons. In winter, when coming in from the biting cold, you can choose the high heating mode, followed by the low heating mode to stay toasty. Plus, the fan mode means the 2 in 1 heater fan for indoor use won't become unused in summer. The Natural air mode can turn your heater into a circulating fan to cool your room."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73915a"
  },
  "asin": "B0B6N6PFX1",
  "title": "ATTOP Mini Drone with Camera 1080P Camera Drone FPV RC Quadcopter w Voice amp Gesture Control Altitude Hold Headless Mode 3 Speed Modes 3 Batteries 30 Min flight 3D Flip Drone for Kid Adult Beginner Gift",
  "link": "https://m.media-amazon.com/images/I/71PgQ0bWnvL._AC_SY355_.jpg",
  "detail": "1080P 90° FPV Camera Drone: The small drone with camera is equipped with 90° wide-angle 1080P photography, which provides a wider fantastic field of view and lets you enjoy HD pictures and videos from the perspective of the FPV drone via the “Attop Nano” app. Normally the distance is about 50-100 feet. Staying connected in real-time is priceless, plug and play your phone/iPad with the mini drone with camera and share all your adventures on your social media, faster and easier than ever."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73915f"
  },
  "asin": "B0B6NJXMNT",
  "title": "Drone with Camera for Adults amp KidsATTOP Skyquad Drone Foldable 1080P FPV Drone w3 Batteries amp Carrying CaseRC Quadcopter of 30 Mins Flight Time120FOVVoiceampGesture ControlOnekey Return3D Flip",
  "link": "https://m.media-amazon.com/images/I/71hspMSuTHL._AC_SY450_.jpg",
  "detail": "[Simple Operation, Easy to Play] ATTOP drones for adults come with one key return function, and can easily find its way home without getting lost. Altitude-hold ensures a steady hove when you want to free your hands or get high-resolution pictures and it provides the condition to allow you to focus on your photography and creativity. Other functions, like one key start/landing, emergency stop, and headless mode, keep the professional drones with camera simple to control for even beginners."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739164"
  },
  "asin": "B0B6PGHN5T",
  "title": "Drone with Camera for AdultsKidsBeginners ATTOP 1080P FPV Drone w3 Batteries for 30 Mins Flight Toy Drone for Boys amp Girls 1click to FlyLandReturnShare Stable for Indoor Foldable for Outdoor",
  "link": "https://m.media-amazon.com/images/I/71Sdzi2KYlL._AC_SX425_.jpg",
  "detail": "[Multiple Control Methods] The ATTOP camera drone provides diverse control methods while ensuring playability. The one-key fly/land/return make it easy for beginners and kids. In addition, voice control and gesture control would be friendly to kids who know few words. The gravity control in the W FPV app helps enhance the immersive experience of playing camera drone. You don't have to distinguish the forward direction while turning to the headless mode. Enjoy the fun of aerial photography."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739169"
  },
  "asin": "B0B6VW3CH3",
  "title": "Electric Heater for Indoor Use 1500W Space Heater with Remote 3s Fast Heating FanLowHigh 3 Modes Quiet 12H Timer 60 Oscillating Portable Room Heater with LCD Display Anti Overheat amp Tipover",
  "link": "https://m.media-amazon.com/images/I/61zGoVo1U4L._AC_SX466_.jpg",
  "detail": "Dual Control Modes: Apart from the clear control panel on the product, this electric space heater comes with a remote control with sensitive response and a 16ft ultra-strong signal range. There are 5 buttons on the remote, which are equivalent to the functions of the control panel. With this electric room heater, you will be able to stay warm and comfortable, get a nice rest on your bed or sofa and enjoy great movies this winter season!"
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73916e"
  },
  "asin": "B0B7HHP37G",
  "title": "102 in 1 Electric Screwdriver AM ARROWMAX Cordless Precision Screwdriver Set with 96 Magnetic Bits Red Dot IF Winning Design Rechargeable Portable Screwdriver Set for Phone Laptop Camera Watch",
  "link": "https://m.media-amazon.com/images/I/7133U1Czu-L._AC_SX425_PIbundle-102,TopRight,0,0_SH20_.jpg",
  "detail": "[500mAh Long-Lasting Battery] Equipped with a 500mAh battery of long battery life, once you get this precision screwdriver set, you can use it for a long time without charging. In addition, this mini electric screwdriver can tighten a total of 900 screws. Equipped with a USB-C cable, it is convenient to charge at any time. Our electric screwdriver cannot be charged via USB-C PD chargers, which only supports USB-A to USB-C charging."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739173"
  },
  "asin": "B0B7HSYZZ5",
  "title": "Dog Bark Collar DOG CARE Bark Training Collar with Vibrate amp Static Modes 5 Sensitivity and 7 Intensity Levels Waterproof Rechargeable Adjustable Beep Collar with LED for Small Medium Large Dogs",
  "link": "https://m.media-amazon.com/images/I/615i3ib31GL._AC_SY450_.jpg",
  "detail": "Immediate Bark Control with Static & Vibration - Enjoy a quieter companion in a few days with the dog bark collar’s two hands-off training modes—safe static and vibration. The ultra-low voltage static stimulation is proven to be safe yet effective to stop barking immediately. You also have the option of switching to vibration for an alternative to stimulation if your dog is particularly sensitive."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739178"
  },
  "asin": "B0B7KZYBVG",
  "title": "Electric Space Heater for office  Portable Electric Ceramic Heater Fan W 120 Oscillating 750W1500W Heating Thermostat TipOver Overheat Protection for Small Room Home Indoor Bedroom Personal Use",
  "link": "https://m.media-amazon.com/images/I/71fI1VwMhfL._AC_SY450_.jpg",
  "detail": "【Portable & Easy to carry】Our electric space heater for room use weighs only 4.84 lbs. Lightweight & portable designed able you to move around easily. The top handle is designed to make this portable electric space heater ideal for indoor use. And this small tower heater fan is easy to place or move everywhere in your daily life. Get this portable small heater now, both space-saving and useful!"
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73917d"
  },
  "asin": "B0B8GRHSLS",
  "title": "Tymate Tire Pressure Monitoring System  Solar Charge 5 Alarm Modes Auto Sleep Mode Tire Position Exchange 4 TPMS Sensors 087 PSI Low Power Consumption and Long WorkingLife Sensor",
  "link": "https://m.media-amazon.com/images/I/71DUjP+X+vL._AC_SX679_.jpg",
  "detail": "Auto Backlight & Sleep & Awake Mode - Tymate Tire Pressure Monitoring System M12-3 Black's auto-adjustable backlight can clearly display the data in low light or strong light environment. Real-time monitoring and real-time display of data are the best helpers for driving. It will enter the sleep energy-saving mode after the vehicle stops running for 10 minutes, and will automatically wake up when the car is turned on. Prolong product life while saving energy."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739182"
  },
  "asin": "B0B8RW43ZG",
  "title": "Ice Maker Commercial Ice Machine Self Clean 100lbs24H 45 Cubes per Batch in 1118 Mins Ice Machine w 33lbs Storage Bin Advanced LCD Panel Perfect for RestaurantFood TruckBarUnder Counter",
  "link": "https://m.media-amazon.com/images/I/71khxSgy9JL._AC_SX522_.jpg",
  "detail": "【Powerful and Safe for Commercial Use】 With 15 5/16 x 14 5/8 x 31 3/8 inches and weight of 55.12 pounds, FREE VILLAGE restaurant ice maker equips with strong 380W compressor, providing powerful capacity of intensive operation for more than daily use. Meanwhile, the ice machine commercial is durable and safe because of its body’s three-layer materials which is include food-grade ABS, thermal insulation and solid stainless cover."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739187"
  },
  "asin": "B0B8ZBWTBX",
  "title": "Digital Picture Frame  Benibela 101 Inch WiFi AI Smart Electronic Photo Frame with IPS Touch Screen AI Recognition 2 Filter 32GB Slideshow Display Share Photo Video Anywhere via Email App USB",
  "link": "https://m.media-amazon.com/images/I/71NuKFWq8AL._AC_SX679_.jpg",
  "detail": "[Easy to Use] The smart digital picture frame has a built-in speaker at the back of the frame, which is convenient to play videos with families. In addition, the gravity-sensing auto-rotation feature allows photos to adjust directions in portrait or landscape orientation to fit the digital picture frame as you like. It is convenient for the elderly to use it."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73918c"
  },
  "asin": "B0B996HNX9",
  "title": "Digital Picture Frame  Benibela 101 Inch WiFi AI Smart Electronic Digital Photo Frame Touch Screen 32GB AutoRotate AI Recognition 2 Filter Modes Share Video via Email App USB Wall Mountable",
  "link": "https://m.media-amazon.com/images/I/710ZAEdVocL._AC_SX679_.jpg",
  "detail": "[Personalize Your Unboxing Surprise Before Giving It as a Gift] The Benibela Wi-Fi digital picture frame has a free App, \"VPHOTO\", for photo sharing. By removing the sticker on the back of the box, you can pre-load photos and videos (by scanning the QR Code) before gifting. Personalize your unboxing surprise for your family. The 10.1-inch Wi-Fi digital photo frame for photos is designed with 32GB built-in memory, which can import over 30,000 photos and videos at one time. Let's start a trip down memory lane!"
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739191"
  },
  "asin": "B0B9H5KHZG",
  "title": "Waterfall Bathroom Faucet WaterSong 3Holes 8Inch Bathroom Sink Faucet for Rotatable Design 2Handle Vanity Faucet with Supply Lines Widespread Spout Faucet for RV Bathroom Sink Brushed Nickel",
  "link": "https://m.media-amazon.com/images/I/61-JAfNlV9L._AC_SX466_.jpg",
  "detail": "Ceramic Valve Core - The 3 holes sink faucet uses a high-quality ceramic valve core, which has passed thousands of opening and closing tests. The anti-drip design and its durability ensure that the faucet has a service life of up to 10 years."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739196"
  },
  "asin": "B0B9NJ7DHG",
  "title": "Airdog Humidifier Replacement Filter",
  "link": "https://m.media-amazon.com/images/I/611C9hC-HtL._AC_SY450_.jpg",
  "detail": "This filter can only be used for Airdog humidifier. For your more comfortable experience, it is recommended to clean the filter every week and change the filter every 3 months."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff739197"
  },
  "asin": "B0B9SH8B54",
  "title": "niupipo Pickleball Paddles Lightweight Pickleball Rackets wFiberglass Surface Fiberglass Surface Pickleball Set with 4 Pickleball Balls and 1 Bag",
  "link": "https://m.media-amazon.com/images/I/71Y9uRxHZOL._AC_SY450_.jpg",
  "detail": "[Lightweight Paddle with USAPA Approved Size] Excellent material selection and product design make this pickleball paddle weigh only 7.8oz, reducing the pressure on your wrists and shoulders. This means that children and seniors, beginners to intermediate players, can play pickleball for a long time. Also, the size of the pickleball racket is ? 10 5/8\" L x 7 7/8\" W x 19/32\" H. This pickleball paddle set of 4 has wide paddles of 7 7/8\" with large sweet spots that help you to reduce missed hits."
},
{
  "_id": {
    "$oid": "65b247f9d7793d69ff73919c"
  },
  "asin": "B0B9SHY3GD",
  "title": "niupipo Pickleball Paddle USAPA Approved Pickleball Paddle with Fiberglass Face Protective Cover Ultra Cushion Polypropylene Honeycomb Core 45Inch Grip Lightweight",
  "link": "https://m.media-amazon.com/images/I/81Q9+TFdk+L._AC_SY450_.jpg",
  "detail": "What's Include The pickleball paddle set includes 2 Firberglass pickleball paddles+2 indoor balls and 2 outdoor balls, These 2 paddles has has a fiberglass face with a honeycomb polymer core enhances the strength and elasticity of the pickleball racquet.And 2 different type of pickleball balls can meet the needs of players in different scenarios which made a wonderful Valentine's Day gift for your love."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391a1"
  },
  "asin": "B0B9SJ7TX1",
  "title": "niupipo Pickleball Paddle USAPA Approved Pickleball Paddle with Fiberglass Face Protective Cover Ultra Cushion Polypropylene Honeycomb Core 45Inch Grip Lightweight",
  "link": "https://m.media-amazon.com/images/I/81MthKF7AFL._AC_SX466_.jpg",
  "detail": "[Premium Racket Construction and Materials] The pickleball paddle features a durable polymer honeycomb inner core construction. The pickleball racket surface has good resilience and low noise. The reliable fiberglass racket face is light, strong, and powerful. High-quality protective edges protect the pickleball rackets for outstanding durability. As a big fan of pickleball, you care about the paddles’ durability, it won’t longer be a concern since it doesn’t need frequent replacement."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391a6"
  },
  "asin": "B0BB7CFMJY",
  "title": "102 in 1 Electric Screwdriver AM ARROWMAX Cordless Precision Screwdriver Set with 96 Magnetic Bits Red Dot IF Winning Design Rechargeable Electronic Screwdriver Set for Phone Laptop Camera Watch",
  "link": "https://m.media-amazon.com/images/I/71si3mOE7DL._AC_SX466_PIbundle-96,TopRight,0,0_SH20_.jpg",
  "detail": "[Ergonomic Design] The SES electric screwdriver handle adopts a square shape with a circular arc surface, while the manual screwdriver is designed with a rectangular non-slip handle, allowing arthritic hands to grip it without fatigue. The precision manual screwdriver with a 360-degree turn cap design, can be operated continuously with one hand. Our electric screwdriver can meet your multiple home maintenance needs (e.g. home, outdoors, travel, work, emergency, etc.)."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391ab"
  },
  "asin": "B0BB7NQ3PG",
  "title": "AM ARROWMAX Electric Screwdriver 102 in 1 Precision Screwdriver Set w 96 Magnetic Bits Red Dot IF Winning Design Rechargeable Mini Cordless Screwdriver for Phone Laptop Watch RC Black",
  "link": "https://m.media-amazon.com/images/I/71KKiTIA6rL._AC_SY355_PIbundle-96,TopRight,0,0_SH20_.jpg",
  "detail": "[Convenient & Comfort] Designed in an ergonomic cube shape that guarantees a comfortable and precise grip, our electric screwdriver set illuminates your workspace with the shadowless LED light and stay informed with the indicator. The holder and magnetic pads provide added convenience by securely holding screws, bits, and the screwdriver itself, allowing for seamless operation. When it comes to accessing tight spaces and tackling awkward angles, the extension rod effortlessly gets the job done."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391b1"
  },
  "asin": "B0BDFWQPSB",
  "title": "Rintuf Electric Fireplace Heater 1500W Infrared Fireplace Stove with 3D Flame Effect 5100BTU Electric Fireplace with Remote Control Ideal for Indoor Outdoor Home Use",
  "link": "https://m.media-amazon.com/images/I/71ayhJqcljL._AC_SY450_.jpg",
  "detail": "Classic & Portable Design: The Rintuf all-steel fireplace heater frame uses Classic retro church style combined with toughened glass to make your indoor fireplace heater look more polished. The 23.5\"(L) x 10.7\"(W) x 24.3\"(H) dimensions mean that the freestanding electric fireplace is easy to move from room to room and is ideal for homes, condominiums, lofts, apartments, and seasonal rooms."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391b6"
  },
  "asin": "B0BDK9YK4M",
  "title": "Rintuf Electric Fireplace Heater 1500W Infrared Fireplace Stove with 3D Flame Effect 5100BTU Electric Fireplace with Remote Control Ideal for Indoor Outdoor Home Use",
  "link": "https://m.media-amazon.com/images/I/81RgxPAQEML._AC_SY450_.jpg",
  "detail": "1500W Fast Heating & 5100BTU Heating Capacity: Rintuf freestanding electric fireplace boasts a max 1500Watt of power that can warm your room quickly and effectively in winter, especially for basement apartments, living rooms, or bedrooms. The indoor use fireplace heater with 5100 BTU heating capacity makes the warm air cover up to 800 sq. ft. space. Run on electricity, less cost and maintenance than traditional central butance heating."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391bb"
  },
  "asin": "B0BDRKX74G",
  "title": "PKX RC Cars for Adults  31 KPH High Speed Monster Truck Remote Control 4X4 Waterproof Off Road Car w74V Battery 116 Large Scale Remote Control Car All Terrain Drift RC Car Gift for Boys Kids",
  "link": "https://m.media-amazon.com/images/I/81l4mb0YX5L._AC_SX569_.jpg",
  "detail": "[Rugged & Durable] The PKX remote control monster truck for boys 8-12 is designed for durability with aluminum ringed shocks to minimize crash damage and double-sealed ball bearings for improved performance and longevity. PKX rc rc car for adults' deep-tread tires are ideal for off-roading and provide strong traction, making Monster rc truck a formidable competitor in off-road races and perfect for Monster RC truck enthusiasts. The off road truck also features independent suspension and a PVC body that is both flexible and long-lasting, choose this remote control car for you."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391c0"
  },
  "asin": "B0BGPH5165",
  "title": "Bathroom Faucet WaterSong 2Handle Bathroom Sink Faucet 360Rotating Head ColdHot Wide Waterfall Spout Faucet for 2Hole and 3Hole Sink 4 Inch Centerset Faucet 100 LeadFree Brushed Nickel",
  "link": "https://m.media-amazon.com/images/I/71aYQTGOyTL._AC_SX679_.jpg",
  "detail": "[Premium Brushed Nickel Finish] The Watersong bathroom faucet comes with an ultra-durable brushed nickel design, making the surface corrosion-resistant, rust-proof and scratch-proof. This modern bathroom faucet has a fashionable appearance, perfectly matching your bathroom sink, washbasin, RV, Lavatory, and vanity."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391c5"
  },
  "asin": "B0BJ6R27J2",
  "title": "Wireless Outdoor Security Camera 1080P HD Outdoor Camera with Color Night Vision AI amp PIR Motion Detection Easy to Install 2Way Talk CloudSD Storage Battery Powered Security Camera for Outdoor",
  "link": "https://m.media-amazon.com/images/I/61ts9WxrycL._AC_SY355_.jpg",
  "detail": "[Smarter Security Camera with SD/Cloud Storage] The outdoor security camera supports micro SD cards up to 128G, and the recorded video also can be saved on it. 2 Years Video History 3-Day Trial has been provided, and you can enjoy the storage service without any subscription. The HD security camera supports IP65 weatherproof and has been tested to endure extreme weather conditions, so you can install it outdoors without worry."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391ca"
  },
  "asin": "B0BJF17XQQ",
  "title": "Keyless Entry Door Lock Electronic Deadbolt Lock with Touchscreen Keypad Smart Deadbolt Easy to Install 50 User Codes Auto Lock Safe Waterproof Smart Lock for Front Door Home Use Apartment",
  "link": "https://m.media-amazon.com/images/I/61UgY6u6VAL._AC_SY450_.jpg",
  "detail": "[Adaptive Left and Right Door Design] Unlike other locks, ELAMOR keyless entry door lock deadbolt is compatible with right-handed or left-handed doors, so you don't need to distinguish between the left and right door orientation to quickly install it. This door lock is designed to be easily installed without professional help, you just need 15 min and a screwdriver to get it done. Pick ELAMOR electronic deadbolt lock with touchscreen Keypads to take the first step towards a smart life."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391cf"
  },
  "asin": "B0BJVGNQY9",
  "title": "Safe Box 12 Cu ft Fireproof Cabinet Safe with Biometric Fingerprint amp Touchscreen Gun Safe with Removable Shelf amp Alarm System Safe for Secure Documents amp Valuables Safe Box for Home Hotel Office",
  "link": "https://m.media-amazon.com/images/I/81uhBnaIxUL._AC_SX355_.jpg",
  "detail": "[Dual Warning System] This safe box has a dual alarm system, which is triggered by reading continuously 5 times wrong fingerprint, entering 3 times wrong password, or being strongly impacted. When the alarm of the safe box is triggered, enter the correct password or use the effective fingerprint to clear the alarm. Note: Press the \"*\" again on the touchscreen to activate the vibration alarm mode after every trigger."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391d4"
  },
  "asin": "B0BK8DQ4H1",
  "title": "GUTA RV Solar Tire Pressure Monitoring System  Tire Pressure Monitoring System with 6 External Sensor 0188 PSI RV TPMS LCD Display Realtime Monitor Pressure Sleep Mode",
  "link": "https://m.media-amazon.com/images/I/71amab3GdxL._SX342_.jpg",
  "detail": "[Long-distance Stable Transmission] The GUTA tire monitoring system is equipped with durable and accurate external sensors, which are dustproof, waterproof, anti-lost, and snowproof. The GUTA sensors also support a long monitoring sensing distance of up to 36 feet. We can monitor the real-time tire pressure and temperature of up to 8 main tires and two spare tires. Therefore, this tire monitoring system can be used for vehicles like RVs, trailers, or trucks."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391d9"
  },
  "asin": "B0BKFMLB4W",
  "title": "Webcam Tripod iMiSES Professional Mini Webcam Stand Portable amp Lightweight Desktop Tripod for iMiSES Webcam CC1006CC1006SCC1016CC1006PLUS and Other Devices with 14 Thread",
  "link": "https://m.media-amazon.com/images/I/61EgiyqCZ+L._AC_SX679_.jpg",
  "detail": "[Adjustable Height and Angle] The iMiSES tripod stand is designed with three adjustable height levels from 7 1/8\" to 12 1/4\". The tripod head ball joint allows up to a 90-degree tilt. This allows you to easily find the perfect height for your tripod for webcams or lighting during video calls and live-streaming. Capture your best shots when the camera is on!"
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391de"
  },
  "asin": "B0BL12K64X",
  "title": "EMEET Dongle A200 USB Dongle",
  "link": "https://m.media-amazon.com/images/I/31SDeFYPWuL._AC_SY450_.jpg",
  "detail": "USB Dongle"
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391df"
  },
  "asin": "B0BLB236B5",
  "title": "FOPO 12 Triple Portable Monitor 1080P FHD IPS Triple Monitor Extender Triple Screen for Laptop of 13314 Compatible with WindowsMac Connect with USBCHDMINot for M1 M2 Chip ChromebookS12",
  "link": "https://m.media-amazon.com/images/I/71h+rGy5OgL._AC_SX569_.jpg",
  "detail": "Accessories Fully Included - FOPO provides you with all the accessories you need during using our triple monitor. The package includes a power adapter, two Type-C cables (video & power), two HDMI cables (video only), two USB-C to USB-A cables (only power), one cleaning cloth, two screen protectors, a hook-and-loop fastener and a portable triple monitor. [Notice: M1/M2 chip and laptop model Surface Pro/Go Series is not compatible with our monitor, but we support M1 Pro and M1 Max chip."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391e4"
  },
  "asin": "B0BLVR8KCZ",
  "title": "HappYard Height Adjustable Electric Standing Desk 47 x 23 Inches Adjustable Desk w 4 Memory Height Splice Board 2 Hooks 2 Outlet Boxes Adjustable Height Computer Desk for Home Office Walnut",
  "link": "https://m.media-amazon.com/images/I/7136gvMbcfL._AC_SX466_.jpg",
  "detail": "[Large Desktop and Stable Structure] The desktop is 47 1/5\" by 23 2/5\" in dimension. It can accommodate two monitors and more. The steel construction gives the standing desk's legs stability and long-lasting use. Thanks to the two beams of this standing desk, you will be well supported and your belongings protected. The sit-stand desk's wide T-shaped legs ensure stability even at the maximum height. The load capacity can be up to 176 lbs. The leveling feet will allow keeping your desktop level."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391e9"
  },
  "asin": "B0BMX83F32",
  "title": "WiFi Smart Lock Fingerprint Keyless Entry Door Lock with Handle Smart Lock for Front Door AntiPeeping Electronic Digital Keypad Door Lock Works with Alexa Remotely Control G2 Gateway Included",
  "link": "https://m.media-amazon.com/images/I/71ZGLQthWiL._AC_SY679_.jpg",
  "detail": "[6- in-1 Smart Keyless Entry Door Lock] The GEONFINO keyless entry door lock gives you 6 ways to unlock doors: fingerprint, APP control, IC card, passcode, physical key, and G2 Gateway. You can rest thanks to the possibility of generating up to 200 passcodes with different validity periods and sending them to your family, friends, or dog walker. Forget about having to rush home to open the door. The smart lock for front door can be unlocked in 0.5s, versatile for homes, offices, and hotels."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391ee"
  },
  "asin": "B0BMX8TH6T",
  "title": "Airdog X8 Air Purifier for Home Large Room Up to 4035ft2 Ionic Air Purifier with Washable Filter Remove 999 to 146nm Air Quality Detector 360 Air Cleaner for Smoke Pet Allergy Pollutant",
  "link": "https://m.media-amazon.com/images/I/51MwnWzj9OL._AC_SX679_.jpg",
  "detail": "[Patented Washable Filter] Do you know that HEPA filters that are not replaced in time may cause secondary pollution The TPA filter of the Airdog air cleaner is made from Graphene, which is washable and reusable for long life. Unlike HEPA filters, the Airdog X8 air cleaner is designed with vertical air circulation, not blocking the airflow with the increase of filter particles, which maintains almost the same filtration efficiency even after filtering the smoke of 440 cigarettes."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391f3"
  },
  "asin": "B0BN7LBNV4",
  "title": "Infrared Thermometer FKM NonContact Laser Temperature Gun 58F 1112F 50C  600C Adjustable Emissivity Heat Temperature Temp Gun for Cooking Pizza Oven Grill HVAC Engine Not for Human",
  "link": "https://m.media-amazon.com/images/I/61q9gCwkOhL._SX342_.jpg",
  "detail": "[Long Battery] This FKM infrared thermometer gun comes with a battery and its LCD screen turns off automatically to maintain long battery life. When the low battery indicator lights up, please replace it with a new 6F22 9V battery. Note: This temp gun thermometer is NOT suitable for human body/internal temperature use, it only measures the surface temperature of an object or liquid."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391f8"
  },
  "asin": "B0BN7PZ8DP",
  "title": "Digital Multimeter TRMS 6000 Counts DCAC Volt Meter Ohm Amp Meter Voltage Tester with NCV Function Accurate Resistance Continuity Diode Capacitance Tester for Automotive Battery Electronics",
  "link": "https://m.media-amazon.com/images/I/71-zMElcQiL._SX466_.jpg",
  "detail": "[Multifunction & Large Range] With 6000 counts, FKM True RMS digital multimeter accurately measures non-contact voltage test, DC/AC voltage, DC/AC current, continuity test, resistance, capacitance, frequency, tests diodes, batteries, firing line, and so on. The digital multimeter can measure up to 1000V DC voltage and 750V AC voltage, 20A DC/AC current, and 200MOhms resistance. It is ideal for automotive, household outlets, batteries (including vehicles), electronics, charging systems, etc."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff7391fd"
  },
  "asin": "B0BNHL6668",
  "title": "Standing Desk Electric Height Adjustable Desk with 100 Solid Walnut Wood Adjustable Height from 291476 Advanced Motor Silent amp Smooth Lift Smart Controller Sit Stand Desk for Home Office",
  "link": "https://m.media-amazon.com/images/I/719GjXY2rML._AC_SX425_.jpg",
  "detail": "[Adjustable Ergonomic Height] worried about a sedentary lifestyle would affect your body Do you feel pain due to the strained arms, legs, neck and back This stand up desk can alleviate these problems with an adjustable height from 29.1″ to 47.6″. This stand up desk will be suitable for most people of all heights and working positions. When you feel tired, standing up will improve your concentration and relieve your discomfort. This stand up desk will be your most valuable investment in health."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739202"
  },
  "asin": "B0BNQ8NBWZ",
  "title": "Ice Makers Countertop FREE VILLAGE Portable Ice Maker Countertop 9 Ice Ready in 6 Mins 26Lbs24H SelfCleaning Function Ice Machine with Ice Scoop amp Basket for HomePartyCamping Black",
  "link": "https://m.media-amazon.com/images/I/71QYfgoPjHL._SX385_.jpg",
  "detail": "[Ultra-Quiet & Durable Ice Machine Maker ] This table top ice maker machine operates at a very low noise level of less than 45 decibels, so you can enjoy the ice-making process in a peaceful and tranquil atmosphere. The FREE VILLAGE countertop ice maker is equipped with a quiet cooling fan that quickly dissipates heat from the compressor, allowing for extended use."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739207"
  },
  "asin": "B0BP7G1LMX",
  "title": "Ice Maker Countertop Fast Ice Making in 6 Mins 9 BulletShaped Ice 265lbs24Hrs Portable Ice Maker Machine with SelfCleaning Ice Scoop Ice Bags and Basket for HomeKitchenOfficeBarParty",
  "link": "https://m.media-amazon.com/images/I/61nDw8aVv9L._SX342_.jpg",
  "detail": "【Ice Maker with Portable Handle】Our compact Ice maker machine weighs only 14.74 pounds and comes with a carrying handle. With the compact size of 8.7*11.6*11.4 inches and with handle, the countertop ice maker can be easily moved to kitchens, coffee bars, offices."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73920c"
  },
  "asin": "B0BP7GF5LL",
  "title": "Ice Maker Countertop Fast Ice Making in 6 Mins 9 BulletShaped Ice 265lbs24Hrs Portable Ice Maker Machine with SelfCleaning Ice Scoop Ice Bags and Basket for HomeKitchenOfficeBarParty",
  "link": "https://m.media-amazon.com/images/I/61y1Vr1b+zL._AC_SX679_.jpg",
  "detail": "【6 Mins Fast Ice Making】The ice maker takes only 6 minutes a cycle to produce 9 bullets of ice. And is capable of producing 26.5 pounds of ice in 24 hours.If you are tired of going out to buy ice on a hot summer day. This ice maker countertop is the choice for you and your family."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739211"
  },
  "asin": "B0BP7HC9KV",
  "title": "Ice Maker Countertop Fast Ice Making in 6 Mins 9 BulletShaped Ice 265lbs24Hrs Portable Ice Maker Machine with SelfCleaning Ice Scoop Ice Bags and Basket for HomeKitchenOfficeBarParty",
  "link": "https://m.media-amazon.com/images/I/61aZWJppKLL._AC_SX466_.jpg",
  "detail": "【Bullet-shaped ice】Our portable ice maker produces clear, smooth, bullet-shaped ice cubes. Bullet-shaped ice quickly lowers the temperature of your drink, giving you an instant cool, refreshing drink on a hot summer day."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739216"
  },
  "asin": "B0BP7JNCGG",
  "title": "FOPO 133 Triple Laptop Screen Extender FHD 1080P IPS Triple Portable Monitor for Dual Screen Display Triple Screen for 1417 LaptopHDMIUSBC Plug and Play S16",
  "link": "https://m.media-amazon.com/images/I/51nfSRKj6-L._AC_SY450_.jpg",
  "detail": "FHD 1080P IPS 13.3 inch Screen - A Full HD 1920 x 1080P resolution, IPS screen, 74% NTSC delivers rich color and clear images in a 178°viewing angle. FOPO Triple Laptop Monitor has a low blue light design, which can protect your eyes. The 13.3 Inch dual laptop screen extender gives you a wider field of view and a better viewing experience.It is perfect for use in multi-person conferencing, code writing, stock analysis, travel work, academic research, and video conferencing."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73921b"
  },
  "asin": "B0BPPD5VZX",
  "title": "Commercial Ice Maker Machine Self Clean 100lbs24H Stainless Steel Ice Machine 45 CubesBatch in 1118 Minutes with 33lbs Ice Storage Bin Freestanding Ice Maker for RestaurantHomeFood Truck",
  "link": "https://m.media-amazon.com/images/I/71V9gyNFy4L._SX425_.jpg",
  "detail": "100lbs/24H with Larger Storage - Do you think the general ice maker is not enough to meet your needs of ice FREE VILLAGE commercial ice maker machine produce 45 ice cubes per batch to meet your entire family ice cubes needs. 33 lbs ice storage container allows you to enjoy adequate ice all year round without worrying about ice cubes overflow. And 100 lbs daily ice output satisfies you with high demands of ice, being able to make 400 cups of ice drinks per day(approximately)."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739220"
  },
  "asin": "B0BPPG649Y",
  "title": "Commercial Ice Maker Machine Self Clean 200lbs24H Stainless Steel Ice Machine 105 CubesBatch in 1118 Minutes with 48lbs Ice Storage Bin Freestanding Ice Maker for RestaurantHomeFood Truck",
  "link": "https://m.media-amazon.com/images/I/71aKNV9elKL._AC_SX522_.jpg",
  "detail": "? Automatic Cleaning and Transparent Window - Do you concern about the cleaning The ice maker help you to solve this issue by automatic cleaning function. It is only needed to be operate on smart panel( Operation induction can be found in User Manual).Besides, the transparent window on the cover allow you to check the status of ice making process, seeing the amount of ice in ice bin."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739225"
  },
  "asin": "B0BPSW1K11",
  "title": "Countertop Ice Maker Ice Maker Machine 6 Mins 9 Bullet Ice 265lbs24Hrs Portable Ice Maker Machine with SelfCleaning Ice Bags Ice Scoop and Basket Ice Maker for HomeKitchenOfficePartyRV",
  "link": "https://m.media-amazon.com/images/I/61Qf8Ztg1FL._SX425_.jpg",
  "detail": "[Portable & Compact] This ice machine maker countertop weighs only 14.74 pounds and is designed with a convenient carry handle. The small ice maker measures 8.7*11.6*11.4 inches, making it easy to transport. This ice machine maker is perfect for taking on the go, such as for RV camping, patio parties, or camping in the park. It is the perfect companion for enjoying life's special moments."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73922a"
  },
  "asin": "B0BPWR6XC7",
  "title": "Lepow Portable Monitor 156 Portable Screen w 1080P FHD IPS HDR FullFunction TypeC HDMI Plug amp Play Speakers Smart Case 2023 Updated Travel Monitor for Laptop Phone PS54 Xbox Switch",
  "link": "https://m.media-amazon.com/images/I/71OE7NQqewL._AC_SY450_.jpg",
  "detail": "[3 Display Modes] This external monitor has 3 display modes to enjoy. With the second screen mode, you will be able to multitask and improve your efficiency! You can also use this mode to share your screen but avoid showing the whole screen and maintain your privacy. With the duplicated mode, you and more people can enjoy watching the same content on this external monitor. Finally, with the extended mode, you can boost your phone display onto this bigger 15.6\" external monitor."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73922f"
  },
  "asin": "B0BQ6R8RPJ",
  "title": "Ice Maker  Commercial Ice Machine 100lbs24H 45 Cubic Meters per batch 1118 Minutes 33 lbs storage box Advanced LCD Panel with Transparent Indicator Freestanding for RestaurantFamilyFood Truck",
  "link": "https://m.media-amazon.com/images/I/71Y8gZ61PnL._SX342_.jpg",
  "detail": "??Automatic Cleaning and Blue Light Function - Do you concern about the cleaning The ice maker help you to solve this issue by automatic cleaning function. It is only needed to be operate on smart panel( Operation induction can be found in User Manual).Besides, our inside blue light improves the maintain time of ice, slowing down the speed of ice melting."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739234"
  },
  "asin": "B0BQHYTSW3",
  "title": "FQQ Triple Portable Monitor 1080P FHD IPS Laptop Screen Extender Full Function TypeC amp HDMI Ports 72 NTSC Plug amp Play Dual Monitor Extender for 133161 Laptops Switch Xbox S2 Black",
  "link": "https://m.media-amazon.com/images/I/71wtD3RpwbL._AC_SX425_.jpg",
  "detail": "[Wide Compatibility] The triple portable monitor is designed with full-function Type-C ports and Mini HDMI ports, which allow you to connect 13.3” to 16.1” laptops and game consoles such as Switches and Xbox. You don’t have to install any driver, just plug and play. The compatible systems include Windows, Mac, Linux, and Android. Please note that it is not compatible with MacBook M1&M2, Microsoft Surface Series (ARM chip), or Chromebook (ARM chip)."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739239"
  },
  "asin": "B0BQJ2L6HQ",
  "title": "154 Triple Portable Monitor 1080P FHD Laptop Monitor Extender with TypeC Mini HDMI Port Plug and Play Dual Screen Display for 156173 Laptopfor Windows and Mac M1 Max M1 ProSwitchXbox",
  "link": "https://m.media-amazon.com/images/I/71vQ2ifi-PL._AC_SX425_.jpg",
  "detail": "[Compatible with Various Devices] The triple portable monitor supports full-function Type-C ports and Mini HDMI ports, facilitating connections to laptops ranging from 15.6\" to 17.3\" as well as game consoles like Switch and Xbox. No additional drivers are required; simply plug and play. Compatible with Windows, Mac(Only for M1 Max & M1 Pro), Linux, and Android operating systems. Please note that it is not compatible with Microsoft Surface Series (ARM chip), or Chromebook (ARM chip)."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73923e"
  },
  "asin": "B0BQTZSV93",
  "title": "FREE VILLAGE Commercial Ice Maker Machine 100LBS24H Stainless Steel Ice Maker Machine 33LBS Storage 45PCS1118Mins Large Ice Maker with LCD Panel for RestaurantCoffee ShopOutdoor Kitchen",
  "link": "https://m.media-amazon.com/images/I/71Y8gZ61PnL._SX342_.jpg",
  "detail": "?[Easy to Install] Our ice maker machine countertop is designed to be easy to install. With just four simple steps, you can have your ice machine up and running in no time. We provide all the necessary installation parts, along with detailed instructions, to make the process as smooth as possible. Our ice machine produces high-quality, clear ice that is perfect for any beverage or food item. Whether you're serving cocktails, smoothies, or iced tea, our ice will make your drinks stand out."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739243"
  },
  "asin": "B0BQVRCCNW",
  "title": "FREE VILLAGE Nugget Ice Maker Countertop Pebble Ice Maker Machine 33lbs Per Day SelfCleaning with Basket Quiet Operation 12Qt Water Reservoir Portable Ice Machine for Home Office RV Party",
  "link": "https://m.media-amazon.com/images/I/71JmdpuUPPL._AC_SX425_.jpg",
  "detail": "[Rapid Ice Production] The powerful ice machine has a production capacity of 33lbs≈63Cups per day. This means that you can have ice ready for your first round of drinks in just 12 minutes! After that, it only takes 2 minutes to produce another round of pebble ice. The unused nugget ice is kept for about 30 minutes and then the ice maker will automatically continue to make ice. No need to worry about running out of ice when entertaining guests or spending quality time with family."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739248"
  },
  "asin": "B0BQVS8WSN",
  "title": "FREE VILLAGE Dehumidifier 45 Pints Dehumidifier for Basement Up to 3500 Sq Ft with Drain Hose Auto or Manual Drainage Full Water Auto Stop Auto Defrost 24H Timer Ideal for Home Bathroom Room",
  "link": "https://m.media-amazon.com/images/I/61h2weW9C0L._AC_SX679_.jpg",
  "detail": "[Smart Touch Control] This dehumidifier for bathroom adopts an LED smart control panel, with humidity reading, tank full reminder, auto stop, 24-hour timer, auto defrost, and child lock function, improving the comfort of your home. The 24-hour on/off function allows you to preset the time to start or stop the dehumidifier for bathroom (1?24 hours) and reduces energy consumption."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73924d"
  },
  "asin": "B0BQVTT59D",
  "title": "FREE VILLAGE Dehumidifier 45 Pint 50 Pint Under 90F90 RH Dehumidifiers for Home Up to 3500 Sq Ft Digital Control Panel Auto Drainage 24 Hr Timer Dehumidifier for Basement Bathroom Bedroom",
  "link": "https://m.media-amazon.com/images/I/51Iu5JE3LBL._AC_SX425_.jpg",
  "detail": "[Ideal for Areas Up to 3,500 SQ. FT.] This FREE VILLAGE dehumidifier is able to remove 45 pints (50 pints Under 90°F/90%RH) of moisture a day. With its powerful capabilities, the air humidity can be decreased from 80% to a comfortable 30% swiftly. Our dehumidifiers provide a reliable solution to combat excess moisture in basement, bathroom, laundry room, bedroom, living room, or any space up to 3,500 SQ. FT. Make it your partner in maintaining optimal humidity levels in your home."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739252"
  },
  "asin": "B0BQYP4H8Z",
  "title": "EMEET C960 Webcam with Tripod 1080p Webcam with Microphone Adjustable Height Mini Tripod C960 Web Camera with Privacy Cover Plug amp Play Webcam with Stand for ZoomSkypeYouTubeFaceTime",
  "link": "https://m.media-amazon.com/images/I/61o5uDZ9buL._AC_SY450_.jpg",
  "detail": "[Full HD 1080P Webcam with Tripod] The EMEET's new and improved C960 computer webcam with professional mini tripod kit is designed and optimized for professional video. We keep the 1920 x 1080p video to provide smooth video. The fixed focal length keeps objects within a focal length range of 11.8 to 118.1 inches to provide sharper images. The C960 USB webcam comes with a privacy cover for your privacy protection needs. The webcam with a portable tripod is a great choice for your office."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739257"
  },
  "asin": "B0BQYX1MTZ",
  "title": "Rintuf 12000 BTU Portable Air Conditioner 550 sqft 2023 Ultra Quiet 3in1 Portable AC Unit Wide Oscillation 24H Timer Air Conditioner Portable for Room Remote Control amp Window Mount Kit",
  "link": "https://m.media-amazon.com/images/I/61+ERLZD2vL._AC_SX385_.jpg",
  "detail": "[Cooling in Minutes, Perfect for Large Rooms] Its 12000 BTU(ASHRAE) cooling capacity makes the Rintuf portable air conditioner cover rooms up to 550 sq. ft and offer you a fast and effective cooling effect in minutes, which is perfect for large rooms and cooling multiple rooms at the same time. With precise temperature control ranging from 61℉(16℃)~90℉(32℃), the Rintuf portable air conditioner keeps your bedroom, living room, kitchen, or office chilling even during the hottest summer days."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff73925d"
  },
  "asin": "B0BR34RM4L",
  "title": "2023 Upgrade Metal Detector for Adults 5 Modes Professional Gold Metal Detector with LCD Display IP68 Waterproof 94 Search Coil Metal Detector with Headphone for Treasure Hunting Easy to Use",
  "link": "https://m.media-amazon.com/images/I/71f9eo1ndNL._AC_SX466_.jpg",
  "detail": "?? [Perfect Gift with Accessories] The RM RICOMAX metal detector comes with headphones, a premium shovel, and a carrying bag, which is suitable for a beginner or a treasure hunter enthusiast. The metal detector is not only the ideal choice for travel, camping, and outings but also a great gift for birthdays, holidays, and anniversaries."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739263"
  },
  "asin": "B0BR5J21L8",
  "title": "Air Choice 12000 BTU Portable Air Conditioner 3in1 Portable AC Unit Up to 550 SqFt 24HR Timer Auto Swing Remote Control LED Display Air Conditioner Portable for Room Install Kit Included",
  "link": "https://m.media-amazon.com/images/I/51NCObAN3mL._AC_SX569_.jpg",
  "detail": "[12000 BTU Powerful Cooling] Enjoy the benefits of a cooling capacity of 12000 BTU and airflow of 400m3/h, which is perfect for rooms of up to 550 sq. ft. The portable air conditioner also features an auto swing function of 40°~90°, quickly cooling the entire house. With our portable air conditioner, you can stay comfortable and cool all through the hot summer days."
},
{
  "_id": {
    "$oid": "65b247fad7793d69ff739269"
  },
  "asin": "B0BR5KX5VJ",
  "title": "Air Choice Evaporative Air Cooler 3in1 Swamp Cooler 2000CFM with 12H Timer Remote Control 4 Ice Packs amp 79 Gal Water Tank Humidifying 3 Wind Speeds Evaporative Cooler for Outdoor Indoor Use",
  "link": "https://m.media-amazon.com/images/I/715eE5Q5ZTL._AC_SY450_.jpg",
  "detail": "[Lifesaver for Summer & Electricity Bills] Air Choice 3-in-1 evaporative air cooler functions as a fan, air cooler, and humidifier.The humidifying function adds moisture to relieve dry air symptoms like itchy eyes or dry skin in air-conditioned rooms. Compare traditional air conditioners with our swamp cooler—no complicated installation, lower maintenance costs, and less electricity usage for less stress on your electricity bills."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff73926e"
  },
  "asin": "B0BR7BCW28",
  "title": "Rintuf Portable Air Conditioner 8000 BTU Portable AC Unit with Dehumidifier amp Fan Modes Up to 350 SqFt Remote Control 24H OnOff Timer Quiet Air Conditioner Portable for Room Window Mount Kit",
  "link": "https://m.media-amazon.com/images/I/61KQnuBQ3uL._AC_SX425_.jpg",
  "detail": "?? [Triple Purpose] With 3 modes to choose from, including cooling, dehumidification, and fan, the Rintuf portable air conditioner can do it all. The 13.6 pints/day dehumidifying capacity makes your space cool, fresh, and dry. The 2-speed fan also satisfies your needs, circulating air throughout your room. Perfect for humid and hot areas."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739274"
  },
  "asin": "B0BR7FM1YW",
  "title": "Rintuf Portable Air Conditioner 10000 BTU Portable AC Unit with Dehumidifier amp Fan Up to 450 SqFt 24H OnOff Timer Quiet Air Conditioner Portable for Room Window Mount Kit amp Remote Control",
  "link": "https://m.media-amazon.com/images/I/61SoTwxG6VL._AC_SX466_.jpg",
  "detail": "?? [Cool & Quiet Summer Night] The Rintuf portable AC unit has a sleep mode function to ensure your sleeping comfort even in the hottest room of your home. With a 24-hour on/off timer, you can set it to automatically turn on/off as needed, making it energy efficient and keeping you cool when you need it most. Sleep peacefully through those hot summer nights."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff73927a"
  },
  "asin": "B0BR8YN68D",
  "title": "FOPO 12 Triple Portable Monitor FHD 1080P IPS Laptop Monitor Extender Full Function TypeC amp Mini HDMI Ports Plug amp Play Foldable Dual Screen Extender for 1316 Laptops Xbox Switch S12",
  "link": "https://m.media-amazon.com/images/I/71QYeEgBRzL._AC_SX569_.jpg",
  "detail": "[Improve Work Efficiency] The FOPO laptop screen extender increases your workspace and improves efficiency. You can show different contents on three monitors instead of opening multiple tasks on one screen, which impedes productivity. Also, the triple portable monitor supports a rotatable angle of 0-235 degrees on the left and 0-180 degrees on the right side, which easily allows you to share the screen with your colleagues at a conference."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff73927f"
  },
  "asin": "B0BRCNM8NM",
  "title": "Airdog Air Purifier Replacement Filter PreFilter Screen for Airdog Air Purifier X5 Effective Prefilter Captures Larger Particles Like Hair Dander etc 1Pack",
  "link": "https://m.media-amazon.com/images/I/31QwbgtjcAL._AC_SX342_.jpg",
  "detail": "[Compatibility] This prefilter screen is a filter replacement for the Airdog Air Purifier X5. This prefilter is part of the X5 Air Purifier's multi-stage filtration method."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739283"
  },
  "asin": "B0BRCS1Y8C",
  "title": "Airdog Air Purifier Replacement Filter Catalyst Filter for Airdog Air Purifier X5 HighEfficiency Composite Catalyst Filter Removes Ozone TVOC and Deodorizes Indoor Air 1Pack",
  "link": "https://m.media-amazon.com/images/I/3179EszJ5hL._AC_SX342_.jpg",
  "detail": "[Advanced Technology] The composite catalyst filter in the Airdog uses advanced catalytic technology to get rid of odors and TOVC quickly and effectively, keeping the air fresh and clean."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739286"
  },
  "asin": "B0BRN6GM5Z",
  "title": "DEPGI 156 Xbox Series S Portable Monitor 144Hz 2K QHD IPS Portable Gaming Monitor for Xbox Series S Not Included Xbox Portable Monitor with HDR AMD FreeSync 2X HDMI for Indoor Outdoor Travel",
  "link": "https://m.media-amazon.com/images/I/71u4WSY7ZmL._AC_SY355_.jpg",
  "detail": "[Wide Compatibility & 1 Year Warranty] The DEPGI 15.6\" Xbox portable monitor is equipped with 2 HDMI Ports, and 2 Earphone Jacks of 3.5mm, which can be compatible with most devices. You can connect the portable gaming monitor to an Xbox Series S, Switch, PS5, PC Computer, Laptop, etc. DEPGI provides a 1 year warranty and technical support. If you have any questions about our monitor, please feel free to contact us."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff73928b"
  },
  "asin": "B0BRZRWPTQ",
  "title": "Air Choice 3in1 Evaporative Air Cooler 1300CFM Swamp Cooler with 12H Timer Remote Control 4 Ice Packs amp 53 Gal Water Tank Humidifying 3 Wind Speeds Evaporative Cooler for Outdoor Indoor Use",
  "link": "https://m.media-amazon.com/images/I/71i5aKJ6EnL._AC_SY606_.jpg",
  "detail": "[Excellent Cooling Effect] Experience the refreshing power of the Air Choice 3-in-1 evaporative air cooler in seconds with its impressive max wind speed of 21.7 Ft/s, large 1300CFM air volume, and sizable 5.2 Gal water tank. Stay cool and comfortable with its efficient cooling and humidifying capabilities. Horizontal and vertical swing functions circulate the cooling wind evenly around the room. Say goodbye to the heat this summer with our secret weapon!"
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739290"
  },
  "asin": "B0BSGGF6J6",
  "title": "Trustech Portable 3 in 1 Air Cooling Cooler  Personal Mini Air Conditioner Fan w12 H Timer 500mL Water Tank 2 Speeds Adjustable Wind Direction Low Noise Ideal for Office Home Room Bedroom Dorm",
  "link": "https://m.media-amazon.com/images/I/71Cwno-7L7L._AC_SX679_.jpg",
  "detail": "【12H Timer & Energy Saving】Are you always forget to turn off the air conditioner and have to pay high electricity bills Our small personal air conditioner fan for the home can turn on & off automatically w/ the 12H timer and save the electricity bill efficiently. With high efficiency at 5W low power wattage, the small air cooler for the desk will not reduce your electricity bill, but also provide a cool and happy summer. Own one 3 in 1 Evaporative cooling fan for a springlike summer."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739296"
  },
  "asin": "B0BSR1LJZ4",
  "title": "hohem GO Auto Face Tracking Tripod 360 and 30 Rotation 2Axis AI Auto Tracking Tablet amp Phone Holder with Gesture Control for Live Streaming Vlog Video Recording Rechargeable for 10H Use No App",
  "link": "https://m.media-amazon.com/images/I/71GYmupYRJL._AC_SY679_.jpg",
  "detail": "[Easy Gesture Control for Hands-Free Shooting] The hohem GO phone stand for recording is easy for everyone. Without complex settings or adjustments, you can start tracking by making an \"OK\" gesture and stop the tracking by making a \"FIVE\" gesture, giving you the freedom to focus on your creativity. Please keep your gesture and your face within the recognition range. Gesture recognition range: 1.65~4.92 ft. Face recognition range: 1.65~9.84 ft."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff73929c"
  },
  "asin": "B0BTHG67R8",
  "title": "GEONFINO Smart Lock Fingerprint Keyless Entry Door Lock with Bluetooth APP Digital Electronic Keypad Deadbolt Touchscreen Auto Lock IP65 Waterproof Smart Deadbolt for Home Apartment Office",
  "link": "https://m.media-amazon.com/images/I/61iYSiFrXkL._AC_SX679_.jpg",
  "detail": "[Simple Installation] Setting up this smart door lock is quick and easy with just a screwdriver, following the provided instructions or video guide. The electronic keypad door lock also features a long-lasting battery life of around 12 months. Please make sure your door meets the installation specifications and note that the left or right side requires different installation methods."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392a1"
  },
  "asin": "B0BTHLC12Y",
  "title": "Fingerprint Door Lock 6in1 Keyless Entry Door Lock with Handle Touchscreen Keypad Bluetooth APP Auto Lock IP65 Easy Installation Electronic Digital Smart Door Lock for Front Door Home",
  "link": "https://m.media-amazon.com/images/I/61Yt+5YMpEL._AC_SX679_.jpg",
  "detail": "[6-in-1 Smart Keyless Entry Door Lock] Do you fish around your keys again Our smart door lock enables you 6 ways to unlock doors keyless, including fingerprint, APP control, IC card, passcode, mechanical key, and gateway (sold separately). Our smart door lock can unlock in 0.5s, versatile for hotels, apartments, and homes. Our keypad door lock even allows remote access, so you can unlock the door to let in your friends while you’re away. With our smart lock, you can leave your keys behind."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392a6"
  },
  "asin": "B0BTRPLBMV",
  "title": "DOG CARE Dog Training Collar for Large Medium Small Dogs with 1800 Feet Remote Range Rechargeable Dog Shock Collar with Beep Vibration and Shock Modes Safety Keypad Lock Rainproof Blue",
  "link": "https://m.media-amazon.com/images/I/61QznDX5NvL._AC_SY355_.jpg",
  "detail": "5 training modes - Dogcare electronic dog training collar with remote control provides five safe and efficient training modes (beep, vibration, vibration, safety and multiple control) to help you teach dogs basic obedience and solve the problem of uncontrollable dog behavior."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392ab"
  },
  "asin": "B0BTS112TV",
  "title": "OTIC 9Bluetooth Portable DVD Player with Bluetooth 90HD Swivel Screen5h Rechargeable Battery for CarampKidsHeadrest Mount CaseampHeadphoneRemoteSupport CDDVDSD CardUSBSync TVRegion Free",
  "link": "https://m.media-amazon.com/images/I/71LhOnhZKPL._AC_SX679_.jpg",
  "detail": "?? 【2023-UPDATED BLUETOOTH & LAST MEMORY FUNCTION】 OTIC 9.0 bluetooth portable DVD player is designed with bluetooh and last memory function. The 9.0\" upgraded DVD has very fine improvements to the Bluetooth function, with faster Bluetooth connection and faster matching to devices. which makes watching more convenient by restarting from the break point, professional audio equipment. And you can just connect with your AIRPHONES , HEADPHONES and SPEAKERS rather easy and quick!"
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392b2"
  },
  "asin": "B0BTS11QWP",
  "title": "DOG CARE Dog Training Collar for Large Medium Small Dogs with 1800 Feet Remote Range Rechargeable Dog Shock Collar with Beep Vibration and Shock Modes Safety Keypad Lock Rainproof Green",
  "link": "https://m.media-amazon.com/images/I/71U3nghZRAL._AC_SY450_.jpg",
  "detail": "Remote - Wireless control, remote distance can reach 1800 feet, and 1000 feet in case of obstacles! Use the Dogcare electronic dog training collar with remote control in the park or backyard to train your dog easily. Long battery life ensures effective dog training. Don't worry about interrupting your training progress if you charge for a long time."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392b7"
  },
  "asin": "B0BTSY9QP5",
  "title": "GEONFINO Smart Lock Bluetooth Keyless Entry Door Lock Touchscreen Keypad Deadbolt IC Card Security Waterproof Smart Lock for Home Office",
  "link": "https://m.media-amazon.com/images/I/71Lh0Xqh9FL._AC_SY606_.jpg",
  "detail": "[Bluetooth APP Control] With the TT Lock APP, you can generate timed, permanent, one-time, or custom passwords for guests, friends, and tenants, allowing them access on specific dates as needed. You can easily unlock your Electronic Keypad Deadbolt via Bluetooth for fast, stable, and secure access. Additionally, you can conveniently monitor real-time unlocking records through the APP, creating a secure and smart lifestyle for you."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392bc"
  },
  "asin": "B0BTYSCY96",
  "title": "hohem iSteady M6 Kit Gimbal Stabilizer for Smartphone 2023 Upgraded 3Axis Phone Gimbal AI Tracker wCCTRGB Fill Light Gimbal for iPhone 14 Pro Max amp Android Phone Stabilizer for Video Recording",
  "link": "https://m.media-amazon.com/images/I/711-fH2RhjL._AC_SY741_.jpg",
  "detail": "[18H Long Lasting Battery & Reverse Charging] With 18 hours of long-lasting battery life, you can take your time capturing the perfect shot without worrying about your gimbal dying halfway through your shoot. Additionally, the phone gimbal features reverse charging, allowing you to charge your phone directly from the gimbal, saving you from low battery anxiety on the go. And you can check the power and working status etc. in real time on the large 0.91-inch OLED display."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392c1"
  },
  "asin": "B0BTYT5DBK",
  "title": "hohem iSteady M6 Gimbal Stabilizer for Smartphone 2023 Upgrade 3Axis Phone Gimbal Gimbal for iPhone 14 Pro Max amp Android 360Infinite Rotation OLED Display Phone Stabilizer for Video Recording",
  "link": "https://m.media-amazon.com/images/I/71Uu+sS7j3L._AC_SY741_.jpg",
  "detail": "[7th-Gen iSteady Stabilization Algorithm] With the upgraded 3-Axis stabilization and iSteady 7.0 anti-shake technology, this phone gimbal is a game-changer for content creators of all levels. You can now capture breathtaking moments with unparalleled stability and smoothness, whether it's filming your passion project, vlogging your daily life, streaming your adventures, or taking stunning selfies. Elevate your content with iSteady M6 phone gimbal. Get yours now and unleash your inner filmmaker!"
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392c6"
  },
  "asin": "B0BVBC9ZB9",
  "title": "GOLDENMATE 12V 200Ah LiFePO4 Lithium Battery 5000 Deep Cycle Rechargeable Batteries Builtin BMS Perfect for RV Solar Power Wheels Fish Finder and Off Grid Applications",
  "link": "https://m.media-amazon.com/images/I/61qLEpCcctL._AC_SY450_.jpg",
  "detail": "??【Wide Applications】With high energy density, long cycle life and good performance, 12V LiFePO4 battery is widely used in most fields. It is the best choice for many applications such as UPS backup system, emergency lighting (LED), 12V router, RV accessories, outdoor camping, cycling toys, E-wheelchair, backup power supply, home alarm system, solar energy and off grid energy storage system etc."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392cb"
  },
  "asin": "B0BVBJ5ZVY",
  "title": "GOLDENMATE 12V 100Ah LiFePO4 Lithium Battery 5000 Deep Cycle Rechargeable Batteries Builtin BMS Perfect for RV Solar Power Wheels Fish Finder and Off Grid Applications",
  "link": "https://m.media-amazon.com/images/I/61Awe-74ApL._AC_SY450_.jpg",
  "detail": "??【What Will You Get】1*12V LiFePO4 battery. 24-hour quick response online customer service. Free replacement or refund within 30 days in case of quality problems. Lifelong professional technical support. We are committed to providing customers with outstanding customer service. If you have any questions, please feel free to contact us, Goldenmate support team is always at your service."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392d0"
  },
  "asin": "B0BVQLQBZ4",
  "title": "GEONFINO Keyless Entry Door Lock 6in1 Front Door Lock with App Control Bluetooth Fingerprint Door Lock with Handle Electronic Digital Keypad Smart Door Lock with AntiPeeping Auto Locking",
  "link": "https://m.media-amazon.com/images/I/61KXqjggDrL._AC_SY450_.jpg",
  "detail": "[Long Battery Life and Durability] This smart ? door ? lock boasts an 18-month battery life, providing uninterrupted functionality and convenience. Stay informed and never be caught off guard by low battery levels. Our lock features a convenient USB-A emergency charging port, allowing you to quickly recharge the battery when needed. Built with durability in mind, its IP65 waterproof rating ensures protection against the elements. Rain or shine, our deadbolt ? lock remains reliable and functional."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392d5"
  },
  "asin": "B0BVQMYRYS",
  "title": "FOPO 12 Triple Laptop Screen Extender Triple Portable Monitor for 1316 Laptop FHD 1080P IPS Dual Display with USBATypeCHDMI for WindowsMacOSSwitch S12",
  "link": "https://m.media-amazon.com/images/I/71tmFcKgqYL._AC_SX466_.jpg",
  "detail": "Triple Screens with 300% Productivity - Are you still switching keyboard back and forth hundreds times everyday Try Fopo S12 monitor! Born to make life simple - plug and play, no driver needed. This monitor has dual screens that allows you easily handle multi-tasks and can improve work efficiency by up to 300%. It is perfect for use in multi-person conferencing, code writing, stock analysis, travel work, academic research, and video conferencing."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392da"
  },
  "asin": "B0BW3P5QZB",
  "title": "FREE VILLAGE 1500 Sq Ft Energy Saving Dehumidifier WReusable Air Filter 24 Pints 30 Pints Under 86F90 RH  Ideal For Basements Home Large amp Medium Sized Rooms Bedrooms Bathrooms",
  "link": "https://m.media-amazon.com/images/I/51Yt-Q4a5vL._AC_SX466_.jpg",
  "detail": "[2 Real-time Humidity Display Ways] The LED digital display of the dehumidifiers ? for ? room provides a convenient and precise readout of the current humidity level. Additionally, our humidity level display light ring offers a simple and intuitive way to visualize the humidity level at a glance. Stay informed and in control of your indoor environment with our advanced dehumidifiers ? for ? home."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392e1"
  },
  "asin": "B0BW99PKCV",
  "title": "ELAMOR Keyless Entry Door Lock Smart Door Lock with Keypad Smart Deadbolt Auto Lock 50 User Codes IP54 Waterproof amp Easy Installation Electronic Door Lock for Front Door Apartment  M30 ORB",
  "link": "https://m.media-amazon.com/images/I/61kqi-1PRTL._AC_SY355_.jpg",
  "detail": "【Install Without Identifying Door Direction】Unlike other locks, ELAMOR electronic door lock allows for installation without having to identify the door's direction, making it a breeze to install. You won't have to struggle to figure out the correct orientation or spend a lot of money on a professional locksmith. With just a screwdriver and 15 minutes of your time, you can effortlessly install and program our smart lock yourself."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392e6"
  },
  "asin": "B0BWD7XMGP",
  "title": "FOPO 133 Triple Laptop Screen Extender FHD 1080P IPS Laptop Monitor Extender for 1417 Laptop HDMIUSBC Plug and Play Portable Monitor for Laptop S16 Black",
  "link": "https://m.media-amazon.com/images/I/51Qv5NJy5mL._AC_SY355_.jpg",
  "detail": "[Dual 13.3” Screens to Unlock Multitasking Potential]The FOPO S16 triple laptop screen extender increases your productivity by enlarging the work area giving users the option of extending or duplicating displays. It is ideal for persons who are in finance, design, or multimedia. The FOPO S16 triple laptop screen extender features two 1080P IPS panels with 74% NTSC and a 178°viewing angle, providing you with the same high-quality viewing experience as your original laptop."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392eb"
  },
  "asin": "B0BWJDWRR4",
  "title": "ProGearX Tripod Fluid Head Compact Tripod Pan Head with 360 Rotation 145 Pitch Angle Arca Quick Release Plate Handle Metal Panorama Head for Compact Video Camera DSLR Camera Mirrorless Camera",
  "link": "https://m.media-amazon.com/images/I/61qfRfYs4kL._AC_SY879_.jpg",
  "detail": "[Suitable for Various Devices] Are you still worried that the tripod ball head is not compatible with your old tripod or SLR A 1/4\" screw makes this tripod head can work with a wide range of cameras, including DSLRs, mirrorless cameras, video cameras, and spotting scopes. In addition, our tripod head is also designed with a 1/4\" screw mount and 1/4\"-20 to 3/8”-16 screw adapter, can be applied to tripods, monopods, slide, and jibs. You can adapt the screw mount to your specific needs."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392f0"
  },
  "asin": "B0BWJGSYN9",
  "title": "ProGearX Tripod Fluid Head Lightweight Tripod Pan Video Head with Leveling Base Quick Release Plate Handle Fluid Head for Spotting Scope Compact Video Camera DSLR Camera Mirrorless Camera",
  "link": "https://m.media-amazon.com/images/I/61yoXIMLGzL._AC_SY550_.jpg",
  "detail": "[Wide Compatibility] Do you have concerns that your old tripod or SLR camera may not be compatible with this tripod ball head No need to worry, our tripod head features a 1/4\" Arca-type quick-release plate that works with a wide range of cameras, including DSLRs, mirrorless cameras, video cameras, and spotting scopes. Additionally, it comes with a 1/4\" screw mount and a 1/4\"-20 to 3/8\"-16 screw adapter, making it suitable for use with tripods, monopods, slides, and jibs."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392f5"
  },
  "asin": "B0BWJJZPZG",
  "title": "Rintuf Portable Air Conditioner OLBKY41A012C12K white",
  "link": "https://m.media-amazon.com/images/I/517TmqsWwJL._AC_SX466_.jpg",
  "detail": "Portable Air Conditioner"
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392f6"
  },
  "asin": "B0BWRV79Q5",
  "title": "Wired Security Camera System EZFIX 4pcs 2MP1080P HD Outdoor Security Camera FullColor Night Vision 8CH DVR CCTV Camera IP66 Waterproof Motion Detection Instant Alert Remote Access No HDD",
  "link": "https://m.media-amazon.com/images/I/71hCUxRmrLL._AC_SY355_PIbundle-4,TopRight,0,0_SH20_.jpg",
  "detail": "[Advanced Motion Detection & Instant Alerts] The EZFIX security camera can detect the motion of people and vehicles in terms of their shapes, you can receive an instant alert via email and notifications from the authorized app. With remote access, you will know everything that happens precisely from any device at all times and in all places."
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff7392fb"
  },
  "asin": "B0BX94BJFR",
  "title": "EMEET C960 2K Webcam with Microphone 2K UHD 2 NoiseReduction Mics TOF Autofocus Streaming Webcam with Privacy Cover PlugampPlay USB Webcam for CallsConference ZoomSkypeYouTube LaptopDesktop",
  "link": "https://m.media-amazon.com/images/I/71wqF6H7AHL._AC_SY355_.jpg",
  "detail": "[Fast and Accurate Autofocus with TOF Technology] Our C960 2K webcam uses advanced Time-of-Flight (TOF) technology for fast and accurate autofocus. This ensures that the camera stays focused on you at all times, regardless of lighting or environmental conditions. With TOF, you won't have to worry about blurry or unfocused videos ever again!"
},
{
  "_id": {
    "$oid": "65b247fbd7793d69ff739301"
  },
  "asin": "B0BX9YJZGM",
  "title": "Benibela 215 Large Digital Picture Frame Wifi Digital Photo Frame with 19201080 IPS HD Screen Remote Control 32GB AutoRotate Send PhotoVideos Via APPEmailUSBSD Gift for Friend and Family",
  "link": "https://m.media-amazon.com/images/I/81N9ZL7kqOL._AC_SX466_.jpg",
  "detail": "[Blends in with Any Decor Style] This wifi digital photo frame has a classic look that blends in perfectly with any decor. It can even be used as an advertising board for product marketing or art painting decoration if you own a store. Customize the display with features such as time/weather, slideshow, and sleep mode, and add a picture description to make every moment a work of art. Upgrade your space with this versatile digital picture frame."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739306"
  },
  "asin": "B0BXDMSJZK",
  "title": "ProGearX Video Tripod Fluid Head Heavy Duty Fluid Video Head with Quick Release Plate 14 Expansion Port Max Load 132 lbs Tripod Head Mount for Video Cameras DSLR Cameras Filming Videography",
  "link": "https://m.media-amazon.com/images/I/71wzikk+kPL._AC_SY550_.jpg",
  "detail": "[Portability with MAX Load 13.2 lbs] This fluid video head for tripod is designed to handle the weight of your professional gear. With a maximum load capacity of 13.2 lbs, this fluid video head for tripod can effortlessly support heavy cameras, telephoto lenses, and other equipment, enabling you to push the boundaries of your photography and videography. Weight only 1.54 lbs, this fluid video head for tripod is easy to be carried and suitable for outdoor creation."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73930b"
  },
  "asin": "B0BXPCSZL9",
  "title": "Accessories for Evaporative Air CoolerRemote Control",
  "link": "https://m.media-amazon.com/images/I/91zR52WfuBL._AC_SY450_.jpg",
  "detail": "Accessories"
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73930c"
  },
  "asin": "B0BXPFD96T",
  "title": "Accessories for Evaporative Air CoolerRemote Control",
  "link": "https://m.media-amazon.com/images/I/91zR52WfuBL._AC_SY450_.jpg",
  "detail": "Accessories for Evaporative Air Cooler"
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73930d"
  },
  "asin": "B0BY81DZ63",
  "title": "DOG CARE Dog Training Collar with Remote  Dog Shock Collar for Large Small Medium Dogs with 1800FT Remote Rechargeable Dog Bark Collar with BeepVibrationShock Modes Security Lock Rainproof",
  "link": "https://m.media-amazon.com/images/I/5193-PzD50L._AC_SX450_.jpg",
  "detail": "IP67 waterproof and dust-proof - IP67 waterproof training collar allows dogs to play freely. You don't have to worry about wading or being afraid of mud when wearing it to meet the needs of multi scene training and give you maximum flexibility in outdoor activities without damaging the receiver."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739312"
  },
  "asin": "B0BY832B79",
  "title": "ProGearX VideoTripod Fluid Head Metal Video Head with VerticalHorizontal Function Switchable QR Plate for Arca Handle Fluid Video Head for Compact Video Camera DSLR Camera Mirrorless Camera",
  "link": "https://m.media-amazon.com/images/I/618ec1VN5sL._AC_SY741_.jpg",
  "detail": "[Switch to Vertical Shooting Easily] Are you eager to capture the moment with a dynamic video and share on social media Our video fluid head's upgraded vertical shooting function is your secret weapon. With a simple turn of the lock button, you seamlessly switch between horizontal and vertical shooting, effortlessly adapting to the scene before you. As you tilt your camera, the vertical & horizontal shooting bubble level guides you, ensuring that each shot is perfectly aligned and level."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739317"
  },
  "asin": "B0BY856M24",
  "title": "ProGearX VideoTripod Fluid Head Compact Video Head with VerticalHorizontal Switch Leveling Base QR Plate Telescopic Handle Pan Tilt Fluid Head for Compact Video Camera DSLR Mirrorless Camera",
  "link": "https://m.media-amazon.com/images/I/61yk4En1kDL._AC_SY606_.jpg",
  "detail": "[Lightweight yet Steady Build] Weighing just 1.01 lbs, this panorama head can accompany you on all your adventures. Don't let its small size fool you. This remarkable fluid head boasts an impressive load-bearing capacity of up to 6.61 lbs, allowing you to confidently mount such as the Canon 6D2 with a 70-200mm lens. Crafted with durable and sturdy aluminum alloy, our tripod fluid head guarantees the safety and stability of your valuable equipment throughout your shooting endeavors."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73931c"
  },
  "asin": "B0BYMFYN5Y",
  "title": "niupipo Pickleball Paddle USAPA Approved Pro Graphite Pickleball PaddlePaddles Set Polypropylene Honeycomb Core Cushion 472In Grip Portable BagPaddle Cover Lightweight Pickleball Racket",
  "link": "https://m.media-amazon.com/images/I/81XE-cRWPnL._AC_SX569_.jpg",
  "detail": "[Superior Balance between Power & Speed] The pickleball racquets provide quick reactivity and control thanks to the graphite face and polymer core. The pickleball racquet’s honeycomb structure is sandwiched between two graphite surfaces. The exclusive carbon fiber and shock absorption system helps distribute energy evenly throughout the paddle, relieving chronic elbow & wrist pain. All these features make this paddle an excellent choice for those who value superior control & a comfortable grip."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739320"
  },
  "asin": "B0BYZFCT6T",
  "title": "FREE VILLAGE Ice Maker Portable Ice Maker Countertop with SelfCleaning 26lbs24H 9 Cubes in 68 Mins Bullet Shape Compact Ice Machine with Ice ScoopBasket Perfect for HomePartyCampingBar",
  "link": "https://m.media-amazon.com/images/I/71uL11-vUpL._AC_SX425_.jpg",
  "detail": "[Auto Self-cleaning Function] The self-cleaning function allows deep cleaning in every corner of the countertop ice maker through water circulation. Simply press and hold the \"on/off\" button on the self cleaning countertop ice maker for 5 seconds to start the self-cleaning process. We recommend that, if the ice machine maker countertop will not be used for a long time, it must be cleaned and stored only after making sure the inside of the machine is dry."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739325"
  },
  "asin": "B0BZ4N4VHQ",
  "title": "AOSEED PLA Filament 175mm PLA 3D Printer Filament 1kG Spool 22 lbs Dimensional Accuracy  002mm 3D Printing Filament Green",
  "link": "https://m.media-amazon.com/images/I/81hpRcFgO-L._AC_SX522_.jpg",
  "detail": "[Safe & Environmental Friendly] AOSEED's PLA 3D Printer Filament is made of starch raw materials extracted from renewable plant resources such as corn without any whitening agents, giving your prints a clean and natural look. Making PLA filament an environmentally friendly option for your 3D printing projects. No irritating odor which is harmless to the human body, very light smell."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73932b"
  },
  "asin": "B0BZPZXMRZ",
  "title": "FitAlly Wireless CarPlay Adapter Wireless CarPlay Dongle wPlug amp Play 5GHz WiFi Fast amp Stable Auto Connection Online Update CarPlay Wireless Adapter for iPhone iOS amp Factory Wired CarPlay Cars",
  "link": "https://m.media-amazon.com/images/I/51dI25RgbsL._AC_SY355_.jpg",
  "detail": "[Plug & Play] Our Apple CarPlay adapter is designed for convenience and ease of use. With its plug-and-play feature, you can simply connect it to your car and start using it right away. Plus, our adapter supports auto-connection, so you don't have to worry about manually connecting your device every time. Just turn on your car, and the adapter will automatically connect to your phone or device. With our CarPlay adapter, you can enjoy a hassle-free and seamless driving experience."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739330"
  },
  "asin": "B0BZYG1XF8",
  "title": "FQQ 14 Triple Laptop Monitor Extender 1920  1200P FHD IPS Portable Monitor for 15  173 Laptop 1610 Dual Monitor Display for WinMAC HDMIUSBC Plug amp Play Not for Chromebook S15 Black",
  "link": "https://m.media-amazon.com/images/I/71ZpGViG3sL._AC_SX569_.jpg",
  "detail": "[Dual 14” Screens for 300% Productivity] Each screen of the FQQ 14\" triple laptop monitor extender provides 35% more workspace than the 12\" one, which can allow you to multitask easier and improve visibility to reduce eye strain. The two 1920*1200P FHD IPS panels are both 72% NTSC HDR and 178° viewing angle, which can provide a clear display and richer color. The 16:10 screens are perfect for programming, graphic designing, document editing, stock analysis, and so on."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739335"
  },
  "asin": "B0BZYZXJHR",
  "title": "ELAMOR Front Door Handle with Deadbolt Set Black Front Door Lock Set with Interior Handle Easy to Install Adjustable Latch Reversible for RightampLeft Handed Exterior Door Handle for HomeHotel",
  "link": "https://m.media-amazon.com/images/I/61O+QiwqDiL._AC_SY679_.jpg",
  "detail": "[Sturdy & Durable] Elamor exceptional front door handle, is crafted to provide the perfect blend of strength, durability, and unmatched reliability. With an impressive track record of over 250,000 successful unlockable pass tests, this handle has proven sturdy and dependable. It offers exceptional resistance against wear and tear, ensuring it remains pristine for years."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73933a"
  },
  "asin": "B0C13DCL63",
  "title": "EMEET Conference Speakerphone Luna Plus Kit 81Mics 360 Voice Pickup Advanced Noise Reduction USB CBluetooth 53 Conference Speaker for 14 People wDaisy Chain for 25 Broad Compatibility",
  "link": "https://m.media-amazon.com/images/I/71fd7NC0-nL._AC_SY450_.jpg",
  "detail": "[5W Ultra-Clear Speaker & 10-Hour Call Time] Luna Plus Meeting Kit conference speaker comes with a long-lasting battery and a powerful, clear speaker. With a built-in 2600mAh battery, Luna Plus support 10-hour call time which can keep your all-day meeting on single charge. The 5W clear speaker is designed to provide crystal-clear voice quality, the maximum volume is increased to 89 dB, so you can communicate with confidence and ensure that your message is received loud and clear."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73933f"
  },
  "asin": "B0C1C5NJ3Y",
  "title": "ELAMOR Front Door Handle with Deadbolt Set Black Front Door Lock Set with Interior Handle Easy to Install Adjustable Latch Reversible for RightampLeft Handed Exterior Door Handle for HomeHotel",
  "link": "https://m.media-amazon.com/images/I/612+obc7i7L._AC_SY679_.jpg",
  "detail": "[Sturdy & Durable] Elamor exceptional front door handle, is crafted to provide the perfect blend of strength, durability, and unmatched reliability. With an impressive track record of over 250,000 successful unlockable pass tests, this handle has proven sturdy and dependable. It offers exceptional resistance against wear and tear, ensuring it remains pristine for years."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739344"
  },
  "asin": "B0C2YMJ32R",
  "title": "17 Inch Digital Picture Frame  Benibela 24G5G Dual WiFi AI Smart Electronic Digital Photo Frame Remote amp App Control Motion Sensor 32GB Wall Mounted Share Video via App Cloud Email USB43",
  "link": "https://m.media-amazon.com/images/I/81Fn2UlforL._AC_SX569_.jpg",
  "detail": "[Memory Filter & Museum Filter] The digital photo frame combines two filters: the memory filter and the museum filter. Our studies show us that older people prefer to remember their past through old photos, so we implanted these filters in the digital photo frame. They will feel that the photo frame will transport them back to the past. The clear screen will bring them amazing image quality. Its simple design, with touch function and automatic turn on/off, is easy for the elderly to use."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739349"
  },
  "asin": "B0C2YPYR2W",
  "title": "Digital Picture Frame Benibela 162 Inch 32GB 24G5G WiFi Smart Photo Frame with 1258  930 IPS Touch Screen Motion Sensor Remote Large Picture Frame for Sharing Photo Video via App Email USB",
  "link": "https://m.media-amazon.com/images/I/71hHUdrNhtL._AC_SX679_.jpg",
  "detail": "[Share Privately and Securely With Your Family] The large digital photo frame equip with a free \"VPHOTO\" App, which does not collect any personal information when in use, so you don't have to worry about your privacy being exposed. Plus, you can invite your family to connect to your photo and video sharing frame, creating a private family sharing network."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73934e"
  },
  "asin": "B0C3BVR4QQ",
  "title": "Wired Security Camera System EZFIX 4 PCS 2MP1080P HD Outdoor Security Camera with 1TB Hard Drive FullColor Night Vision 8CH DVR CCTV Camera IP66 Waterproof Motion Alert Remote Access White",
  "link": "https://m.media-amazon.com/images/I/71HGzJqfFhL._AC_SX466_PIbundle-4,TopRight,0,0_SH20_.jpg",
  "detail": "[1080P HD Full-Color Night Vision] The EZFIX wired security camera captures smooth and sharp recordings in 1080P Full HD resolution. You will be amazed by all the details of the home environment that you will be able to see with great clarity. The surveillance camera sees what moves at night with infrared night vision surveillance cameras, 2 infrared LEDs inside each camera will light up to give you up to 100ft night vision in the dark."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739353"
  },
  "asin": "B0C3CGMSSS",
  "title": "DEPGI 14 Portable Monitor for Xbox Series S Not included 60Hz 1080P HD IPS Portable Gaming Monitor with Remote Control Portable Monitor with HDR10 AMD FreeSync 2x HDMI for Indoor Outdoor Travel",
  "link": "https://m.media-amazon.com/images/I/71R74co6yrL._AC_SY741_.jpg",
  "detail": "[Wide Compatibility & 1-Year Warranty] The DEPGI 14\" portable monitor for Xbox Series S can be used with all your devices! With 2 HDMI Ports and 2 Earphone Jacks of 3.5mm, this monitor is compatible with a wide range of devices, including Xbox Series S, Switch, PS5, PC Computer, and Laptop. With DEPGI's 1-year warranty and technical support, you can enjoy peace of mind knowing that you're covered in case of any issues. If you have any questions about our monitor, please feel free to contact us."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739358"
  },
  "asin": "B0C3GM895F",
  "title": "GOLDENMATE 12V 100Ah LiFePO4 Lithium Battery Rechargeable Battery Up to 15000 Cycles Builtin BMS Back up Battery for RV Solar Trolling Motor Fish Finder Power Wheels OffGrid Applications",
  "link": "https://m.media-amazon.com/images/I/71e8wwQ8ZAL._AC_SY450_.jpg",
  "detail": "[100% Protection] Goldenmate LiFePO4 battery comes equipped with a BMS that ensures completed protection against overcharging, over-discharge, over-current, overheating, and short-circuiting. Additionally, the battery boasts an exceptional self-discharge rate, enabling up to 1 year of storage without the need for maintenance after being fully charged. Also, the high & low-temperature protection can prevent the battery from being used when the temperature is too high or too low."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73935d"
  },
  "asin": "B0C4KVRK37",
  "title": "Lepow Portable Monitor 156 Inch Computer Display 19201080 Full HD USB TypeC IPS Eye Care Screen with HDMI Dual Speakers for Laptop PC PS4 Xbox Phone Included Smart Cover amp Screen Protector Black",
  "link": "https://m.media-amazon.com/images/I/71SMo3CM2ZL._AC_SX522_.jpg",
  "detail": "[Dual Speakers & HDR Mode ] 2 built-in speakers efficiently helps display multi-media files especially when listen to music/watch movies/play games. HDR mode support excellent mainstream transmission so that you can enjoy great video transmission in game and other entertainment."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739362"
  },
  "asin": "B0C4PVG8BK",
  "title": "FOPO 14 Laptop Screen Extender FHD 1080P HDR IPS Triple Portable MonitorTypeCHDMI Ports Foldable Dual Monitor for 1517 Laptop with WindowsMacOnly for M1 Max M1 Pro Switch Xbox  S19",
  "link": "https://m.media-amazon.com/images/I/71fb-yeqzML._AC_SY450_.jpg",
  "detail": "[Back Bracket & Foldable Design] The FOPO laptop portable monitor is designed with an adjustable bracket at the back of the frame, so you can adjust the length to a comfortable viewing angle and keep stability without falling off. Also, the dual monitor extender is foldable, so it doesn′t take up space and can be taken with you wherever you go. Our portable monitor allows you to work with different applications and tasks windows at the same time, which boosts your productivity and saves time."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739367"
  },
  "asin": "B0C4PWRD9S",
  "title": "Wireless Outdoor Security Camera Kit 1080P Outdoor Camera w Color Night Vision AI amp PIR Motion Detection Easy to Install 2Way Talk CloudSD Battery Powered Security Camera Set for Home Black",
  "link": "https://m.media-amazon.com/images/I/61q2zye6-nL._AC_SX425_PIbundle-2,TopRight,0,0_SH20_.jpg",
  "detail": "[Elevate Your Security Smartly] Harnessing advanced AI recognition technology to discern between people, pets, vehicles, and packages, our wireless outdoor security cameras stand apart from traditional cameras. With customizable target settings and PIR motion detection on the app, you can trust in precise and accurate detection. Receive instant alert messages on your phone whenever this wireless outdoor security cameras detect motion, keeping you informed and in control."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff73936c"
  },
  "asin": "B0C4X58ZC2",
  "title": "Ice Makers Countertop 40Lbs24H 24pcs Ice Cubes Ready in 13 Mins FREE VILLAGE Portable Ice Machine with SelfCleaning Timer Quiet amp Easy to Use Ice Maker Ideal for HomeKitchenOfficeBarParty",
  "link": "https://m.media-amazon.com/images/I/71rWOygdvNL._AC_SX425_.jpg",
  "detail": "24 ICE CUBES IN 13 MINS & 40LBS EVERY 24 HOURS - FREE VILLAGE ice makers countertop can produce 24 ice cubes per cycle (every 13 to 18 minutes). That means you can make up to 40 pounds of ice cubes every 24 hours. Best of all, you can adjust the thickness of the ice cubes according to your needs, just enjoy a cold drink whenever you need with this ice machine."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739371"
  },
  "asin": "B0C535DSGL",
  "title": "Air Choice Portable USB Fan 4 Inch Mini Fan for Desk Personal Desk Fan with 46ft USB Cable Quiet and Powerful Small portable Fan for Home Office Black",
  "link": "https://m.media-amazon.com/images/I/61lIR0D9PtL._AC_SY450_.jpg",
  "detail": "[Space Saving Design] This portable fan is a high-quality and powerful mini fan. This 4-inch fan is very compact. It can provide you with plenty of wind power with high performance for relieving hot temperatures. The metal frame is stable and does not roll over easily. And the slim design takes up less space than other desk fans. Due to its compact and special design, this little desk fan can be placed on a table or hung on a baffle; it can be used anywhere."
},
{
  "_id": {
    "$oid": "65b247fcd7793d69ff739376"
  },
  "asin": "B0C6F3KC2X",
  "title": "Stud Finder Sensor Wall Scanner 4 in 1 Electric Wall Detector with LCD Display 4 Scanning Modes Sound Warning Beam Wall Scanner for The Center and Edge of Wood AC Wire Metal Grey",
  "link": "https://m.media-amazon.com/images/I/61JXl47SKsL._AC_SX569_.jpg",
  "detail": "4 Scanning Modes - The VIVREAL stud finder provides four scanning modes for all your detection needs. Depending on the task at hand, you can easily switch to the desired mode. Use the STUD SCAN mode for finding and locating the center and edges of wood or metal studs up to 3/4 in (19mm) deep. For deeper scanning, use the DEEP MODE to scan walls up to 1 1/2 in (38mm) deep. The METAL SCAN mode is perfect for locating and detecting metal, such as 1/2 inch rebar, up to 2 1/4 in (60mm) deep. And with the AC SCAN mode, you can locate live AC wires up to 2 in (51mm) deep. Get the job done right with the VIVREAL stud finder's versatile scanning modes."
},
{
  "_id": {
    "$oid": "65b247fdd7793d69ff73937b"
  },
  "asin": "B0C6MN64H4",
  "title": "Air Choice Evaporative Cooler 40 Portable Tower Fan with 70 Oscillating for Big Space 3 Speeds amp Modes 8H Timer 2 Ice Packs Removable Water Tank Portable Swamp Cooler with LCD Panel amp Remote",
  "link": "https://m.media-amazon.com/images/I/617Nkmvgp6L._AC_SX466_.jpg",
  "detail": "[Comfortable Cool with Humidification] Regardless you are living in hot and dry areas or worry about skin moisture loss after blowing, this Airchoice evaporative cooler would be your best choice in the hot summer. The ice packs and cool water will absorb unwanted heat and output cooler air with a comfortable humidity level. More than a fan, Airchoice offers a 3-in-1 device serving as an air cooler, tower fan, and humidifier."
}]